[{"id":"2021575","title":"Industrial Placement Programme","logo":"https://www.wikijob.co.uk/sites/default/files/styles/profile_job_post_logo/public/images/profiles/ms.jpg?itok=3L-AbVj2","company":"","job_role":"Accounting, Auditing &amp; Finance, Banking &amp; Financial Services, Business &amp; Management, Human Resources, IT &amp; Technology","summary":"Morgan Stanley is a leading global financial services firm providing a wide range of investment banking, securities, investment management and wealth management services.","description":"Morgan Stanley is a leading global financial services firm providing a wide range of investment banking, securities, investment management and wealth management services. The Firm has more than 1,200 offices in 43 countries, serving clients worldwide including corporations, governments, institutions and individuals.\n\nThe Industrial Placement Programme is available in Human Resources, Finance, Operations, Sales &amp; Trading and Technology and varies in length from 6-12 months. The programme provides both classroom and on-the-job training as well as valuable work experience. Recruits will be working alongside experienced colleagues on real projects and will gain exposure to all levels of professionals within the respective division. You will receive regular mentoring and coaching, as well as regular evaluation reviews to ensure your career is on track throughout your time with us and you continue to be developed along the way.\n\nRequirements:\n\nSales &amp; Trading, Finance &amp; Operations: Candidates pursuing a Bachelors, Masters or equivalent degree whose course syllabus mandates a 12 month placement in addition to a predicted 2:1 class degree or equivalent.\nTechnology: Candidates pursuing a Bachelors, Masters or equivalent degree whose course mandates a 6 or 12 month work placement. You must be currently pursuing an undergraduate or graduate degree in Computer Science, Mathematics, Electrical Engineering, Physics or other related science/engineering/technical disciplines.\n\nDuration of Placements:\nTechnology – 6 or 12 months \nFinance &amp; Operations – 12 months\nPrime Brokerage – 12 months\n\nLocation: London &amp; Glasgow\n\nSalary: Competitive\n\nStart Date: June 2015\n\nApplication deadline: Sales &amp; Trading – Saturday 29 November 2014, \nInfrastructure – Saturday 6 December 2014\n","url":"https://www.wikijob.co.uk/tracking_click/2021575/field_apply_now_button","salary":"","contract_type":"Contract","vacancy_type":"Placement","location":"United Kingdom","deadline":"07.12.2014"},{"id":"2021573","title":"Spring Insight Programme","logo":"https://www.wikijob.co.uk/sites/default/files/styles/profile_job_post_logo/public/images/profiles/ms.jpg?itok=3L-AbVj2","company":"","job_role":"Accounting, Auditing &amp; Finance, Banking &amp; Financial Services, Human Resources, IT &amp; Technology","summary":"Morgan Stanley is a leading global financial services firm providing a wide range of investment banking, securities, investment management and wealth management services.","description":"Morgan Stanley is a leading global financial services firm providing a wide range of investment banking, securities, investment management and wealth management services. The Firm has more than 1,200 offices in 43 countries, serving clients worldwide including corporations, governments, institutions and individuals.\n\nOur 1-week Spring Insight Programme is designed for those of you who have just embarked on your University course and wish to explore all the different areas at Morgan Stanley prior to qualifying for a summer internship the following year. The programme is a great opportunity for you to gain a thorough insight into our working environment and culture and explore the type of work you could be doing if you joined as an analyst after graduation.\n\nPlacement and duration\nThe week-long Spring Insight Programme will give you an overview of our Institutional Securities Group (ISG), including Investment Banking, Global Capital Markets (GCM), Sales &amp; Trading, Equity Research and Real Estate Investing. The Spring Insight Programme is held in London, beginning in late March or early April each year.\n\nTraining programme\nThe Programme consists of a mix of lecture-based sessions, educational activities and case studies, as well as the opportunity to shadow on a variety of desks. Throughout the week, you will work on the skills necessary for a career in Institutional Securities, honing your communication, presentation, teamwork, and interview skills. You will meet and network with Morgan Stanley employees at all levels.\n\nQualifications/skill/requirements\n* You have a minimum 320 UCAS points in the United Kingdom and an equivalent standard for students from outside the U.K.\n* You must be an undergraduate in your first year of a three-year degree course or your second year of a four year course and on target to graduate in 2017.\n\nApplication deadline: Saturday, December 13, 2014.\n\nLocation: London\n\nApplication &amp; Selection process: Online (CV and cover letter) at morganstanley.com/careers. You will be required to complete a set of online psychometric tests as part of your application.\n","url":"https://www.wikijob.co.uk/tracking_click/2021573/field_apply_now_button","salary":"","contract_type":"Contract","vacancy_type":"Internship","location":"United Kingdom","deadline":"14.12.2014"},{"id":"2021572","title":"Summer analyst Programme","logo":"https://www.wikijob.co.uk/sites/default/files/styles/profile_job_post_logo/public/images/profiles/ms.jpg?itok=3L-AbVj2","company":"","job_role":"Accounting, Auditing &amp; Finance, Banking &amp; Financial Services, IT &amp; Technology","summary":"Morgan Stanley is a leading global financial services firm providing a wide range of investment banking, securities, investment management and wealth management services.","description":"Morgan Stanley is a leading global financial services firm providing a wide range of investment banking, securities, investment management and wealth management services. The Firm has more than 1,200 offices in 43 countries, serving clients worldwide including corporations, governments, institutions and individuals.\n\nMorgan Stanley offers 10-week summer internships designed to attract, develop and assess the kind of people we feel are likely to succeed at our firm long-term. These well-structured programmes include training, workshops, senior management presentations and social events designed to give interns a unique experience in the financial services industry and provide a summer that is enjoyable and intellectually rewarding. While allowing you to experience Morgan Stanley and our culture first hand, internships and industrial placements also serve as the #1 pipeline for our full time programmes\n\nMorgan Stanley offers Summer Internships in Equity Research, Finance, Global Capital Markets, Investment Banking, Operations, Real Estate Investing, Risk Management, Sales &amp; Trading and Technology.\n\nWe may have additional off-cycle internships available throughout the year depending on business needs. Please check the Morgan Stanley website for more information.\n\nRequirements: Morgan Stanley accepts applications from all degree disciplines. Ideally you should be in your second year of a three year course or third year of a four year course and available to start full-time employment in 2015.\n\nLocation: London &amp; Glasgow\n\nSalary: Competitive\n\nDuration: 10 weeks\n\nStart Date: June 2015\n\nApplication deadline: Revenue: Saturday, November 29, 2014.\nInfrastructure: Saturday, December 6, 2014.\n\nApplication &amp; Selection process: Online (CV and cover letter) at morganstanley.com/careers. You will be required to complete a set of online psychometric tests as part of your application.\n","url":"https://www.wikijob.co.uk/tracking_click/2021572/field_apply_now_button","salary":"","contract_type":"Contract","vacancy_type":"Internship","location":"United Kingdom","deadline":"07.12.2014"},{"id":"2021439","title":"Spring into Banking","logo":"https://www.wikijob.co.uk/sites/default/files/styles/profile_job_post_logo/public/images/profiles/logotype_small_application_dbblue_centered.jpg?itok=TLyokSXe","company":"","job_role":"Banking &amp; Financial Services, Human Resources, IT &amp; Technology","summary":"We are a client-centric global universal bank with a fresh perspective.","description":"We are a client-centric global universal bank with a fresh perspective. One that is leading change and innovation in the industry – championing integrity, sustainable performance and innovation with our clients, and redefining our culture and relationships with each other.\n\nClients from all over the world trust us to deliver a wide range of innovative products and services in investment, corporate and retail banking as well as in asset and wealth management. \nWith operations in over 70 countries, we are a leader in our German home market and have an outstanding position in Europe. We also have a strong competitive position in North America as well as in key emerging markets, particularly in Asia.\n\nSpring into Banking\n\nSpring into Banking is a one-week introduction to a career in financial services and with Deutsche Bank that takes place in the Spring. Packed with skills sessions, job shadowing and networking opportunities, it gives you a real flavour of what it takes to succeed in our world, while taking a crucial first step in your career journey.\n\nThe program\n\nDescribed by one participant as “useful, informative, eye-opening and insightful”, this is a way to fast-track your career in finance and make good contacts in the banking industry.\n\nYour week starts with an introduction to working in banking. Led by expert trainers, you'll learn how financial markets work and get to know more about the way Deutsche Bank operates. You'll meet a variety of people, from analysts and associates right through to senior management – all of whom will help you to build a professional network that will serve you throughout your career.\n\nYou’ll be exposed to different areas of the bank, and over a 2.5 day period will have the opportunity to shadow various desks within a division to see what goes on behind the scenes. Described as the most enjoyable and valuable aspect of our program, there will also be opportunities to practice and develop your soft skills such as networking, presenting and interviewing.\n\nSpring into Banking is a program that not only recognizes your talent but also rewards it. At the end of the week you will gain early access to the interview process for the Analyst Internship Program.\n\nWho can apply?\n\nTo be eligible you'll be a first-year student completing a three-year degree or a second-year student completing a four-year degree. All degree disciplines are welcome and we’re looking for candidates who demonstrate a strong interest in working in financial services or have a passion for technology.\n\nApplication details\n\nApplications are reviewed on a rolling basis and deadlines close Sunday 4th January 2015.\n","url":"https://www.wikijob.co.uk/tracking_click/2021439/field_apply_now_button","salary":"","contract_type":"Temporary","vacancy_type":"First Year Schemes","location":"United Kingdom","deadline":"05.01.2015"},{"id":"2021438","title":"GROW (Graduate Outreach for Women)","logo":"https://www.wikijob.co.uk/sites/default/files/styles/profile_job_post_logo/public/images/profiles/logotype_small_application_dbblue_centered.jpg?itok=TLyokSXe","company":"","job_role":"Banking &amp; Financial Services, Human Resources, IT &amp; Technology","summary":"How do you get ahead in your career? And what skills do you need to succeed in this highly competitive environment, where agility is key?","description":"How do you get ahead in your career? And what skills do you need to succeed in this highly competitive environment, where agility is key? Graduate Outreach for Women (GROW) is a 6 month program to help prepare you to be technically competent and business savvy and discover for yourself whether a career in investment banking is right for you.\n\nGROW comprises of a number of key elements: education and awareness about the financial industry, a chance to build up your networks, training and workshops to help hone your technical and analytical skills, and an opportunity to be mentored.\n\nBecoming a GROW recipient is a chance to discover your potential. This program offers a tailored series of workshops and events. You will be provided with valuable skills training, industry exposure, development and networking opportunities. At the end, you will have the necessary skills and insight to be considered for the Analyst Internship Program.\n\nOverall, this is an opportunity to discover something different and whether a career in the investment banking sector - and at Deutsche Bank - is for you. Register today and be prepared to challenge yourself.\n\nTo be eligible, you must be in your first year of a three year degree course OR first and second year of a four year degree course\n\nTo find out more and be considered for the Program, please click below.\n","url":"https://www.wikijob.co.uk/tracking_click/2021438/field_apply_now_button","salary":"","contract_type":"Permanent","vacancy_type":"First Year Schemes","location":"United Kingdom","deadline":"01.09.2015"},{"id":"2021436","title":"Regional Analyst Graduate Program – Group Technology &amp; Operations - Birmingham","logo":"https://www.wikijob.co.uk/sites/default/files/styles/profile_job_post_logo/public/images/profiles/logotype_small_application_dbblue_centered.jpg?itok=TLyokSXe","company":"","job_role":"Banking &amp; Financial Services, IT &amp; Technology","summary":"We are a client-centric global universal bank with a fresh perspective.","description":"We are a client-centric global universal bank with a fresh perspective. One that is leading change and innovation in the industry – championing integrity, sustainable performance and innovation with our clients, and redefining our culture and relationships with each other. So if you’re talented, collaborative and curious about building an exciting career in finance, you’re exactly the type of person who might succeed in our organization.\n\nClients from all over the world trust us to deliver a wide range of innovative products and services in investment, corporate and retail banking as well as in asset and wealth management.\n\nWith operations in over 70 countries, we are a leader in our German home market and have an outstanding position in Europe. We also have a strong competitive position in North America as well as in key emerging markets, particularly in Asia. \nWe encourage our people to think for themselves and reward integrity. We believe that by working collaboratively with a diverse and inclusive team, you can use your individuality to drive forward market-leading solutions. Join us, and you’ll receive all the support you need to build a truly rewarding career.\n\nRegional Analyst Graduate Program – Group Technology &amp; Operations - Birmingham\n\nTechnology is the lifeblood of modern finance. It allows us to execute trades across multiple time zones. It informs our investment decisions. It shapes the way we work with other banks and with our clients. Without it, the world would look a very different place. And as a graduate with us, you'll influence where we take it next. You'll apply your thinking to complex challenges and push the boundaries of technological innovation, whether you join us in a management, analysis or development role.\n\nJoin us here, and you’ll constantly be looking ahead. We’ll look to you to capitalize on new technological trends that can reshape our business and deliver value for our clients, whilst still meeting the demands of customers, regulators and the markets.\n\nThe program\n\nThe Deutsche Bank Regional Analyst Graduate Program is one of the most comprehensive of its kind. You will begin classroom-based training to develop your technical and soft skills. You'll then embark on a career in Birmingham, where you'll go through job rotations of four months each. As you deepen your expertise in a specific role, exposure to different aspects of the business will broaden your skills.\n\nSkills you’ll need\n\nYou don’t need to be a technical expert to join  our Technology Team.  We're looking for people who combine broad business awareness with an interest in, and aptitude for, technology. Similarly, your degree can be in any discipline but Science, Technology (MIS, Informational), Engineering (Computer, Electrical, Industrial &amp; Operational, others), Math, Physics, Computer Science, and Business are particularly relevant. You’ll need an interest in the world of finance and the ability to communicate complex technological ideas to our business across the globe.\n\nIf you're in your final year of study and have the passion, dedication and speed of thought to succeed in the financial services industry, our Graduate Training Program could be exactly what you're looking for.\n\nApplication details\n\nApplications are reviewed on a rolling basis and close 28th December 2014.\n","url":"https://www.wikijob.co.uk/tracking_click/2021436/field_apply_now_button","salary":"","contract_type":"","vacancy_type":"Graduate Scheme","location":"United Kingdom","deadline":"29.12.2014"},{"id":"2021435","title":"Global Analyst Training Program","logo":"https://www.wikijob.co.uk/sites/default/files/styles/profile_job_post_logo/public/images/profiles/logotype_small_application_dbblue_centered.jpg?itok=TLyokSXe","company":"","job_role":"Accounting, Auditing &amp; Finance, Banking &amp; Financial Services, Business &amp; Management, Human Resources, IT &amp; Technology","summary":"We are a client-centric global universal bank with a fresh perspective.","description":"We are a client-centric global universal bank with a fresh perspective. One that is leading change and innovation in the industry – championing integrity, sustainable performance and innovation with our clients, and redefining our culture and relationships with each other. So if you’re talented, collaborative and curious about building an exciting career in finance, you’re exactly the type of person who might succeed in our organization.\n\nClients from all over the world trust us to deliver a wide range of innovative products and services in investment, corporate and retail banking as well as in asset and wealth management.\n\nWith operations in over 70 countries, we are a leader in our German home market and have an outstanding position in Europe. We also have a strong competitive position in North America as well as in key emerging markets, particularly in Asia.\n\nWe encourage our people to think for themselves and reward integrity. We believe that by working collaboratively with a diverse and inclusive team, you can use your individuality to drive forward market-leading solutions. Join us, and you’ll receive all the support you need to build a truly rewarding career.\n\nGlobal Analyst Training Program\n\nIf you’re in your final year of study and have the passion, dedication and speed of thought to succeed in the financial services industry, our Global Analyst Training Program could be exactly what you’re looking for.\n\nBeginning training with your global class, the program gives you a fantastic overview of the industry, our organization and the skills and support needed to excel in your chosen area.\n\nOpportunities available\n\nDeutsche Asset &amp; Wealth Management (DeA&amp;WM)\n\nProviding individuals and institutions with expert advice on traditional and alternative investment strategy as well as wealth management and private banking services to high-net-worth individuals and families.\n\nCorporate Banking &amp; Securities (CB&amp;S) - Markets (including Capital Markets &amp; Treasury Solutions)\n\nFocus on combining the sales, trading and structuring of a wide range of financial market products. This includes bonds, equities, foreign exchange, money market products, commodities and all forms of derivatives and structured investment, financing and risk management products.\n\nCorporate Banking &amp; Securities (CB&amp;S) - Corporate Finance\n\nProviding investment banking products and services to governments, financial institutions and major corporates. This is based on our expert knowledge of mergers and acquisitions, advisory, debt &amp; equity origination and issuance, and capital markets coverage.\n\nCorporate Banking &amp; Securities (CB&amp;S) – Research\n\nOffering in-depth industry knowledge on a global scale. Our multi asset-class research product generates consistent outperformance, for both internal and external clients. Our teams deal with a range of functions, from asset allocation to economic forecasting and cover all major global industry sectors.\n\nCorporate Banking &amp; Securities (CB&amp;S): Corporate Banking Clients (CBC)\n\nFocusing on the treasury-related needs of clients who can take advantage of the quality service and expertise of our Relationship Management team. Working closely with product specialists, we ensure relationships with our biggest international clients achieve their full potential.\n\nCompliance\n\nSafeguarding our culture of integrity and seek to protect its external reputation among clients, shareholders, regulators and society at large. We establish clear standards of behavior and policies to uphold them. We address risks and devise mitigation strategies.\n\nGlobal Transaction Banking (GTB)\n\nProviding commercial banking products and services for corporates and financial institutions worldwide. This includes domestic and cross-border payments, risk mitigation and financing of international trade as well as trust, agency, depositary, custody and related services.\n\nGroup Audit\n\nFocus on identifying potential risk exposure through offering vital insights into the adequacy of the design and the operating effectiveness of systems of internal control. Clients value the independent, consistent and objective assurance provided.\n\nGroup Finance\n\nOur five divisions – Finance, Tax, Treasury, Investor Relations and Corporate Insurance – provide accurate and timely financial information globally. We provide advice and analysis to our businesses and infrastructure functions, measuring performance and identifying areas to drive innovative change.\n\nGroup Technology &amp; Operations: Global Technology\n\nPioneer the latest technologies and business processes to deliver exceptional levels of innovation and world-class client service. The team continually face technological challenges caused by growth, market change and competition.\n\nGroup Strategy\n\nWork closely with senior leadership to help develop and implement major strategic decisions. The team perform a range of tasks from financial analysis to strategic development.\n\nRisk\n\nFocus on effectively managing our risk, capital and reputation. This is vital to our ability to adapt in an increasingly complex operating environment and enhances our strong risk culture.\n\nApplication details\n\nApplications are reviewed on a rolling basis and close Sunday 2nd November 2014.\n","url":"https://www.wikijob.co.uk/tracking_click/2021435/field_apply_now_button","salary":"","contract_type":"Permanent","vacancy_type":"Graduate Scheme","location":"United Kingdom","deadline":"03.11.2014"},{"id":"2021434","title":"Birmingham – Regional Opportunities","logo":"https://www.wikijob.co.uk/sites/default/files/styles/profile_job_post_logo/public/images/profiles/logotype_small_application_dbblue_centered.jpg?itok=TLyokSXe","company":"","job_role":"Accounting, Auditing &amp; Finance, Advertising, Marketing &amp; Public Relations, Banking &amp; Financial Services, Business &amp; Management, Human Resources, IT &amp; Technology","summary":"Many people assume London is the only place in the UK to begin a career in investment banking. Our team in Birmingham is proving that’s far from true.","description":"Many people assume London is the only place in the UK to begin a career in investment banking. Our team in Birmingham is proving that’s far from true. Home to one of our largest sales and trading floors in Europe, it provides sales, trading, Corporate Finance, and Deutsche Asset &amp; Wealth Management to a global client base.\n\nRegional Analyst Graduate Opportunities\n\nDeutsche Asset &amp; Wealth Management (DeAWM)\n\nProviding individuals and institutions with expert advice on traditional and alternative investment strategy as well as wealth management and private banking services to high-net-worth individuals and families.\n\nCorporate Banking &amp; Securities (CB&amp;S) - Markets (including Capital Markets &amp; Treasury Solutions)\n\nFocusing on combining the sales, trading and structuring of a wide range of financial market products; including bonds, equities and equity-linked products, exchange-traded and over-the-counter derivatives, foreign exchange, money market instruments, securitized instruments and commodities\n\nCorporate Banking &amp; Securities (CB&amp;S) - Corporate Finance\n\nProviding investment banking products and services to governments, financial institutions and major corporates. This is based on our expert knowledge of mergers and acquisitions, advisory, debt &amp; equity origination and issuance, and capital markets coverage.\n\nYour training and role\n\nYou’ll start with a five-week induction where we’ll provide you with some of the best technical and soft skills training available including Financial Conduct Authority qualifications. Your schedule will include networking events, orientation and business-specific training to help you make your mark as an analyst. This experience is an invaluable opportunity to gain a breadth of technical and product knowledge and to start building relationships that will be vital to you in your career with the Bank. After training, you can expect to take an active role in live deals and transactions, whilst developing a deep understanding of our clients’ businesses.\n\nSkills you'll need\n\nOur people are outstanding individuals with agile minds, from a diverse range of backgrounds and cultures. They generate fresh ideas and innovative solutions that set us apart from our competitors and add value to our clients. To launch your career here you’ll need to have strong quantitative, numerical and analytical skills, and the creative problem-solving abilities to make the most of these talents. In your final year of study, you’ve already proved you are highly motivated, have a strong team ethic and excellent communication skills.\n\nApplication details\n\nApplications are reviewed on a rolling basis and close 28th December 2014.\n","url":"https://www.wikijob.co.uk/tracking_click/2021434/field_apply_now_button","salary":"","contract_type":"Permanent","vacancy_type":"Graduate Scheme","location":"United Kingdom","deadline":"29.12.2014"},{"id":"2021433","title":"Analyst Internship Program - Group Technology &amp; Operations: Global Technology","logo":"https://www.wikijob.co.uk/sites/default/files/styles/profile_job_post_logo/public/images/profiles/logotype_small_application_dbblue_centered.jpg?itok=TLyokSXe","company":"","job_role":"Banking &amp; Financial Services, IT &amp; Technology","summary":"We are a client-centric global universal bank with a fresh perspective.","description":"We are a client-centric global universal bank with a fresh perspective. One that is leading change and innovation in the industry – championing integrity, sustainable performance and innovation with our clients, and redefining our culture and relationships with each other. So if you’re talented, collaborative and curious about building an exciting career in finance, you’re exactly the type of person who might succeed in our organization.\n\nClients from all over the world trust us to deliver a wide range of innovative products and services in investment, corporate and retail banking as well as in asset and wealth management.\n\nWith operations in over 70 countries, we are a leader in our German home market and have an outstanding position in Europe. We also have a strong competitive position in North America as well as in key emerging markets, particularly in Asia.\n\nWe encourage our people to think for themselves and reward integrity. We believe that by working collaboratively with a diverse and inclusive team, you can use your individuality to drive forward market-leading solutions. Join us, and you’ll receive all the support you need to build a truly rewarding career.\n\nAnalyst Internship Program - Group Technology &amp; Operations: Global Technology\n\nThe Deutsche Bank Analyst Internship Program – it’s the ideal introduction to a career with us. Get exceptional exposure to our organization. Stretch your skills. Experience working life in an investment bank all while receiving outstanding training and development.\n\nOur Technology team pioneers technologies and re-engineers business processes to deliver exceptional levels of innovation and world-class client service. From moving trillions of Euros through a business every day to integrating two organizations after a major acquisition, we face the technological challenges caused by growth, market change and constant competition.\n\nJoin us here, and you’ll constantly be looking ahead. We’ll look to you to capitalize on new technological trends that can reshape our business and deliver value for our clients, whilst still meeting the demands of customers, regulators and the markets.\n\nYour training\n\nIt all starts with an introduction to the world of Deutsche Bank and the technical and soft skills you’ll need to make an impact. Your training will continue throughout the summer as you learn first-hand through live projects how Deutsche Bank delivers for our clients. Throughout your time with us, you’ll network widely with exceptionally talented colleagues through events and speaker series held by our thought leaders. And because our internships are a rich source of talent for our Global Analyst Training Program, this could be an opportunity to launch a career with us.\n\nThe program\n\nWe’ll monitor your success through formal assessments and structured feedback. In addition, a manager will guide your weekly progress. Rest assured: your development will be intensely collaborative. We'll help you forge relationships with colleagues across the bank, while a community-action teamwork day will strengthen your relationship with other interns.\n\nYou’ll work to realize your potential and establish yourself within our bank. We invite you to bring us your talent, fresh thinking and passion for the world of finance. To succeed long term you will need a record of outstanding academic achievement, an excellent command of English and a high level of professionalism and integrity.\n\nYou can join us in a variety of roles within Global Technology. Whichever area you join, you’ll benefit from a strong mentoring scheme, a management team that’s dedicated to helping you progress, and responsibility for helping to deliver innovative global projects.\n\nSkills you’ll need\n\nYou don’t need to be a technical expert to join Global Technology.  We're looking for people who combine broad business awareness with an interest in, and aptitude for, technology. Similarly, your degree can be in any discipline but Science, Technology (MIS, Informational), Engineering (Computer, Electrical, Industrial &amp; Operational, others), Math, Physics, Computer Science, and Business are particularly relevant. You’ll need an interest in the world of finance and the ability to communicate complex technological ideas to our business across the globe.\n\nApplication details\n\nApplications are reviewed on a rolling basis and close Sunday 28th December 2014.\n","url":"https://www.wikijob.co.uk/tracking_click/2021433/field_apply_now_button","salary":"","contract_type":"Contract","vacancy_type":"Internship","location":"United Kingdom, England","deadline":"29.12.2014"},{"id":"2021431","title":"Analyst Internship Program ","logo":"https://www.wikijob.co.uk/sites/default/files/styles/profile_job_post_logo/public/images/profiles/logotype_small_application_dbblue_centered.jpg?itok=TLyokSXe","company":"","job_role":"Banking &amp; Financial Services","summary":"Deutsche Bank is a leading client-centric global universal bank.","description":"Deutsche Bank is a leading client-centric global universal bank. Clients from all over the world trust us to deliver a wide range of innovative products and services in investment, corporate and retail banking as well as in asset and wealth management.\n\nWith operations in over 70 countries, we are a leader in our German home market and have an outstanding position in Europe. We also have a strong competitive position in North America as well as in key emerging markets, particularly in Asia.\n\nWe encourage our people to think for themselves and reward integrity. We believe that by working collaboratively with a diverse and inclusive team, you can use your individuality to drive forward market-leading solutions. Join us, and you’ll receive all the support you need to build a truly rewarding career.\n\nAnalyst Internship Program\n\nThe Deutsche Bank Analyst Internship Program – it’s the ideal introduction to a career with us. Get exceptional exposure to our organization. Stretch your skills. Experience working life in an investment bank all while receiving outstanding training and development.\n\nIt’s a job with real responsibility. It’s a way of realizing your potential. It’s your chance to shine and potentially prove you’ve got what it takes to secure a place on our Global Analyst Training Program.\n\nOpportunities available\n\nDeutsche Asset &amp; Wealth Management (DeA&amp;WM)\nProviding individuals and institutions with expert advice on traditional and alternative investment strategy as well as wealth management and private banking services to high-net-worth individuals and families.\n\nCorporate Banking &amp; Securities (CB&amp;S) - Markets\nFocusing on combining the sales, trading and structuring of a wide range of financial market products; including bonds, equities and equity-linked products, exchange-traded and over-the-counter derivatives, foreign exchange, money market instruments, securitized instruments and commodities.\n\nCorporate Banking &amp; Securities (CB&amp;S) - Corporate Finance\nProviding investment banking products and services to governments, financial institutions and major corporates. This is based on our expert knowledge of mergers and acquisitions, advisory, debt &amp; equity origination and issuance, and capital markets coverage.\n\nCorporate Banking &amp; Securities (CB&amp;S) – Research\nOffering in-depth industry knowledge on a global scale. Our multi asset-class research generates consistent outperformance, for both internal and external clients. Our teams deal with a range of functions, from asset allocation to economic forecasting and cover all major global industry sectors.\n\nGlobal Transaction Banking (GTB)\nProviding commercial banking products and services for corporates and financial institutions worldwide. This includes domestic and cross-border payments, risk mitigation and financing of international trade as well as trust, agency, depositary, custody and related services.\n\nGroup Audit\nFocusing on identifying potential risk exposure through offering vital insights into the adequacy of the design and the operating effectiveness of systems of internal control. Clients value the independent, consistent and objective assurance provided.\n\nGroup Technology &amp; Operations: Global Technology\nPioneering the latest technologies and business processes to deliver exceptional levels of innovation and world-class client service. The team continually face technological challenges caused by growth, market change and competition.\n\nGroup Strategy and Inhouse Consulting\nWorking closely with senior leadership of the bank to drive its future, helping develop and implement major strategic decisions.\n\nGroup Strategy performs a range of tasks from financial analysis to strategic development.\n\nInhouse Consulting partners with internal clients to help develop effective managements solutions on revenue enhancements, costs and risk.\n\nRisk\nFocusing on effectively managing our risk, capital and reputation. This is vital to our ability to adapt in an increasingly complex operating environment and enhances our strong risk culture.\n\nApplication details\n\nApplications are reviewed on a rolling basis and deadlines are as follows:\n\nAnalyst Internship Program (Corporate Banking &amp; Securities and Asset &amp; Wealth Management), Sunday 16th November 2014.\n\nAnalyst Internship Program (Infrastructure &amp; Global Transaction Banking), Sunday 28th December 2014.\n","url":"https://www.wikijob.co.uk/tracking_click/2021431/field_apply_now_button","salary":"","contract_type":"Contract","vacancy_type":"Internship","location":"United Kingdom, England","deadline":"29.12.2014"},{"id":"2021407","title":"Public Sector Internal Audit (PSIA) Trainee","logo":"https://www.wikijob.co.uk/sites/default/files/styles/profile_job_post_logo/public/images/profiles/MAZARS-logo-mercureHEC-partenaire.jpg?itok=eqDeBhFI","company":"","job_role":"Accounting, Auditing &amp; Finance","summary":"An overview of the role","description":"An overview of the role\n\nThroughout your training contract you will learn about internal audit, control and risk management, specifically for public sector clients. You will develop a sound technical understanding of important issues surrounding organisations in the public sector while developing your report writing skills and interpersonal skills.\n\nYour day to day activities will include working to understand the operational and technological risks our clients face, allowing you to recommend improvements through detailed testing work, anticipate complex organisational issues and recommend preventative action to mitigate risk.\n\nThe work you conduct will be varied and may include technical fraud investigations, IT systems analysis and specific governance, risk and internal controls frameworks for a multitude of public sector clients including; Health Authorities; Local Authorities; Police Authorities; Fire Authorities; Higher Education Institutions and Housing Associations.\n\nAs your training contract progresses you will take on more senior work, be responsible for the supervision of others, have direct client contact and progress to become a senior member of the Governance, Risk and Internal Control team.\n\nHow we will support you\n\nWe will fund you to study towards the ACCA qualification or the IIA (Institute of Internal Auditors) qualification.\n\nYou will receive a full study package and time off to attend college but, with Mazars your professional qualification is only part of the story. We support all our trainees with a blended approach to training and development, classroom study, 1:1 coaching and support and, as you progress, technical and skills training to enable you to progress to management and leadership positions.\n\nYou will spend time away from the office to attend classes for tuition and revision stages of each exam. The classroom taught approach means that you will have the support of your peers and valuable study time for your exams.\n\nWe also operate a number of in-house training courses which will give you technical insight to assist you to keep up with changes in legislation and case law, both in the UK and worldwide.\n\nWhat we are looking for\n\nWe want driven professional individuals who excel at working with others, who have the ability to communicate at a high level and who share the same values as Mazars. Alongside this you must be able to demonstrate analytical skills, commitment, drive, commercial awareness, flexibility and creativity.\nAcademic requirements\n\nWe look for candidates who can demonstrate a strong academic track record.\n\nRequirements for ACCA study route:\nYou will have achieved, or be on course to achieve, at least a 2.1 in your first degree, although the subject of your degree is not important.\nYou’ll need at least 260 UCAS points (to have achieved in the same academic year, from your best 3 A Levels and excluding General Studies). \nWe also look for Grade B or above in GCSE (or equivalent) English Language and Maths.\n\nRequirements for IIA study route:\nYou will have achieved, or be on course to achieve, at least a 2.2 in your first degree, although the subject of your degree is not important.\nYou’ll need at least 240 UCAS points (to have achieved in the same academic year, from your best 3 A Levels and excluding General Studies). \nWe also look for Grade B or above in GCSE (or equivalent) English Language and Maths.\n\nIf there were extenuating circumstances that affected your result(s), please tell us in your application form so we can consider whether we take them into account\n\nClosing date for applications\n\nWe do not have a closing date for our vacancies, so you can apply all year round. However, competition is high so we would advise that you apply as early as you can.\n\nHow to apply\n\nTo apply for this opportunity please submit an online application via our graduate website.\n","url":"https://www.wikijob.co.uk/tracking_click/2021407/field_apply_now_button","salary":"","contract_type":"Permanent","vacancy_type":"Graduate Scheme","location":"United Kingdom, England","deadline":"01.09.2015"},{"id":"2021406","title":"External Audit School Leaver","logo":"https://www.wikijob.co.uk/sites/default/files/styles/profile_job_post_logo/public/images/profiles/MAZARS-logo-mercureHEC-partenaire.jpg?itok=eqDeBhFI","company":"","job_role":"Accounting, Auditing &amp; Finance","summary":"An overview of the role","description":"An overview of the role\n\nYour first year will be spent learning about Mazars methodology and developing your knowledge of accounting, financial reporting, tax and the business environment.\n\nYour day to day work will include the preparation of financial statements and working at client premises undertaking audit testing as part of the client service team.\n\nYour main responsibilities will be supporting the audit team in undertaking client audit assignments and preparing financial statements.\n\nAs your training contract progresses you will develop your knowledge and have the opportunity to work on more complex areas of the audit and take on more responsibility.\n\nHow we will support you\n\nWe will fund you to study towards the AAT (Association of Accounting Technicians) qualification.\n\nYou will receive a full study package and time off to attend college but, with Mazars your professional qualification is only part of the story. We support all our trainees with a blended approach to training and development, classroom study, 1:1 coaching and support and, as you progress, technical and skills training to enable you to progress to management and leadership positions.\n\nYou will spend time away from the office to attend classes for tuition and revision stages of each exam. The classroom taught approach means that you will have the support of your peers and valuable study time for your exams.\n\nWe also operate a number of in-house training courses which will give you technical insight to assist you to keep up with changes in legislation and case law, both in the UK and worldwide.\n\nWhat we are looking for\n\nWe want driven professional individuals who excel at working with others, who have the ability to communicate at a high level and who share the same values as Mazars. Alongside this you must be able to demonstrate analytical skills, commitment, drive commercial awareness, flexibility and creativity.\n\nAcademic requirements\n\nWe look for candidates who can demonstrate a strong academic track record.\nYou’ll need at least 280 UCAS points (to have achieved in the same academic year, from your best 3 A Levels and excluding General Studies). \nWe also look for Grade B or above in GCSE English Language and Maths.\n\nIf there were extenuating circumstances that affected your result(s), please tell us in your application form so we can consider whether we take them into account.\n\nClosing date for applications\n\nWe do not have a closing date for our vacancies, so you can apply all year round. However, competition is high so we would advise that you apply as early as you can.\n","url":"https://www.wikijob.co.uk/tracking_click/2021406/field_apply_now_button","salary":"","contract_type":"Permanent","vacancy_type":"Apprenticeship","location":"United Kingdom, England","deadline":"01.09.2015"},{"id":"2021405","title":" Audit Graduate Trainee","logo":"https://www.wikijob.co.uk/sites/default/files/styles/profile_job_post_logo/public/images/profiles/MAZARS-logo-mercureHEC-partenaire.jpg?itok=eqDeBhFI","company":"","job_role":"Accounting, Auditing &amp; Finance","summary":"An overview of the role","description":"An overview of the role\n\nYour first year will be spent learning about the role of an external auditor and the fundamental part they play in the successful management of any organisation.   You will have the opportunity to explore and understand the intricacies of how different organisations function effectively, across a wide range of industry sectors.  You will be working with a variety of clients, from large multinationals to smaller owner-managed businesses.\n\nAs an External Audit trainee, you will be involved in providing independent, third party reviews of the financial records of clients, evaluating all accounting, payroll and purchasing records, as well as any documents related to investments, stocks or fixed assets for example.  You will be required to provide an accurate, unbiased analysis of the company’s financial condition, making a fair and equitable approach essential.  You will also have the opportunity to establish effective working relationships based on mutual trust and respect with key players within a company, including management, non-executive directors and other advisers.\n\nYour day to day work will include assisting with all aspects of conducting a successful client audit, and your role will change naturally as you progress through the firm.\n\nYour main responsibilities in due course will involve supporting various audit teams with conducting a comprehensive service to clients.  You will assist with the delivery of certain aspects of the audit, the production of the financial statements, and the closedown of audit files, ensuring standards and procedures are maintained throughout.  You will also be required to work to agreed timescales and completion deadlines.\n\nAs your training contract progresses you will become more familiar with the different nature of business across a range of sectors, understanding the key disparities that an external auditor must be aware of to perform their role effectively.  You will also be able to demonstrate and apply technical, commercial, and industry knowledge, taking a pro-active approach to identify client issues and propose solutions.\n\nA role with Mazars will enable you to develop the skills and knowledge necessary to help you achieve your full potential, providing a truly rewarding start to your career.’\n\nHow we will support you\n\nWe will fund you to study towards the ACA (Association Chartered Accountants) qualification.\n\nWe will fund you to study towards CA (Chartered Accountants) qualification (for Scotland only)\n\nYou will receive a full study package and time off to attend college but, with Mazars your professional qualification is only part of the story. We support all our trainees with a blended approach to training and development, classroom study, 1:1 coaching and support and, as you progress, technical and skills training to enable you to progress to management and leadership positions.\n\nYou will spend time away from the office to attend classes for tuition and revision stages of each exam. The classroom taught approach means that you will have the support of your peers and valuable study time for your exams.\n\nWe also operate a number of in-house training courses which will give you technical insight to assist you to keep up with changes in legislation and case law, both in the UK and worldwide.\n\nWhat we are looking for\n\nWe want driven professional individuals who excel at working with others, who have the ability to communicate at a high level and who share the same values as Mazars. Alongside this you must be able to demonstrate analytical skills, commitment, drive, commercial awareness, flexibility and creativity.\n\nAcademic Requirements\n\nWe look for candidates who can demonstrate a strong academic track record.\n\nYou will have achieved, or be on course to achieve, at least a 2.1 in your degree, although the subject of your degree is not important. \nYou’ll need at least 280 UCAS points (to have achieved in the same academic year, from your best 3 A Levels and excluding General Studies). \nWe also look for Grade B or above in GCSE English Language and Maths.\n\nIf there were extenuating circumstances that affected your result(s), please tell us in your application form so we can consider whether we take them into account.\n\nClosing date for applications\n\nWe do not have a closing date for our vacancies, so you can apply all year round. However, competition is high so we would advise that you apply as early as you can.\n","url":"https://www.wikijob.co.uk/tracking_click/2021405/field_apply_now_button","salary":"","contract_type":"Permanent","vacancy_type":"Graduate Scheme","location":"United Kingdom, England","deadline":"01.09.2015"},{"id":"2021402","title":"Internship Opportunities at Citi ","logo":"https://www.wikijob.co.uk/sites/default/files/styles/profile_job_post_logo/public/images/company-logos/2011058-1409828764.jpg?itok=duEQ1OtH","company":"","job_role":"Accounting, Auditing &amp; Finance, Advertising, Marketing &amp; Public Relations, Banking &amp; Financial Services, Business &amp; Management, Human Resources, IT &amp; Technology","summary":"Citi’s global presence isn’t just a question of size; it’s a way of thinking.\n","description":"Since Citi opened its first office in New York in 1812, it has answered the needs of economies, businesses and communities in hundreds of cities, in over 160 countries, thriving in the most challenging times over a 200 year history. Citi’s global presence isn’t just a question of size; it’s a way of thinking.\n\nA career with Citi means being part of a global firm that provides the most forward-thinking financial products and solutions to the most enterprising corporations, institutions, governments and individuals around the world.\n\nCiti’s success is driven by its exceptional people – their passion, dedication and entrepreneurship – and it will be people just like you who will shape its future. At Citi, learning doesn’t stop at graduation and there are many ways to embark on a rewarding career path, enjoying the global opportunities and long-term training and development initiatives experienced by over 240,000 employees worldwide.\n\nWe have opportunities in:  Citi offers a ten week summer internship across a number of its business areas, including Investment Banking, Corporate Banking, Capital Markets Origination, Markets and Securities Services, Treasury and Trade Solutions (TTS), Investment Research, Private Bank, Risk Management, Human Resources, Operations and Technology. Penultimate or final year students interested in this industry with drive, commitment and a passion for learning are encouraged to apply.\n\nDeadlines to Apply\nWe open for applications at the beginning of September and review and recruit all applications on a rolling basis. We strongly advise that interested applicants apply as soon as possible.\n","url":"https://www.wikijob.co.uk/tracking_click/2021402/field_apply_now_button","salary":"","contract_type":"Temporary","vacancy_type":"Internship","location":"International, Europe, Middle East &amp; Africa, Asia Pacific, China, Hong Kong, Indonesia, Japan, Malaysia, Pakistan, Philippines, Singapore, South Korea, Taiwan, Thailand, Americas","deadline":"01.09.2015"},{"id":"2021401","title":"Spring Insight Opportunities at Citi ","logo":"https://www.wikijob.co.uk/sites/default/files/styles/profile_job_post_logo/public/images/company-logos/2011058-1409828764.jpg?itok=duEQ1OtH","company":"","job_role":"Accounting, Auditing &amp; Finance, Banking &amp; Financial Services, Business &amp; Management, Human Resources, IT &amp; Technology","summary":"At Citi, learning doesn’t stop at graduation and there are many ways to embark on a rewarding career path, enjoying the global opportunities and long-term training and development initiatives.\n","description":"Citi’s success is driven by its exceptional people – their passion, dedication and entrepreneurship – and it will be people just like you who will shape its future. At Citi, learning doesn’t stop at graduation and there are many ways to embark on a rewarding career path, enjoying the global opportunities and long-term training and development initiatives experienced by over 240,000 employees worldwide.\n\nWe have opportunities in:  Citi offers spring insight programmes enabling students in their first year (or in their second year of a four year course) to experience first-hand the Citi culture and environment. These programmes are:\n\nCiti Quest\nThis 5 day work-experience programme will see you placed within a specific business area of your choice. This is a great chance for you to really get to know what life is like at Citi, and for us to get to know you.\n\nWomen of Tomorrow\nCiti are focused on encouraging more women to consider banking, and this 3 day programme is designed to provide female students with an insight into the different career paths. Our hands-on workshops and work-shadowing will all help you to understand the skills necessary to succeed.\n\nCiti Scope\nIf you are interested in working in finance, but not sure which area is right for you then this 3 day programme will help you decide.  Through presentations, workshops and work-shadowing you will learn all about the bank and what life is really like at Citi. We're confident you’ll like what you see.\n\nDeadlines to Apply\nWe open for applications at the beginning of September and the deadline for applications is the 9th January 2015. However we will be reviewing applications and hosting interviews prior to the deadline therefore we advise that interested applicants apply as soon as possible.\n","url":"https://www.wikijob.co.uk/tracking_click/2021401/field_apply_now_button","salary":"","contract_type":"Temporary","vacancy_type":"First Year Schemes","location":"International, Europe, Middle East &amp; Africa, Asia Pacific, China, Hong Kong, Japan, Malaysia, Philippines, Singapore, South Korea, Taiwan, Thailand, Americas, United States","deadline":"10.01.2015"},{"id":"2021400","title":"Graduate Opportunities at Citi ","logo":"https://www.wikijob.co.uk/sites/default/files/styles/profile_job_post_logo/public/images/company-logos/2011058-1409828764.jpg?itok=duEQ1OtH","company":"","job_role":"Accounting, Auditing &amp; Finance, Advertising, Marketing &amp; Public Relations, Banking &amp; Financial Services, Business &amp; Management, Human Resources, IT &amp; Technology","summary":"Citi’s global presence isn’t just a question of size; it’s a way of thinking.\n","description":"Since Citi opened its first office in New York in 1812, it has answered the needs of economies, businesses and communities in hundreds of cities, in over 160 countries, thriving in the most challenging times over a 200 year history. Citi’s global presence isn’t just a question of size; it’s a way of thinking.\n\nA career with Citi means being part of a global firm that provides the most forward-thinking financial products and solutions to the most enterprising corporations, institutions, governments and individuals around the world.\n\nCiti’s success is driven by its exceptional people – their passion, dedication and entrepreneurship – and it will be people just like you who will shape its future. At Citi, learning doesn’t stop at graduation and there are many ways to embark on a rewarding career path, enjoying the global opportunities and long-term training and development initiatives experienced by over 240,000 employees worldwide.\n\nWe have opportunities in:  Citi offers full time graduate opportunities across a number of its business areas, including Investment Banking, Corporate Banking, Capital Markets Origination, Markets and Securities Services, Treasury and Trade Solutions (TTS), Investment Research, Private Bank, Risk Management, Human Resources, Operations and Technology. Graduates interested in this industry with drive, commitment and a passion for learning are encouraged to apply.\n\nDeadlines to Apply\nWe open for applications at the beginning of September and review and recruit all applications on a rolling basis. We strongly advise that interested applicants apply as soon as possible.\n","url":"https://www.wikijob.co.uk/tracking_click/2021400/field_apply_now_button","salary":"","contract_type":"Permanent","vacancy_type":"Graduate Scheme","location":"International, Europe, Middle East &amp; Africa, Asia Pacific, China, Hong Kong, Malaysia, Philippines, Singapore, South Korea, Taiwan, Thailand, Americas","deadline":"01.09.2015"},{"id":"2021398","title":"Spring Insight Opportunities at Citi ","logo":"https://www.wikijob.co.uk/sites/default/files/styles/profile_job_post_logo/public/images/company-logos/2011058-1409828764.jpg?itok=duEQ1OtH","company":"","job_role":"Accounting, Auditing &amp; Finance, Banking &amp; Financial Services, Business &amp; Management, Human Resources, IT &amp; Technology, Risk, Insurance &amp; Actuarial","summary":"Citi’s success is driven by its exceptional people – their passion, dedication and entrepreneurship – and it will be people just like you who will shape its future.\n","description":"Citi’s success is driven by its exceptional people – their passion, dedication and entrepreneurship – and it will be people just like you who will shape its future. At Citi, learning doesn’t stop at graduation and there are many ways to embark on a rewarding career path, enjoying the global opportunities and long-term training and development initiatives experienced by over 240,000 employees worldwide.\n\nWe have opportunities in:  Citi offers spring insight programmes enabling students in their first year (or in their second year of a four year course) to experience first-hand the Citi culture and environment. These programmes are:\n\nCiti Quest\nThis 5 day work-experience programme will see you placed within a specific business area of your choice. This is a great chance for you to really get to know what life is like at Citi, and for us to get to know you.\n\nWomen of Tomorrow\nCiti are focused on encouraging more women to consider banking, and this 3 day programme is designed to provide female students with an insight into the different career paths. Our hands-on workshops and work-shadowing will all help you to understand the skills necessary to succeed.\n\nCiti Scope\nIf you are interested in working in finance, but not sure which area is right for you then this 3 day programme will help you decide.  Through presentations, workshops and work-shadowing you will learn all about the bank and what life is really like at Citi. We're confident you’ll like what you see.\n\nDeadlines to Apply\nWe open for applications at the beginning of September and the deadline for applications is the 9th January 2015. However we will be reviewing applications and hosting interviews prior to the deadline therefore we advise that interested applicants apply as soon as possible.\n","url":"https://www.wikijob.co.uk/tracking_click/2021398/field_apply_now_button","salary":"","contract_type":"","vacancy_type":"Placement","location":"United Kingdom, International, Europe, Middle East &amp; Africa, Asia Pacific, Americas","deadline":"10.01.2015"},{"id":"2021397","title":"Graduate Opportunities at Citi","logo":"https://www.wikijob.co.uk/sites/default/files/styles/profile_job_post_logo/public/images/company-logos/2011058-1409828764.jpg?itok=duEQ1OtH","company":"","job_role":"Accounting, Auditing &amp; Finance, Banking &amp; Financial Services, Business &amp; Management, Human Resources, IT &amp; Technology, Risk, Insurance &amp; Actuarial","summary":"Since Citi opened its first office in New York in 1812, it has answered the needs of economies, businesses and communities in hundreds of cities, in over 160 countries.\n","description":"Since Citi opened its first office in New York in 1812, it has answered the needs of economies, businesses and communities in hundreds of cities, in over 160 countries, thriving in the most challenging times over a 200 year history. Citi’s global presence isn’t just a question of size; it’s a way of thinking.\n\nA career with Citi means being part of a global firm that provides the most forward-thinking financial products and solutions to the most enterprising corporations, institutions, governments and individuals around the world.\n\nCiti’s success is driven by its exceptional people – their passion, dedication and entrepreneurship – and it will be people just like you who will shape its future. At Citi, learning doesn’t stop at graduation and there are many ways to embark on a rewarding career path, enjoying the global opportunities and long-term training and development initiatives experienced by over 240,000 employees worldwide.\n\nWe have opportunities in:  Citi offers full time graduate opportunities across a number of its business areas, including Investment Banking, Corporate Banking, Capital Markets Origination, Markets and Securities Services, Treasury and Trade Solutions (TTS), Investment Research, Private Bank, Risk Management, Human Resources, Operations and Technology. Graduates interested in this industry with drive, commitment and a passion for learning are encouraged to apply.\n\nDeadlines to Apply\nWe open for applications at the beginning of September and review and recruit all applications on a rolling basis. We strongly advise that interested applicants apply as soon as possible.\n","url":"https://www.wikijob.co.uk/tracking_click/2021397/field_apply_now_button","salary":"","contract_type":"","vacancy_type":"Graduate Scheme","location":"United Kingdom, International, Europe, Middle East &amp; Africa, Asia Pacific, Americas","deadline":"02.09.2015"},{"id":"2021396","title":"Internship Opportunities at Citi ","logo":"https://www.wikijob.co.uk/sites/default/files/styles/profile_job_post_logo/public/images/company-logos/2011058-1409828764.jpg?itok=duEQ1OtH","company":"","job_role":"Accounting, Auditing &amp; Finance, Banking &amp; Financial Services, Business &amp; Management, Human Resources, IT &amp; Technology, Risk, Insurance &amp; Actuarial","summary":"Since Citi opened its first office in New York in 1812, it has answered the needs of economies, businesses and communities in hundreds of cities, in over 160 countries.\n","description":"Since Citi opened its first office in New York in 1812, it has answered the needs of economies, businesses and communities in hundreds of cities, in over 160 countries, thriving in the most challenging times over a 200 year history. Citi’s global presence isn’t just a question of size; it’s a way of thinking.\n\nA career with Citi means being part of a global firm that provides the most forward-thinking financial products and solutions to the most enterprising corporations, institutions, governments and individuals around the world.\n\nCiti’s success is driven by its exceptional people – their passion, dedication and entrepreneurship – and it will be people just like you who will shape its future. At Citi, learning doesn’t stop at graduation and there are many ways to embark on a rewarding career path, enjoying the global opportunities and long-term training and development initiatives experienced by over 240,000 employees worldwide.\n\nWe have opportunities in:  Citi offers a ten week summer internship across a number of its business areas, including Investment Banking, Corporate Banking, Capital Markets Origination, Markets and Securities Services, Treasury and Trade Solutions (TTS), Investment Research, Private Bank, Risk Management, Human Resources, Operations and Technology. Penultimate or final year students interested in this industry with drive, commitment and a passion for learning are encouraged to apply.\n\nDeadlines to Apply\n\nWe open for applications at the beginning of September and review and recruit all applications on a rolling basis. We strongly advise that interested applicants apply as soon as possible.\n","url":"https://www.wikijob.co.uk/tracking_click/2021396/field_apply_now_button","salary":"","contract_type":"","vacancy_type":"Internship","location":"United Kingdom, International, Europe, Middle East &amp; Africa, Asia Pacific, Americas","deadline":"02.09.2015"},{"id":"2021359","title":"Singapore – Analyst Program","logo":"https://www.wikijob.co.uk/sites/default/files/styles/profile_job_post_logo/public/images/company-logos/2016883-1409326585.jpg?itok=WnD5K7JO","company":"","job_role":"Banking &amp; Financial Services","summary":"Discover a better balance in banking","description":"Discover a better balance in banking\n\nMitsubishi UFJ Securities (Singapore), Ltd is the investment banking business of MUFG, one of the world’s leading financial groups. Headquartered in Tokyo, MUFG is a global network with more than 140,000 employees and offices in over 40 countries.\n\nOur presence as an investment bank in Asia is developing rapidly. So, while the size of our group gives us global reach and strong foundations, we have real agility and plenty of growth opportunities. It adds up to a better balance in banking – one that you’ll enjoy from your very first day.\n\nJoining a select intake, you’ll begin your journey with a four-week induction in our London office. Here you’ll meet the rest of our global intake and get an overview of our business. Then it’s back to Singapore, where you’ll set out on a program that combines classroom training and live projects to show you how international finance works. Senior colleagues will know you; they’ll see the work you do, and they’ll be happy to provide support. And you’ll get to study for professional qualifications as you progress.\n\nWe hire on potential, so you won’t need a financial background. Whatever you’ve studied, our outstanding training will see that you rapidly gain the skills you need to make a telling contribution. You will, however, need to be in your final year of study with a predicted GPA of 3.3 or higher. Ambition is important too, because you’ll be part of big projects from the very start.\n\nApplications close on November 17th, 2014, so to find out more and apply, click the link below.\n","url":"https://www.wikijob.co.uk/tracking_click/2021359/field_apply_now_button","salary":"","contract_type":"Permanent","vacancy_type":"Graduate Scheme","location":"Asia Pacific, Singapore","deadline":"18.11.2014"},{"id":"2021358","title":"HK Analyst Program ","logo":"https://www.wikijob.co.uk/sites/default/files/styles/profile_job_post_logo/public/images/company-logos/2016883-1409326585.jpg?itok=WnD5K7JO","company":"","job_role":"Banking &amp; Financial Services","summary":"Discover a better balance in banking","description":"Discover a better balance in banking\n\n\nGlobal Markets and Investment Banking\nMiddle Office\n\n\nMitsubishi UFJ Securities (HK) Holdings, Ltd is the investment banking business of MUFG, one of the world’s leading financial groups. Headquartered in Tokyo, MUFG is a global network with more than 140,000 employees and offices in over 40 countries.\n\nOur presence as an investment bank in Asia is developing rapidly. So, while the size of our group gives us global reach and strong foundations, we have real agility and plenty of growth opportunities. It adds up to a better balance in banking – one that you’ll enjoy from your very first day.\n\nJoining a select intake, you’ll begin your journey with a four-week induction in our London office. Here you’ll meet the rest of our global intake and get an overview of our business. Then it’s back to Hong Kong, where you’ll set out on a program that combines classroom training and live projects to show you how international finance works. Senior colleagues will know you; they’ll see the work you do, and they’ll be happy to provide support. And you’ll get to study for professional qualifications as you progress.\n\nWe hire on potential, so you won’t need a financial background. Whatever you’ve studied, our outstanding training will see that you rapidly gain the skills you need to make a telling contribution. You will, however, need to be in your final year of study with a predicted GPA of 3.3 or higher. Ambition is important too, because you’ll be part of big projects from the very start.\n\nApplications close on November 17th, 2014, so to find out more and apply, click below.\n","url":"https://www.wikijob.co.uk/tracking_click/2021358/field_apply_now_button","salary":"","contract_type":"Permanent","vacancy_type":"Graduate Scheme","location":"Asia Pacific, Hong Kong","deadline":"18.11.2014"},{"id":"2021357","title":"US Analyst Program","logo":"https://www.wikijob.co.uk/sites/default/files/styles/profile_job_post_logo/public/images/company-logos/2016883-1409326585.jpg?itok=WnD5K7JO","company":"","job_role":"Banking &amp; Financial Services","summary":"Discover a better balance in banking","description":"Discover a better balance in banking\n\n\nCapital Markets Sales and Trading\nOperations, Infrastructure, Risk, Finance and other support functions\n\n\nMitsubishi UFJ Securities (USA), Inc. is the investment banking business of MUFG, one of the world’s leading financial groups. Headquartered in Tokyo, MUFG is a global network with more than 140,000 employees and offices in over 40 countries.\n\nThe size and stature of the group gives us strong foundations and global reach. Yet, as one of the youngest and fastest-growing parts of MUFG, we have the agility and excitement of an entrepreneurial start-up. It adds up to a better balance in banking – one that you’ll enjoy from your very first day.\n\nJoining a select intake, you’ll begin your journey with a four-week induction in our London office. Here you’ll meet the rest of our global intake and get an overview of our business. Then it’s back to the US, where you’ll set out on a program that combines classroom training and live projects to show you how international finance works. Senior colleagues will know you; they’ll see the work you do, and they’ll be happy to provide support. And you’ll get to study for professional qualifications as you progress.\n\nWe hire on potential, so you won’t need a financial background. Whatever you’ve studied, our outstanding training will see that you rapidly gain the skills you need to make a telling contribution. You will, however, need to be in your final year of study with a predicted 2.1. Ambition is important too, because you’ll be part of big projects from the very start.\n\nApplications close on January 25th, 2014, so to find out more and apply, click below.\n","url":"https://www.wikijob.co.uk/tracking_click/2021357/field_apply_now_button","salary":"","contract_type":"Permanent","vacancy_type":"Graduate Scheme","location":"Americas, United States","deadline":"27.01.2015"},{"id":"2021356","title":"Singapore – Internship Program","logo":"https://www.wikijob.co.uk/sites/default/files/styles/profile_job_post_logo/public/images/company-logos/2016883-1409326585.jpg?itok=WnD5K7JO","company":"","job_role":"Banking &amp; Financial Services","summary":"Discover a better balance in banking","description":"Discover a better balance in banking\n\nMitsubishi UFJ Securities (Singapore), Ltd is the investment banking business of MUFG, one of the world’s leading financial groups. Headquartered in Tokyo, MUFG is a global network with more than 140,000 employees and offices in over 40 countries.\n\nOur presence as an investment bank in Asia is developing rapidly. So, while the size of our group gives us global reach and strong foundations, we have real agility and plenty of growth opportunities. It adds up to a better balance in banking. And our summer internship program is your opportunity to experience it first hand. It’s also, for many, a route onto our analyst programs.\n\nThe ten-week internship starts with a week’s technical training. This will develop your understanding of the markets we work in and the products we use. Then you’ll experience what it’s like to work in global investment banking – completing rotations in a range of departments, and beginning to define where you want to develop in the future. There will be training and support throughout. And it will all be balanced with plenty of social and networking events.\n\nWe hire on potential, so you won’t need a financial background. Just be in your penultimate year of study with a predicted GPA of 3.3 or higher. A real interest in a career in banking is vital too, as are ambition and an eagerness to contribute and learn.\n\nApplications close on January 4th, 2014, so to find out more and apply, click below.\n","url":"https://www.wikijob.co.uk/tracking_click/2021356/field_apply_now_button","salary":"","contract_type":"Contract","vacancy_type":"Internship","location":"Asia Pacific, Singapore","deadline":"06.01.2015"},{"id":"2021355","title":"HK Summer Internship Program","logo":"https://www.wikijob.co.uk/sites/default/files/styles/profile_job_post_logo/public/images/company-logos/2016883-1409326585.jpg?itok=WnD5K7JO","company":"","job_role":"Banking &amp; Financial Services","summary":"Discover a better balance in banking","description":"Discover a better balance in banking\n\nMitsubishi UFJ Securities (HK) Holdings, Ltd is the investment banking business of MUFG, one of the world’s leading financial groups. Headquartered in Tokyo, MUFG is a global network with more than 140,000 employees and offices in over 40 countries.\n\nOur presence as an investment bank in Asia is developing rapidly. So, while the size of our group gives us global reach and strong foundations, we have real agility and plenty of growth opportunities. It adds up to a better balance in banking. And our summer internship program is your opportunity to experience it first hand. It’s also, for many, a route onto our analyst programs.\n\nThe ten-week internship starts with a week’s technical training. This will develop your understanding of the markets we work in and the products we use. Then you’ll experience what it’s like to work in global investment banking – completing rotations in a range of departments, and beginning to define where you want to develop in the future. There will be training and support throughout. And it will all be balanced with plenty of social and networking events.\n\nWe hire on potential, so you won’t need a financial background. Just be in your penultimate year of study with a predicted GPA of 3.3 or higher. A real interest in a career in banking is vital too, as are ambition and an eagerness to contribute and learn.\n\nApplications close on January 4th, 2014, so to find out more and apply, click below.\n","url":"https://www.wikijob.co.uk/tracking_click/2021355/field_apply_now_button","salary":"","contract_type":"Contract","vacancy_type":"Internship","location":"Asia Pacific, Hong Kong","deadline":"05.01.2015"},{"id":"2021354","title":"US Summer Internship Program ","logo":"https://www.wikijob.co.uk/sites/default/files/styles/profile_job_post_logo/public/images/company-logos/2016883-1409326585.jpg?itok=WnD5K7JO","company":"","job_role":"Banking &amp; Financial Services","summary":"Discover a better balance in banking","description":"Discover a better balance in banking\n\n\nCapital Markets Sales and Trading\nOperations, Infrastructure, Risk, Finance and other support functions\n\n\nMitsubishi UFJ Securities (USA), Inc.is the investment banking business of MUFG, one of the world’s leading financial groups. Headquartered in Tokyo, MUFG is a global network with more than 140,000 employees and offices in over 40 countries.\n\nThe size of the group gives us strong foundations and global reach. Yet, as a young and rapidly growing part of MUFG, we have the agility and excitement of an entrepreneurial start up. It adds up to a better balance in banking. And our summer internship program is your opportunity to experience it first hand. It’s also, for many, a route onto our analyst programs.\n\nThe ten-week internship starts with a week’s technical training. This will develop your understanding of the markets we work in and the products we use. Then you’ll experience what it’s like to work in global investment banking – completing rotations in a range of departments, and beginning to define where you want to develop in the future. There will be training and support throughout. And it will all be balanced with plenty of social and networking events.\n\nWe’re interested in potential here, so you won’t have to have a financial background to apply. Just be in your penultimate year of study with a 2.1 predicted grade. A real interest in a career in banking and the right to work in the US is vital too, as are ambition and an eagerness to contribute and learn.\n\nApplications close on January 25th, 2015, so to find out more and apply, click below.\n","url":"https://www.wikijob.co.uk/tracking_click/2021354/field_apply_now_button","salary":"","contract_type":"Temporary","vacancy_type":"Internship","location":"Americas, United States","deadline":"26.01.2015"},{"id":"2021353","title":"UK Summer Internship Program","logo":"https://www.wikijob.co.uk/sites/default/files/styles/profile_job_post_logo/public/images/company-logos/2016883-1409326585.jpg?itok=WnD5K7JO","company":"","job_role":"Banking &amp; Financial Services","summary":"Discover a better balance in banking","description":"Discover a better balance in banking\n\n\nGlobal Markets and Investment Banking\nMiddle Office &amp; Operations\n\n\nMitsubishi UFJ Securities International plc is the investment banking business of MUFG, one of the world’s leading financial institutions. Headquartered in Tokyo, MUFG is a global network with more than 140,000 employees and offices in over 40 countries.\n\nOur group is huge, yet we remain agile and entrepreneurial. This allows us to offer a much better balance in banking. And our summer internship program is your opportunity to experience it first hand. It’s also, for many, a route onto our analyst programs.\n\nThe ten-week internship starts with a week’s technical training. This will develop your understanding of the markets we work in and the products we use. Then you’ll experience what it’s like to work in global investment banking – completing rotations in a range of departments, and beginning to define where you want to develop in the future. There will be training and support throughout. And it will all be balanced with plenty of social and networking events.\n\nWe’re interested in potential here, so you won’t have to have a financial background to apply. Just be in your penultimate year of study with a 2.1 predicted grade. A real interest in a career in banking, as is an eagerness to contribute and learn.\n\nApplications close on January 4th, 2015, so to find out more and apply, click below.\n","url":"https://www.wikijob.co.uk/tracking_click/2021353/field_apply_now_button","salary":"","contract_type":"Temporary","vacancy_type":"Internship","location":"United Kingdom, England","deadline":"05.01.2015"},{"id":"2021351","title":"UK Analyst Technology Program ","logo":"https://www.wikijob.co.uk/sites/default/files/styles/profile_job_post_logo/public/images/company-logos/2016883-1409326585.jpg?itok=WnD5K7JO","company":"","job_role":"Banking &amp; Financial Services","summary":"Discover a better balance in banking","description":"Discover a better balance in banking\n\nMitsubishi UFJ Securities International plc is the investment banking business of MUFG, one of the world’s leading financial groups. Headquartered in Tokyo, MUFG is a global network with more than 140,000 employees and offices in over 40 countries.\n\nDespite the size and stability of our group, we’re agile, nimble and entrepreneurial. It’s a unique balance – one that is behind our ongoing success. And every step forward we make is made possible by technology.\n\nBefore you can change our business, you’ll need to understand it. This is why your journey will start with a four-week induction where you’ll get a full overview of what we do and how we work. After this, you’ll begin a program that will immerse you in the core technologies that drive our business and our industry.\n\nAs part of a select intake, you’ll undertake two rotations within different IT areas – giving you real objectives and real work. You’ll develop your skills by working with a wide range of technology systems and programming languages - C#, C++, Java and SQL, to name but a few. You’ll also study for professional qualifications at the same time. And, in our close-knit environment, your contribution will be recognized.\n\nTo apply, you’ll need to be in your final year of study with a predicted 2.1 in any degree discipline. A passion for IT, plenty of ambition and a desire to get noticed for all the right reasons will be essential, too – because on our small team, you’ll be part of big projects from the very start.\n\nApplications close on January 4th, 2015, so to find out more click below.\n","url":"https://www.wikijob.co.uk/tracking_click/2021351/field_apply_now_button","salary":"","contract_type":"Permanent","vacancy_type":"Graduate Scheme","location":"United Kingdom, England","deadline":"05.01.2015"},{"id":"2021326","title":"Fidelity Internships","logo":"https://www.wikijob.co.uk/sites/default/files/styles/profile_job_post_logo/public/images/company-logos/2019068-1409828440.jpg?itok=ixWBK8Wg","company":"","job_role":"Accounting, Auditing &amp; Finance, Banking &amp; Financial Services, Business &amp; Management, Human Resources, IT &amp; Technology","summary":"London, Kent or Surrey","description":"London, Kent or Surrey\n\nAt Fidelity Worldwide Investment, we apply intelligent insight to everything that we do. So whether we’re picking stocks for a fund or selecting our next cohort of interns, we set out to make long term investments. In business, this means looking beyond financial results and talking to customers, suppliers and management. In interns, this means looking beyond exam results to discover ambition, integrity and entrepreneurial potential.\n\nVoted number one for intern placements, we see investing in our interns as a valuable opportunity. This means that whether you join us in Equity Research, Fixed Income or Fidelity Solutions, or in a business-critical area like Business and Operational Management, Technology or European Sales and Marketing, you can look forward to an exceptional level of training and development. This can range from comprehensive inductions on eight-week internships to invaluable exposure to our global network on longer programmes. We see this as a chance for us to get to know each other – interns who perform well can expect to be invited to join our graduate programme the following year.\n\nFor different areas of the business, we look for different strengths. On the whole, we look for candidates who show intellectual curiosity and strong numerical abilities alongside commercial acumen and exceptional communication skills. But we also appreciate more varied talents, such as technology skills, a second language or outstanding problem-solving skills.\n\nWe have a presence in 25 countries and manage over 700 funds for our customers covering everything from stocks and shares to bonds, property and commodities. What we do is complex. But the principle behind it is simple: we do everything we can to make informed investment decisions that are right for our customers. That means meticulously researching every investment, balancing profit against risk and using our knowledge of local and global financial markets to create robust and successful products and portfolios.\n","url":"https://www.wikijob.co.uk/tracking_click/2021326/field_apply_now_button","salary":"","contract_type":"Temporary","vacancy_type":"Internship","location":"United Kingdom","deadline":"31.08.2015"},{"id":"2021325","title":"Fidelity Graduate Careers","logo":"https://www.wikijob.co.uk/sites/default/files/styles/profile_job_post_logo/public/images/company-logos/2019068-1409828440.jpg?itok=ixWBK8Wg","company":"","job_role":"Accounting, Auditing &amp; Finance, Advertising, Marketing &amp; Public Relations, Banking &amp; Financial Services, Business &amp; Management, Human Resources, IT &amp; Technology","summary":"London, Kent and Surrey","description":"London, Kent and Surrey\n\nAt Fidelity Worldwide Investment, we apply intelligent insight to everything that we do. So whether we’re picking stocks for a fund or selecting our next cohort of graduates, we set out to make long term investments. In business, this means looking beyond financial results and talking to customers, suppliers and management. In graduates, this means looking beyond exam results to discover ambition, integrity and entrepreneurial potential.\n\nIn our investment businesses, we offer opportunities in Equity Research, Fixed Income and Fidelity Solutions. And in our business-critical functions, our programmes include Business Management, European Sales and Marketing, HR, Technology and Operational Management. Whichever of our diverse business areas you join, you’ll profit from a wealth of industry-leading training, coaching and development opportunities. You’ll have your own dedicated training plan, which will start at your induction and help you to fully understand our company, culture and the markets in which we operate.\n\nThe variety of graduate opportunities we offer means we look for a huge range of different talents. For some areas we ask that you have solid numerical and analytical abilities, while for others we look for the ability to do business articulately in more than one language. That said, we do expect all of our graduates to have a strong academic record, confident communication skills and the drive and commercial acumen needed to succeed in a global business.\n\nWe have a presence in 25 countries and manage over 700 funds for our customers covering everything from stocks and shares to bonds, property and commodities. What we do is complex. But the principle behind it is simple: we do everything we can to make informed investment decisions that are right for our customers. That means meticulously researching every investment, balancing profit against risk and using our knowledge of local and global financial markets to create robust and successful products and portfolios.\n\nBe our next investment.\n","url":"https://www.wikijob.co.uk/tracking_click/2021325/field_apply_now_button","salary":"","contract_type":"Permanent","vacancy_type":"Graduate Scheme","location":"United Kingdom","deadline":"31.08.2015"},{"id":"2021202","title":"Fixed Income Research Summer Internship Program","logo":"https://www.wikijob.co.uk/sites/default/files/styles/profile_job_post_logo/public/images/credit-suisse_3.jpg?itok=y02xUu2T","company":"","job_role":"Banking &amp; Financial Services","summary":"","description":"About Credit Suisse\nCredit Suisse is a global financial services company providing Private Banking &amp; Wealth Management services, and Investment Banking services and expertise to companies, institutions and high-net-worth clients. We are active in more than 50 countries and employ over 46,000 people. \n \nWe aim to build the bank of the future at Credit Suisse—working as one integrated bank, servicing our clients across regions and businesses. It also means fulfilling our responsibility to help shape the global economy, and to make a difference in people’s lives. With world-class training and support, our entry-level hiring programs give you the chance to make an impact. Throughout your career with us, you will benefit from cross-business and international mobility opportunities. \n \nA career with us means that you can help shape our future.\n\t \nAbout Fixed Income\nCredit Suisse's Fixed Income franchise operates as a unified platform that handles all Fixed Income cash and derivative products. The bank's product and regional team structure allows us to deliver product-based solutions that address the constantly changing goals of our corporate, sovereign and institutional customers worldwide. \n \nProducts and services range from securitization and liability management transactions to sales and trading and superior research. Through a strong commitment to understanding the needs of our customers and channeling the vast resources of Credit Suisse to meeting those needs, the bank has greatly expanded its global penetration and reach. \n \nWithin the Fixed Income product areas we have professionals working in the following roles: Research, Sales, Structuring, Capital Markets and Trading. Interns join either our fixed desk Research program or the Rotational Sales, Trading and Structuring program.\n \nFixed Income &amp; Economics Research\nThe Fixed Income and Economics Research Department provides trading strategies, index products, strategic insights on global issues covering fixed income, commodities, foreign exchange, credit, emerging markets and securitized products. The research services are used by global clients ranging from real money investors to central banks, government treasuries, hedge funds, sovereign wealth funds, insurance companies, etc. The research analysts also provide advice and products to all of Credit Suisse Group’s departments and divisions. The department is well recognized for unique and differentiated products by clients in 50+ countries.\n \nAbout the Program\nSecurities interns spend their first week in a comprehensive training program covering all aspects of the markets. This includes looking at specific products and businesses in Fixed Income and Equities and participating in case studies or simulations. Additionally, you will receive training on applications and tools such as Excel and Bloomberg. By the end of the week, you will be fully conversant with the knowledge, terminology and technical skills to support your learning in the program.\n \nInterns are allocated to desks following a placement day held in April, where the incoming class meet with representatives from each desk and function (Research or Sales, Trading or Structuring). The campus team will also provide information on each group, and guidance based on your interview feedback to help secure the best placement.\n \nResearch interns will spend the nine weeks on one desk, allowing them to build significant knowledge in one area.\n \nAll interns are provided a mentor to oversee their time with Credit Suisse, and encourage networking opportunities. On each placement you will have a dedicated Desk Coordinator who will manage your day to day workload, and provide feedback in formal reviews. The summer internship is our core hiring channel for our full-time Analyst class.\n \nDegree Requirements\nTo be eligible, you will have completed or be due to complete a Bachelors, Masters or PhD qualification (or equivalent) in any discipline. \nAll applicants must be in their penultimate year of study, be available for the full 10 weeks and be able to start full-time employment in July 2016.\n \nWhat We Look For\nWhile our employees have a wide range of experiences and interests, they share an intellectual curiosity, a desire to achieve and a pattern of excellence and achievement. Whatever your background, you’ll need to be:\n\nClient-focused and committed to developing creative solutions \n\n\nA leader who naturally attracts followers\n\n\nA critical thinker with excellent problem-solving skills \n\n\nA self-starter who is able to envision long-term goals and ways to attain them \n\n\nA collaborative team member who builds excellent relationships \n\n\nAn articulate communicator who also recognizes the importance of listening \n\n\nAnalytical and logical, with raw intellectual ability\n\n","url":"https://www.wikijob.co.uk/tracking_click/2021202/field_apply_now_button","salary":"","contract_type":"Temporary","vacancy_type":"Internship","location":"United Kingdom","deadline":"01.02.2015"},{"id":"2021201","title":"Spring Insight Program","logo":"https://www.wikijob.co.uk/sites/default/files/styles/profile_job_post_logo/public/images/credit-suisse_3.jpg?itok=y02xUu2T","company":"","job_role":"Banking &amp; Financial Services","summary":"About Credit Suisse","description":"About Credit Suisse\nCredit Suisse is a global financial services company providing Private Banking &amp; Wealth Management services, and Investment Banking services and expertise to companies, institutions and high-net-worth clients. We are active in more than 50 countries and employ over 46,000 people. \n \nIt is our aim to build the bank of the future at Credit Suisse—working as one integrated bank, servicing our clients across regions and businesses. It also means fulfilling our responsibility to help shape the global economy, and to make a difference in people’s lives.\n \nWe offer entry-level hiring programs in a variety of business areas. Our programs give you the chance to make an impact, and provide world-class training and support to help you develop into a leader. Throughout your career with us, you will benefit from cross-business and international mobility opportunities. \n \nWe look for people with a wide range of experiences, interests and degrees who will add fresh perspectives to our business. \n \nA career with us means that you can help shape our future.\n \n \nAbout the Spring Insight Program\nJoining our five day Spring Program will introduce you to the investment banking industry and give you a realistic understanding of what our world is like.\n \nYou will join us in our London office, where the program will provide insight into our Investment Banking, Equities and Fixed Income businesses.  While you’ll focus primarily on understanding these areas, you’ll also get exposure to other areas of our bank. You will take part in skills sessions, CV workshops and business information sessions, as well as social and networking events.\n \n \nWhat We Look For\nYou’ll need to have or be studying for a Bachelors or Masters qualification (or equivalent), with an excellent academic record in any discipline. Excellent analytical and organizational skills are also prerequisites, along with the ability to deliver accurate work and perform well under pressure.\n           \nThe Spring Insight Program is designed for first-year students of a three-year degree course, or second-year students of a four-year course, who are considering a career in banking. Applicants must be able to start full-time employment in July 2017.\n \n","url":"https://www.wikijob.co.uk/tracking_click/2021201/field_apply_now_button","salary":"","contract_type":"Temporary","vacancy_type":"First Year Schemes","location":"United Kingdom","deadline":"01.05.2015"},{"id":"2021200","title":"Spring Insight Program","logo":"https://www.wikijob.co.uk/sites/default/files/styles/profile_job_post_logo/public/images/credit-suisse_3.jpg?itok=y02xUu2T","company":"","job_role":"Banking &amp; Financial Services","summary":"About Credit Suisse","description":"About Credit Suisse\nCredit Suisse is a global financial services company providing Private Banking &amp; Wealth Management services, and Investment Banking services and expertise to companies, institutions and high-net-worth clients. We are active in more than 50 countries and employ over 46,000 people. \n \nIt is our aim to build the bank of the future at Credit Suisse—working as one integrated bank, servicing our clients across regions and businesses. It also means fulfilling our responsibility to help shape the global economy, and to make a difference in people’s lives.\n \n \nWe offer entry-level hiring programs in a variety of business areas. Our programs give you the chance to make an impact, and provide world-class training and support to help you develop into a leader. Throughout your career with us, you will benefit from cross-business and international mobility opportunities. \n \nWe look for people with a wide range of experiences, interests and degrees who will add fresh perspectives to our business. \n \nA career with us means that you can help shape our future.\n \n \nAbout the Spring Insight Program\nJoining our five day Spring Program will introduce you to the investment banking industry and give you a realistic understanding of what our world is like.\n \nYou will join us in our London office, where the program will provide insight into our Investment Banking, Equities and Fixed Income businesses.  While you’ll focus primarily on understanding these areas, you’ll also get exposure to other areas of our bank. You will take part in skills sessions, CV workshops and business information sessions, as well as social and networking events.\n \n \nWhat We Look For\nYou’ll need to have or be studying for a Bachelors or Masters qualification (or equivalent), with an excellent academic record in any discipline. Excellent analytical and organizational skills are also prerequisites, along with the ability to deliver accurate work and perform well under pressure.\n           \nThe Spring Insight Program is designed for first-year students of a three-year degree course, or second-year students of a four-year course, who are considering a career in banking. Applicants must be able to start full-time employment in July 2017.\n \n","url":"https://www.wikijob.co.uk/tracking_click/2021200/field_apply_now_button","salary":"","contract_type":"Temporary","vacancy_type":"First Year Schemes","location":"United Kingdom","deadline":"01.05.2015"},{"id":"2021074","title":"Spring Insight Program: Finance, Operations and Information Technology","logo":"https://www.wikijob.co.uk/sites/default/files/styles/profile_job_post_logo/public/images/credit-suisse_3.jpg?itok=y02xUu2T","company":"","job_role":"Banking &amp; Financial Services","summary":"","description":"About Credit Suisse\nCredit Suisse is a global financial services company providing Private Banking &amp; Wealth Management services, and Investment Banking services and expertise to companies, institutions and high-net-worth clients. We are active in more than 50 countries and employ over 46,000 people. &nbsp;\n&nbsp;\nIt is our aim to build the bank of the future at Credit Suisse&mdash;working as one integrated bank, servicing our clients across regions and businesses. It also means fulfilling our responsibility to help shape the global economy, and to make a difference in people&rsquo;s lives.\n&nbsp;\nWe offer entry-level hiring programs in a variety of business areas. Our programs give you the chance to make an impact, and provide world-class training and support to help you develop into a leader. Throughout your career with us, you will benefit from cross-business and international mobility opportunities. &nbsp;\n&nbsp;\nWe look for people with a wide range of experiences, interests and degrees who will add fresh perspectives to our business. &nbsp;\n&nbsp;\nA career with us means that you can help shape our future. \n&nbsp;\n\n\t&nbsp;\nAbout the Spring Insight Program\nJoining our five day Spring Insight Program will introduce you to the investment banking industry, and give you a realistic understanding of what our world is like.\n&nbsp;\nYou will join us in our London office, where the program will provide insight into either our Finance, Operations or Information Technology businesses. &nbsp;While you&rsquo;ll focus primarily on understanding your chosen area, you&rsquo;ll also get exposure to other areas of our bank. You will take part in workshadowing, skills sessions, CV workshops and business information sessions, as well as social and networking events.\n&nbsp;\nWhat We Look For\nYou&rsquo;ll need to have or be studying for a Bachelors or Masters qualification (or equivalent), with an excellent academic record in any discipline. Excellent analytical and organizational skills are also prerequisites, along with the ability to deliver accurate work and perform well under pressure.\n&nbsp;\nThe Spring Insight Program is designed for first-year students of a three-year degree course, or second-year students of a four-year course, who are considering a career in banking. Applicants must be able to start full-time employment in July 2017.\n&nbsp;\n","url":"https://www.wikijob.co.uk/tracking_click/2021074/field_apply_now_button","salary":"","contract_type":"Temporary","vacancy_type":"First Year Schemes","location":"United Kingdom","deadline":"01.05.2015"},{"id":"2021073","title":"Operations Summer Internship","logo":"https://www.wikijob.co.uk/sites/default/files/styles/profile_job_post_logo/public/images/credit-suisse_3.jpg?itok=y02xUu2T","company":"","job_role":"Banking &amp; Financial Services","summary":"","description":"About Credit Suisse\nCredit Suisse is a global financial services company providing Private Banking &amp; Wealth Management services, and Investment Banking services and expertise to companies, institutions and high-net-worth clients. We are active in more than 50 countries and employ over 46,000 people.  \n \nIt’s our aim to build the bank of the future at Credit Suisse—working as one integrated bank, servicing our clients across regions and businesses. It also means fulfilling our responsibility to help shape the global economy, and to make a difference in people’s lives.\n \nWe offer entry-level hiring programs in a variety of business areas. Our programs give you the chance to make an impact, and provide world-class training and support to help you develop into a leader. Throughout your career with us, you will benefit from cross-business and international mobility opportunities.  \n \nWe look for people with a wide range of experiences, interests and degrees who will add fresh perspectives to our business. A career with us means that you can help shape our future. \n \nAbout Operations\nThe Operations Division provides the processing of securitized and non-securitized trades including settlement, clearing and payments services, as well as the management of cash, collateral and securities on behalf of the bank and our clients. The Operations team safeguards the bank’s daily business, and ensures the delivery of high-quality services to internal and external clients. The division operates in Switzerland, EMEA, APAC and Americas.\n \nAdditionally, Operations is responsible for bank-wide oversight of operational risks and works in partnership with teams across the bank to develop more integrated operating and securities processing platforms. Because the macro-environment is constantly changing, the work is challenging, dynamic and offers diverse career paths. Operations professionals interact daily with clients, internal stakeholders and colleagues based in international offices.\n \nWe offer internships in Clearing, Collateral, Valuations and Liquidity, Operations Change, Global Cross Product Processing, Operations Control and Regulatory, and Operations Utilities.\n \nAbout the Program\nOur 10-week summer internship program will provide you with formal financial markets and Excel training, as well as on the job practice and mentoring.  You will work as an analyst-level resource for one dedicated desk within Operations for the 10 weeks of your internship. We will evaluate your preferences prior to your start date and take them into consideration when making desk allocation decisions.\nYou will be assigned a Credit Suisse buddy who will provide you with additional support prior to, during, and after your internship.\nAs well as undertaking an assigned desk-specific project during your internship, you will also be working on a group project with other interns; this will help you build upon your project management, team collaboration and presentation skills.\n \nThe program offers opportunities to meet with senior managers, colleagues and peers at all levels across the bank. So you may gain insights into the bank, its culture, build a professional network.\n \nYour managers will work with you on an objective and review process, which provides structure to your placement and gives you an outline of placement requirements and goals. This practice also gives us a tangible framework for assessing you for a full-time graduate position after your graduation in 2016. The summer internship is our core hiring channel for our full-time Analyst class.\nDegree Requirements\nTo be eligible, you will have completed or be due to complete a Bachelors, Masters or PhD qualification (or equivalent) in any discipline. \n \nAll applicants must be in their penultimate year of study, be available for the full 10 weeks and be able to start full-time employment in July 2016.\n \nWhat We Look For\nWhile our employees have a wide range of experiences and interests, they share an intellectual curiosity, a desire to achieve and a pattern of excellence and achievement. Whatever your background, you’ll need to be:\n\nClient-focused and committed to developing creative solutions \n\n\nA critical thinker with excellent problem-solving skills \n\n\nA self-starter who is able to envision long-term goals and ways to attain them \n\n\nA collaborative team member who builds excellent internal and external relationships \n\n\nAn articulate communicator who also recognizes the importance of listening \n\n\nAnalytical and logical, with raw intellectual ability\n\n\nProcess orientated with the ability to connect and improve complex system flows\n\n\nRisk aware and unafraid to challenge colleagues both within the department and across the bank on processing excellence and risk\n\n","url":"https://www.wikijob.co.uk/tracking_click/2021073/field_apply_now_button","salary":"","contract_type":"Temporary","vacancy_type":"Internship","location":"United Kingdom","deadline":"01.06.2015"},{"id":"2021072","title":"Investment Banking Department and Global Market Solutions Group Summer Internship Program","logo":"https://www.wikijob.co.uk/sites/default/files/styles/profile_job_post_logo/public/images/credit-suisse_3.jpg?itok=y02xUu2T","company":"","job_role":"Banking &amp; Financial Services","summary":"","description":"About Credit Suisse\nCredit Suisse is a global financial services company providing Private Banking &amp; Wealth Management services, and Investment Banking services and expertise to companies, institutions and high-net-worth clients. We are active in more than 50 countries and employ over 46,000 people.  \n \nIt’s our aim to build the bank of the future at Credit Suisse—working as one integrated bank, servicing our clients across regions and businesses. It also means fulfilling our responsibility to help shape the global economy, and to make a difference in people’s lives.\n \nWe offer entry-level hiring programs in a variety of business areas. \nOur programs give you the chance to make an impact, and provide world-class training and support to help you develop into a leader. Throughout your career with us, you will benefit from cross-business and international mobility opportunities.  \n \nWe look for people with a wide range of experiences, interests and degrees who will add fresh perspectives to our business.  \n \nA career with us means that you can help shape our future. \n \nAbout Investment Banking Department (IBD) and Global Markets Solutions Group (GMSG)\nCredit Suisse’s Investment Banking Division offers securities products and financial advisory services to corporations, governments and institutional investors. Credit Suisse’s IB business specializes in innovative solutions, drawing on our global expertise from across the full spectrum of products: debt and equity underwriting, sales and trading, mergers and acquisitions, derivative structured solutions, investment research and prime brokerage services.\n \nThe groups within IBD and GMSG are broadly categorized as:\n \n\nIndustry-focused Coverage Groups\n\nThese groups are based in London and cover clients in the following sectors: Industrials, European Energy Group, Consumer and Retail, Real Estate, Healthcare, Technology, Media and Telecoms, Financial Institutions Group. \n \n\nCountry Coverage Groups\n\nIn London, we have a dedicated team focused on coverage of our UK clients (UK IB). This team provides country coverage services and advice to our clients. Teams based in many of our European offices--for example, Paris, Frankfurt, Milan, Madrid and Amsterdam--are focused on covering clients in those locations/regions.\n \n\nLeveraged Finance and Sponsors Group (LFSG)\n\nResponsible for delivering Credit Suisse’s Leveraged Finance, Equity Capital Markets (ECM) and M&amp;A expertise to our European Sponsor clients (and their portfolio companies), and our corporate leveraged finance clients.\n \n\nMergers and Acquisitions (M&amp;A)\n\nAs one of the leading M&amp;A advisory groups, we provide services to clients across a range of industries and countries. Our M&amp;A team has extensive expertise in acquisitions, corporate sales, divestitures, joint ventures, leveraged buyouts, mergers, privatizations, proxy contests, recapitalizations, shareholder activism, spin-offs/split-offs, takeover defense and tax-advantaged structures.\n \n\nGlobal Market Solutions Group (GMSG)\n\nGMSG product bankers work in teams and coordinate with industry and country bankers to provide a single interface for all of the bank’s capital markets, funding and structured products in order to address credit financing and advisory needs. GMSG consists of four main groups of product origination and structuring bankers:\n\nEquity Capital Markets (ECM) and includes Equity Corporate Finance\n\n\nEquity Linked Solutions Group (“ELSG) and includes convertible bonds\n\n\nDebt Capital Markets and Derivatives Solutions Group (DCMDS)\n\n\nLeveraged Finance (LFSG)\n\n \nAbout the Program\nOur Summer Internship Program is a paid internship that runs for 10 weeks from the end of June to August, and is open to penultimate-year students graduating in 2016 who are interested in gaining an insight into Investment Banking. Interns are assigned to a business group throughout the 10 weeks and are integrated as a regular member of the staff.\n \nThe first week consists of hands-on training, and throughout the program interns receive ongoing training and support including formal learning, on-the-job practice and mentoring. The program offers opportunities to meet with senior managers, colleagues and peers at all levels across the bank. So you may gain insights into the bank, its culture, and build a professional network.\n \nYour managers will work with you on an objective and review process, which provides structure to your placement and gives you an outline of placement requirements and goals. This practice also gives us a tangible framework for assessing you for a full-time position after your graduation in 2016. The summer internship is our core hiring channel for our full-time Analyst class. \n \nDegree Requirements\nTo be eligible, you will have completed or be due to complete a Bachelors, Masters or PhD qualification (or equivalent) in any discipline.\n \nAll applicants must be in their penultimate year of study, be available for the full 10 weeks and be able to start full-time employment in July 2016.\n \nWhat We Look For\nWhile our employees have a wide range of experiences and interests, they share an intellectual curiosity, a desire to achieve and a pattern of excellence and achievement. Whatever your background, you’ll need to be:\n\nClient-focused and committed to developing creative solutions \n\n\nA leader who naturally attracts followers\n\n\nA critical thinker with excellent problem-solving skills \n\n\nA self-starter who is able to envision long-term goals and ways to attain them \n\n\nA collaborative team member who builds excellent relationships \n\n\nAn articulate communicator who also recognizes the importance of listening \n\n\nAnalytical and logical, with raw intellectual ability\n\n","url":"https://www.wikijob.co.uk/tracking_click/2021072/field_apply_now_button","salary":"","contract_type":"Temporary","vacancy_type":"Internship","location":"United Kingdom","deadline":"01.06.2015"},{"id":"2021071","title":"Information Technology Summer Internship Program","logo":"https://www.wikijob.co.uk/sites/default/files/styles/profile_job_post_logo/public/images/credit-suisse_3.jpg?itok=y02xUu2T","company":"","job_role":"Banking &amp; Financial Services","summary":"","description":"About Credit Suisse\nCredit Suisse is a global financial services company providing Private Banking &amp; Wealth Management services, and Investment Banking services and expertise to companies, institutions and high-net-worth clients. We are active in more than 50 countries and employ over 46,000 people.  \n \nIt is our aim to build the bank of the future at Credit Suisse—working as one integrated bank, servicing our clients across regions and businesses. This also means fulfilling our responsibility to help shape the global economy, and to make a difference in people’s lives.\n \nWe offer entry-level hiring programs in a variety of business areas. Our programs give you the chance to make an impact, and provide world-class training and support to help you develop into a future leader. Throughout your career with us, you will benefit from cross-business and international mobility opportunities.  \n \nWe look for people with a wide range of experiences, interests and degrees who will add fresh perspectives to our business.  \n \nA career with us means that you can help shape our future. \n\t \nAbout Information Technology\nInformation Technology (IT) is part of the Finance, Operations and IT division. With its global operations, Credit Suisse requires first-class technology to operate efficiently and competitively, and relies on thousands of the best IT people to carry it forward. Approximately 17,000 IT professionals work for Credit Suisse, across a diverse range of technology--from complex programming and client relationship management to information architecture. We hire interns in each of these areas, which are organized as follows:\n \n\nInvestment Banking (IB) IT &amp; Client Channels Technology (CCT) \n\nIBIT partners with the Investment Bank to deliver integrated and innovative front-to-back technology solutions, drawing on expertise across the full spectrum of products.  CCT leverages bank-wide synergies and industry best practices to provide tools, frameworks and expertise that improve our clients’ technology experience across divisions and use cases, and differentiates Credit Suisse from our competition.\n \n\nPrivate Banking, Wealth Management &amp; Shared Services IT  \n\nThis group supports Private Banking &amp; Wealth Management and all Shared Services divisions to provide front-to-back, aligned, high-quality IT services to our businesses. Key objectives include supporting the bank’s growth and profitability, ensuring regulatory compliance and operational stability, driving efficiency, and reducing complexity and cost.\n \n\nTechnology Infrastructure Services\n\nThis group provides global business partners with standardized information technology infrastructure and systems that are reliable, sustainable, financially optimized, and secure.\n \nInterns will have the opportunity to work within a variety of job families within these groups, including:\n\nSoftware/Application Architecture and Development\n\n\nBusiness Analysis &amp; Engineering\n\n\nUser and Production Support\n\n\nQuality Management and Testing\n\n \nAbout the Program\nOur 10 week summer internship program will provide you with formal financial markets training, as well as on the job practice and mentoring.  You will work as an analyst-level resource for one dedicated desk within IT for the 10 weeks of your internship.  We will evaluate your preferences prior to your start date and take them into consideration when making desk allocation decisions.\nYou will be assigned a Credit Suisse buddy who will provide you with additional support prior to, during, and after your internship. As well as undertaking an assigned desk-specific project during your internship, you will also be working on a group project with other interns.  This will help you build upon your project management, team collaboration and presentation skills\n \nThe program offers opportunities to meet with colleagues and peers at all levels across the bank. This will ensure you gain an insight into the bank and its culture, and give you the chance to start building your professional network.\n \nYour managers will work with you on objectives and a review process. This provides structure to your placement and gives you an outline of placement requirements and goals. This practice also gives us a tangible framework for assessing you for a full-time graduate position after your graduation in 2016. The summer internship is our core hiring channel for our full-time Analyst class.\n \nDegree Requirements\nTo be eligible, you will have completed or be due to complete a Bachelors, Masters or PhD qualification (or equivalent). We will accept applications of degrees in any discipline, although a relevant degree or major is preferred for most careers in IT. Preferred subjects include: Computer Science, Financial Computing, Information Management for Business, Mathematics, Physics, and any other related science, technology, engineering or mathematics subject. \n \nAll applicants must be in their penultimate year of study, be available for the full 10 weeks, and be able to start full-time employment in July 2016.\n \nWhat We Look For\nWhile our employees have a wide range of experiences and interests, they share an intellectual curiosity, a desire to achieve and a history of excellence. Whatever your background, you’ll need to be:\n\nClient-focused and committed to developing creative solutions \n\n\nA leader who naturaly attracts followers\n\n\nAn analytical thinker with excellent problem-solving skills \n\n\nA self-starter who is able to envision long-term goals and ways to attain them \n\n\nA collaborative team member who builds excellent relationships \n\nAn articulate communicator, who also recognizes the importance of listening\n","url":"https://www.wikijob.co.uk/tracking_click/2021071/field_apply_now_button","salary":"","contract_type":"Temporary","vacancy_type":"Internship","location":"United Kingdom","deadline":"01.06.2015"},{"id":"2021070","title":"Information Technology Industrial Placement Program (6 or 12 Months)","logo":"https://www.wikijob.co.uk/sites/default/files/styles/profile_job_post_logo/public/images/credit-suisse_3.jpg?itok=y02xUu2T","company":"","job_role":"Banking &amp; Financial Services","summary":"","description":"About Credit Suisse\nCredit Suisse is a global financial services company providing Private Banking &amp; Wealth Management services, and Investment Banking services and expertise to companies, institutions and high-net-worth clients. We are active in more than 50 countries and employ over 46,000 people.  \n \nIt’s our aim to build the bank of the future at Credit Suisse—working as one integrated bank, servicing our clients across regions and businesses. It also means fulfilling our responsibility to help shape the global economy, and to make a difference in people’s lives.\n \nWe offer entry-level hiring programs in a variety of business areas. Our programs give you the chance to make an impact, and provide world-class training and support to help you develop into a future leader. Throughout your career with us, you will benefit from cross-business and international mobility opportunities.  \n \nWe look for people with a wide range of experiences, interests and degrees who will add fresh perspectives to our business.  \n \nA career with us means that you can help shape our future. \n\n\t \nAbout Information Technology\nInformation Technology (IT) is part of the Finance, Operations and IT division. With its global operations, Credit Suisse requires first-class technology to operate efficiently and competitively, and relies on thousands of the best IT people to carry it forward. Approximately 17,000 IT professionals work for Credit Suisse across a diverse range of technology, from complex programming and client relationship management to information architecture.  We hire interns in each of these areas, which are organized as follows:\n \n\nInvestment Banking (IB) &amp; Client Channels Technology (CCT) IT \n\nIBIT partners with the Investment Bank to deliver integrated and innovative front-to-back technology solutions, drawing on expertise across the full spectrum of products.  CCT leverages bank-wide synergies and industry best practices to provide tools, frameworks and expertise that improve our clients’ technology experience across divisions and use cases, thus differentiating Credit Suisse from the competition.\n \n\nPrivate Banking, Wealth Management &amp; Shared Services IT  \n\nSupports Private Banking &amp; Wealth Management and all Shared Services divisions to provide front-to-back aligned high-quality IT services to our businesses. Key objectives include supporting the bank’s growth and profitability, ensuring regulatory compliance and operational stability, drive efficiency, and reducing complexity and cost.\n \n\nTechnology Infrastructure Services\n\nProvides global business partners standardized information technology infrastructure and systems that are reliable, sustainable, financially optimized and secure.\n \nInterns will have the opportunity to work within a variety of job families within these groups, including:\n\nSoftware/Application Architecture and Development\n\n\nBusiness Analysis &amp; Engineering\n\n\nUser and Production Support\n\n\nQuality Management and Testing\n\n \nAbout the Program\nThe industrial placement program provides training in formal financial markets, as well as the opportunity to add value to a desk by working on a real life business project. The placement offers a unique opportunity to put theoretical coursework and studies into practice in a real-life commercial, business environment\nYou will work as an analyst-level resource for one dedicated desk within IT for the duration of your placement\nWe will evaluate your preferences prior to your start date and take them into consideration when making desk allocation decisions. You will be assigned a Credit Suisse buddy who will provide you with additional support prior to, during, and after your placement\n \nThe program offers opportunities to meet with senior managers, colleagues and peers at all levels across the bank. This will ensure you gain an insight into the bank and its culture, as well as the chance for you to start building your professional network.\n \nYour managers will work with you on an objective and review process, which provides structure to your placement and gives you an outline of placement requirements and goals. This practice also gives us a tangible framework for assessing you for a full-time graduate position, as the industrial placement program is one of our core hiring channels for our full-time Analyst class. \n \nDegree Requirements\nTo be eligible, you will have completed or be due to complete a Bachelors, Masters or PhD qualification (or equivalent). We will accept applications of degrees in any discipline, although a relevant degree or major is preferred for most careers in IT. Subjects include: Computer Science, Financial Computing, Information Management for Business, Mathematics, Physics (and any other related science, technology, engineering or mathematics subject). \n \nYou will need to be available for the duration of your Industrial Placement. You must be graduating in 2016 if you want to be considered for a 6 month industrial placement, or graduating in 2017 if you want to be considered for a 12 month industrial placement (you will be considered for a full-time graduate position to start the year you graduate).\n \nWhat We Look For\nWhile our employees have a wide range of experiences and interests, they share an intellectual curiosity, a desire to achieve and a pattern of excellence and achievement. Whatever your background, you’ll need to be:\n\nClient-focused and committed to developing creative solutions \n\n\nAble to display leadership skills\n\n\nAn analytical thinker with excellent problem-solving skills \n\n\nA self-starter who is able to envision long-term goals and ways to attain them \n\n\nA collaborative team member who builds excellent relationships \n\n\nAn articulate communicator, who also recognizes the importance of listening\n\n \n \n","url":"https://www.wikijob.co.uk/tracking_click/2021070/field_apply_now_button","salary":"","contract_type":"Temporary","vacancy_type":"Placement","location":"United Kingdom","deadline":"01.06.2015"},{"id":"2021069","title":"Fixed Income Rotational Summer Internship Program","logo":"https://www.wikijob.co.uk/sites/default/files/styles/profile_job_post_logo/public/images/credit-suisse_3.jpg?itok=y02xUu2T","company":"","job_role":"Banking &amp; Financial Services","summary":"","description":"About Credit Suisse\nCredit Suisse is a global financial services company providing Private Banking &amp; Wealth Management services, and Investment Banking services and expertise to companies, institutions and high-net-worth clients. We are in over 50 countries with over 46,000 employees. \n&nbsp;\nWe aim to build the bank of the future at Credit Suisse, servicing our clients across regions and businesses. It also means fulfilling our responsibility to help shape the global economy, and to make a difference in people&rsquo;s lives. With world-class training and support, our entry-level hiring programs give you the chance to make an impact. Throughout your career with us, you will benefit from cross-business and international mobility opportunities. A career with us means that you can help shape our future.\n&nbsp;\nAbout Fixed Income\nCredit Suisse&#39;s Fixed Income franchise operates as a unified platform that handles all Fixed Income cash and derivative products. The bank&#39;s product and regional team structure allows us to deliver product-based solutions that address the constantly changing goals of our corporate, sovereign and institutional customers worldwide. \n&nbsp;\nProducts and services range from securitization and liability management transactions to sales and trading and superior research. Through a strong commitment to understanding the needs of our customers and channeling the vast resources of Credit Suisse to meeting those needs, the bank has greatly expanded its global penetration and reach. \n&nbsp;\nWithin the Fixed Income product areas we have professionals working in the following roles: Research, Sales, Structuring, Capital Markets and Trading. &nbsp;\n&nbsp;\nInterns join either our fixed desk Research program, or the Rotational Sales, Trading and Structuring program, which offers three (3) 3-week placements across the following areas:\n&nbsp;\n\n\nGlobal Credit Products (GCP) is a market leading franchise that encompasses the underwriting and syndication of corporate debt and Leveraged Loans, market making for investment grade, high yield and distressed debt including loans and offers structured credit solutions for our clients.\n\n\n&nbsp;\n\n\nSecuritized Products is a market leader in residential mortgage-backed securities (RMBS), commercial mortgage-backed securities (CMBS), and collateralized debt obligations (CDO), with a strong client base.\n\n\n&nbsp;\n\n\nGlobal Macro Products consists of Rates, FX and Commodities professionals focused on delivering cross-asset products and solutions for our clients. The alignment of these businesses will enable us to integrate our award-winning technology, thought leadership and innovation. \n\n\nFX is a franchise business that is primarily focused on providing liquidity, execution and hedging services to our clients\n\n\nCommodities is a fully integrated business spanning a wide range of underlying instruments, including oil and refined products, gas, coal, freight, base and precious metals, agricultural commodities and investor products\n\n\nRates makes markets in the government bond and interest rate derivative markets of the developed market economies\n\n\n&nbsp;\n\n\nFinancial Institutions Solutions Group (FISG) provides best-in-class strategic solutions that leverage Credit Suisse&rsquo;s product offering across Fixed Income and Equities as well as Wealth Management. &nbsp;\n\n\n&nbsp;\n\n\nEmerging Markets bring clients the entire spectrum of emerging market products across the key growth markets of the world, in cash and derivatives across foreign exchange, credit, interest rates and hybrid asset classes. \n\n\n\t&nbsp;\nAbout the Program\nSecurities interns spend their first week in a comprehensive training program covering all aspects of the markets. This will include looking at specific products and businesses in Fixed Income and Equities and participating in case studies or simulations. Additionally you will also be given training on applications and tools such as Excel and Bloomberg, which you will use throughout the program. By the end of the week you will be fully conversant with the knowledge, terminology and technical skills to support your learning in the program.\n&nbsp;\nInterns are allocated to desks following a placement day held in April, when the incoming class meets with representatives from each desk and function (Research or Sales, Trading or Structuring). The campus team will also provide information on each group, and guidance based on your interview feedback to help secure the best placement.\n&nbsp;\nRotational interns will identify their preferred desks, and once thier interview feedback and preferences have been coordinated, they will be assigned to a three-desk rotation. &nbsp;\n&nbsp;\nAll interns are provided a mentor to oversee their time with Credit Suisse, and encourage networking opportunities. On each placement you will have a dedicated Desk Coordinator who will manage your day to day workload, and provide feedback in formal reviews. The summer internship is our core hiring channel for our full-time Analyst class.\n&nbsp;\nDegree Requirements\nTo be eligible, you will have completed or be due to complete a Bachelors, Masters or PhD qualification (or equivalent) in any discipline. \n&nbsp;\nAll applicants must be in their penultimate year of study, be available for the full 10 weeks and be able to start full-time employment in July 2016.\n&nbsp;\nWhat We Look For\nWhile our employees have a wide range of experiences and interests, they share an intellectual curiosity, a desire to achieve and a pattern of excellence and achievement. Whatever your background, you&rsquo;ll need to be:\n\n\nClient-focused and committed to developing creative solutions \n\n\nA leader who naturally attracts followers\n\n\nA critical thinker with excellent problem-solving skills \n\n\nA self-starter who is able to envision long-term goals and ways to attain them \n\n\nA collaborative team member who builds excellent relationships \n\n\nAn articulate communicator who also recognizes the importance of listening \n\n\nAnalytical and logical, with raw intellectual ability\n\n\n","url":"https://www.wikijob.co.uk/tracking_click/2021069/field_apply_now_button","salary":"","contract_type":"","vacancy_type":"","location":"United Kingdom","deadline":"01.06.2015"},{"id":"2021068","title":"Finance Summer Internship","logo":"https://www.wikijob.co.uk/sites/default/files/styles/profile_job_post_logo/public/images/credit-suisse_3.jpg?itok=y02xUu2T","company":"","job_role":"Banking &amp; Financial Services","summary":"","description":"About Credit Suisse\nCredit Suisse is a global financial services company providing Private Banking &amp; Wealth Management services, and Investment Banking services and expertise,to companies, institutions and high-net-worth clients. We are active in more than 50 countries and employ over 46,000 people.  \n \nIt’s our aim to build the bank of the future at Credit Suisse—working as one integrated bank, servicing our clients across regions and businesses. It also means fulfilling our responsibility to help shape the global economy, and to make a difference in people’s lives.\n \nWe offer entry-level hiring programs in a variety of business areas. Our programs give you the chance to make an impact, and provide world-class training and support to help you develop into a leader. Throughout your career with us, you will benefit from cross-business and international mobility opportunities. \n \n \nWe look for people with a wide range of experiences, interests and degrees who will add fresh perspectives to our business.  A career with us means that you can help shape our future. \n \nAbout Finance\nThe Finance division manages the bank’s capital, funding, liquidity and expenses to keep Credit Suisse agile and competitive, and enable its long-term growth. The division provides a range of high quality, efficient services that are necessary to make global, firm-wide decisions, including:\n\nDrive cost efficiencies and growth discipline to help the bank exceed its RoE target of 15%, while seeking new business opportunities\n\n\nImprove the control, quality and efficiency of our information, advice and services\n\n\nEngage with the business to prepare the bank for regulatory changes\n\n\nPrepare financial and regulatory reporting across the entire bank (Financial Accounting).\n\n \nWe offer internships in the following areas: Product Control, CFO Change, Financial Account, Corporate Real Estate and Services, Tax, Group Finance and Risk\n \nAbout the Program\nOur 10-week summer internship program will provide you with formal financial markets and Excel training, as well as on the job practice and mentoring.  You will work as an analyst-level resource for one dedicated desk within Finance for the 10 weeks of your internship.  We will evaluate your preferences prior to your start date and take them into consideration when making desk allocation decisions.\nYou will be assigned a Credit Suisse buddy who will provide you with additional support prior to, during, and after your internship.  As well as undertaking an assigned desk-specific project during your internship, you will also be working on a group project with other interns; this will help you build upon your project management, team collaboration and presentation skills\n \nThe program offers opportunities to meet with senior managers, colleagues and peers at all levels across the bank. So you may gain insights into the bank, its culture, and build a professional network.\n \nYour managers will work with you on an objective and review process, which provides structure to your placement and gives you an outline of placement requirements and goals. This practice also gives us a tangible framework for assessing you for a full-time graduate position after your graduation in 2016. The summer internship is our core hiring channel for our full-time Analyst class.\n \nDegree Requirements\nTo be eligible, you will have completed or be due to complete a Bachelors, Masters or PhD qualification (or equivalent) in any discipline. \n \nAll applicants must be in their penultimate year of study, be available for the full 10 weeks and be able to start full-time employment in July 2016.\n \nWhat We Look For\nWhile our employees have a wide range of experiences, interests and degrees, they share an intellectual curiosity, a desire to achieve and a pattern of excellence and achievement. Whatever your background, you’ll need to be:\n\nClient-focused and committed to developing creative solutions \n\n\nA critical thinker with excellent problem-solving skills \n\n\nA self-starter who is able to envision long-term goals and ways to attain them \n\n\nA collaborative team member who builds excellent relationships \n\n\nAn articulate communicator who also recognizes the importance of listening \n\n\nAnalytical and logical, with raw intellectual ability\n\n","url":"https://www.wikijob.co.uk/tracking_click/2021068/field_apply_now_button","salary":"","contract_type":"Temporary","vacancy_type":"Internship","location":"United Kingdom","deadline":"01.06.2015"},{"id":"2021067","title":"Equities Rotational Summer Internship Program","logo":"https://www.wikijob.co.uk/sites/default/files/styles/profile_job_post_logo/public/images/credit-suisse_3.jpg?itok=y02xUu2T","company":"","job_role":"Banking &amp; Financial Services","summary":"About Credit Su","description":"About Credit Suisse\nCredit Suisse is a global financial services company providing Private Banking &amp; Wealth Management services, and Investment Banking services and expertise to companies, institutions and high-net-worth clients. We are active in more than 50 countries and employ over 46,000 people.  \n \nWe aim to build the bank of the future at Credit Suisse—working as one integrated bank, servicing our clients across regions and businesses. It also means fulfilling our responsibility to help shape the global economy, and to make a difference in people’s lives.\n \nWe offer entry-level hiring programs in a variety of business areas. Our programs give you the chance to make an impact, and provide world-class training and support to help you develop into a leader. Throughout your career with us, you will benefit from cross-business and international mobility opportunities.  \n \nWe look for people with a wide range of experiences, interests and degrees who will add fresh perspectives to our business.  \n \nA career with us means that you can help shape our future. \n \nAbout Equities\nThe Equities team is composed of research analysts, salespeople, sales-traders and traders who engage in a broad range of activities to bring complex financial transactions to the market. The team is engaged in sales, trading, financing, prime brokerage services and market-making in global equity and equity-related securities, options, futures, risk management and hedging products. Our activities cover both exchange-traded and over-the-counter traded securities, including American Depositary Receipts, restricted stocks, equity repurchases, block trade executions, program trading executions, equity derivatives and convertible securities. \n \nInterns join either our fixed desk Research program, or the Rotational Sales, Trading and Structuring program, which offers three (3) three-week placements in the Cash, Prime Services and Derivatives business areas.\n \n\nCash\n\nWest Europe Trading: Market making/providing liquidity for our clients in European equities – both hedge fund and long fund. \n\nAdvanced Execution Services Sales: Providing electronic access to multiple markets throughout Europe both for internal users and for external clients. The primary product is a suite of algorithmic trading strategies and tools across several asset classes including Equities, FX and Futures. \n\n \n\nPrime Services\n\nPrime Services provides a full scope of services to hedge funds and institutional clients, including prime brokerage, start-up services, capital introductions, securities lending, synthetics, and innovative financing solutions. \n \n\nDerivatives \n\nThe Derivatives business is a global market-maker, primarily trading listed, and OTC equity options with a global client base. Activities are broken down into four main clusters: Flow, Structured, Corporate and Emerging Market.\n \nAbout the Program\nSecurities interns spend their first week in a comprehensive training program covering all aspects of the markets, geared toward acquiring the knowledge, terminology and technical skills required for the program. Interns may expect to review specific products and businesses in Fixed Income and Equities, participate in case studies/simulations, and receive training on tools such as Excel and Bloomberg. \n \nInterns will meet with representatives from each desk and function (Research or Sales, Trading or Structuring) to begin the placement process, assisted by the campus recruiting team. Following interviews and a placement day in April, interns are allocated to a rotation of desks—either a combination of functions (Sales, Trading or Structuring) or a rotation in one function across different products (e.g., Cash sales, Prime Services Sales, Derivative Sales).\n \nAll interns are supported with a mentor to help structure their time at the bank and assist with networking opportunities.  A dedicated desk coordinator will manage your daily workload, and provide feedback in formal reviews. This additional support is designed to present an inclusive view of the role and help qualify interns for consideration of a full-time role upon graduation. The summer internship is the bank’s core hiring channel for the full-time Analyst class.\n \nDegree Requirements\nTo be eligible, you will have completed or be due to complete a Bachelors, Masters or PhD qualification (or equivalent) in any discipline. \n \nAll applicants must be in their penultimate year of study, be available for the full 10 weeks and be able to start full-time employment in July 2016.\n \nWhat We Look For\nWhile our employees have a wide range of experiences and interests, they share an intellectual curiosity, a desire to achieve and a pattern of excellence and achievement. Whatever your background, you’ll need to be:\n\nClient-focused and committed to developing creative solutions \n\n\nA leader who naturally attracts followers\n\n\nA critical thinker with excellent problem-solving skills \n\n\nA self-starter who is able to envision long-term goals and ways to attain them \n\n\nA collaborative team member who builds excellent relationships \n\n\nAn articulate communicator who also recognizes the importance of listening \n\n\nAnalytical and logical, with raw intellectual ability\n\n \n \n","url":"https://www.wikijob.co.uk/tracking_click/2021067/field_apply_now_button","salary":"","contract_type":"Temporary","vacancy_type":"Internship","location":"United Kingdom","deadline":"01.06.2015"},{"id":"2021066","title":"Equities Research Summer Internship Program","logo":"https://www.wikijob.co.uk/sites/default/files/styles/profile_job_post_logo/public/images/credit-suisse_3.jpg?itok=y02xUu2T","company":"","job_role":"Banking &amp; Financial Services","summary":"About Credit Su","description":"About Credit Suisse\nCredit Suisse is a global financial services company providing Private Banking &amp; Wealth Management services, and Investment Banking services and expertise to companies, institutions and high-net-worth clients. We are active in more than 50 countries and employ over 46,000 people.  \n \nIt’s our aim to build the bank of the future at Credit Suisse—working as one integrated bank, servicing our clients across regions and businesses. It also means fulfilling our responsibility to help shape the global economy, and to make a difference in people’s lives.\n \nWe offer entry-level hiring programs in a variety of business areas. Our programs give you the chance to make an impact, and provide world-class training and support to help you develop into a leader. Throughout your career with us, you will benefit from cross-business and international mobility opportunities.  \n \nWe look for people with a wide range of experiences, interests and degrees who will add fresh perspectives to our business.  A career with us means that you can help shape our future. \n \nAbout Equities\nThe Equities team is composed of research analysts, salespeople, sales-traders and traders who engage in a broad range of activities to bring complex financial transactions to the market. The team is engaged in sales, trading, financing, prime brokerage services and market-making in global equity and equity-related securities, options, futures, risk management and hedging products. Our activities cover both exchange-traded and over-the-counter traded securities, including American Depositary Receipts, restricted stocks, equity repurchases, block trade executions, program trading executions, equity derivatives and convertible securities.\n \nInterns join either our fixed desk Research program, or the Rotational Sales, Trading and Structuring program, which offers three (3) three-week placements in the Cash, Prime Services and Derivatives business areas.\n \nEquities Research\nThe Equity Research group differentiates itself by offering in-depth analytical frameworks, proprietary methodologies, and unique data sources that help clients meet their investment goals. Leveraging the bank’s global resources, the equity research teams analyze nearly 2,500 companies worldwide. Their research is further augmented by the macro-economic and strategy teams, which add thematic insights derived from a global perspective.\n \nAbout the Program\nSecurities interns spend their first week in a comprehensive training program covering all aspects of the markets, geared toward acquiring the knowledge, terminology and technical skills required for the program. Interns may expect to review specific products and businesses in Fixed Income and Equities, participate in case studies/simulations, and receive training on tools such as Excel and Bloomberg. \n \nInterns will meet with representatives from each desk and function (Research or Sales, Trading or Structuring) to begin the placement process, assisted by the campus recruiting team. Following a placement day in April, interns are allocated to dedicated desks, where they will spend nine weeks, allowing them to build significant knowledge in an area.\n \nAll interns are supported with a mentor to help structure their time at the bank and assist with networking opportunities. A dedicated desk coordinator will manage your daily workload, and provide feedback in formal reviews. This additional support is designed to present an inclusive view of the role and help qualify interns for consideration of a full-time role upon graduation. The summer internship is the bank’s core hiring channel for the full-time Analyst class.\n \nDegree Requirements\nTo be eligible, you will have completed or be due to complete a Bachelors, Masters or PhD qualification (or equivalent) in any discipline. \n \nAll applicants must be in their penultimate year of study, be available for the full 10 weeks and be able to start full-time employment in July 2016.\n \nWhat We Look For\nWhile our employees have a wide range of experiences and interests, they share an intellectual curiosity, a desire to achieve and a pattern of excellence and achievement. Whatever your background, you’ll need to be:\n\nClient-focused and committed to developing creative solutions \n\n\nA leader who naturally attracts followers\n\n\nA critical thinker with excellent problem-solving skills \n\n\nA self-starter who is able to envision long-term goals and ways to attain them \n\n\nA collaborative team member who builds excellent relationships \n\n\nAn articulate communicator who also recognizes the importance of listening \n\n\nAnalytical and logical, with raw intellectual ability\n\n \n \n","url":"https://www.wikijob.co.uk/tracking_click/2021066/field_apply_now_button","salary":"","contract_type":"Temporary","vacancy_type":"Internship","location":"United Kingdom","deadline":"01.06.2015"},{"id":"2021065","title":"Change Program Services Summer Internship Program","logo":"https://www.wikijob.co.uk/sites/default/files/styles/profile_job_post_logo/public/images/credit-suisse_3.jpg?itok=y02xUu2T","company":"","job_role":"Banking &amp; Financial Services","summary":"","description":"About Credit Suisse\nCredit Suisse is a global financial services company providing Private Banking &amp; Wealth Management services, and Investment Banking services and expertise to companies, institutions and high-net-worth clients. We are active in more than 50 countries and employ over 46,000 people. \n \nWe aim to build the bank of the future at Credit Suisse—working as one integrated bank, servicing our clients across regions and businesses. It also means fulfilling our responsibility to help shape the global economy, and to make a difference in people’s lives. With world-class training and support, our entry-level hiring programs give you the chance to make an impact. Throughout your career with us, you will benefit from cross-business and international mobility opportunities. A career with us means that you can help shape our future.\n \nAbout CFO Program Services\nThe CFO Program Services Team provides strategic consulting and project management services to all divisions within the bank, covering both CFO and Shared Services departments. The team defines and delivers the most important change programs within the bank, and through this delivery raises the overall level of change delivery capability within the bank.\n \nThe team is managed by a London-based Global Lead with regional management teams located in the UK, US, Zurich and Singapore. \n \nThe CFO Program Services group helps plan and execute major initiatives and projects employing industry best practices, focusing on high-priority initiatives that deliver optimal IT solutions to our business partners. The group:\n\nHelps the business and IT understand the impact of technology, economic, industry and regulatory change\n\n\nEnables the business to make good choices about technology investments and understand expected business outcomes \n\n\nEnsures maximum return on the Credit Suisse technology investment\n\n\nImproves the certainty of delivery (time, cost and quality) through program management, discipline and execution\n\n\nProvides transparency in the delivery of our programs and the deliverable benefits \n\n \nThis position offers significant scope in the context of challenging bank-wide projects--from initial concept design to the implementation of solutions.  \n \nJunior Consultant Role \nPerform research and data collection to understand the organization, and conduct analysis\nInterview client's employees, management team and other stakeholders\nConduct focus groups and facilitate workshops\nPrepare business proposals/presentations\nIdentify issues, and forming hypotheses and solutions\nPresent findings and recommendations to clients\nLiaise with clients on progress and relevant decisions\n \nJunior Project Manager Role \nSupport individual projects managers and or overall program manager on projects and programs\nDesign and maintain project SharePoint sites\nProduce communication materials \nUpdate key program artifacts as required\nTrack and follow up on project/program actions, budgets\nReport design and implementation  \nOwn work packages in support of the program / projects\nHelp enforce program standards around project management\n\t \nAbout the Program\nThe 10-week summer internship program provides training in formal financial markets and Excel, as well as on-the-job practice and mentoring. You will work as an analyst-level resource for a dedicated desk within IT for the 10 weeks of your internship. We will evaluate your preferences prior to your start date and take them into consideration when making desk allocation decisions.\nYou will be assigned a Credit Suisse buddy who will provide you with support throughout your placement.\nAs well as undertaking an assigned desk-specific project during your internship, you also will work on a group project with other interns enabling you to build project management, team collaboration and presentation skills\n \nThe program offers opportunities to meet with senior managers, colleagues and peers at all levels across the bank enabling you to gain insights into the bank, its culture, build a professional network.\n \nYour managers will work with you on an objective and review process, which provides structure to your placement and gives you an outline of placement requirements and goals. This practice also gives us a tangible framework for assessing you for a full-time position upon your graduation in 2016, as the summer internship is our core hiring channel for our full-time Analyst class.\n \nDegree Requirements\nTo be eligible, you will have completed or be due to complete a Bachelors, Masters or PhD qualification (or equivalent) in any discipline. Applicants should display a keen interest in consulting and/or project management work. \nAll applicants must be in their penultimate year of study, be available for the full 10 weeks and be able to start full-time employment in July 2016.\n \nWhat We Look For\nWhile our employees have a wide range of experiences and interests, they share an intellectual curiosity, a desire to achieve and a pattern of excellence and achievement. Whatever your background, you’ll need to be:\nClient-focused and committed to developing creative solutions \n\nA leader who naturally attracts followers\n\n\nA critical thinker with excellent problem-solving skills \n\n\nA self-starter who is able to envision long-term goals and ways to attain them \n\n\nA collaborative team member who builds excellent relationships \n\n\nAn articulate communicator who also recognizes the importance of listening \n\n\nAnalytical and logical, with raw intellectual ability\n\n\n\t \n","url":"https://www.wikijob.co.uk/tracking_click/2021065/field_apply_now_button","salary":"","contract_type":"Temporary","vacancy_type":"Internship","location":"United Kingdom","deadline":"01.06.2015"},{"id":"2021064","title":"Private Client Tax Trainee","logo":"https://www.wikijob.co.uk/sites/default/files/styles/profile_job_post_logo/public/images/profiles/Smith_Williamson_Logo.jpg?itok=GwNikqgL","company":"","job_role":"Accounting, Auditing &amp; Finance","summary":"","description":"At Smith &amp; Williamson we recruit high calibre people with the skills, knowledge and commitment to meet the demands of the business. The successful individual will join a three year structured training programme combining practical experience with technical studies for the Association of Taxation Technicians (ATT) and Chartered Taxation Adviser (CTA) qualifications.\nIf you are a graduate looking for first class training in Private Client Tax Services and meet our requirements, we would like to hear from you. \nDuties  \n\nCompletion of tax returns for individuals\n\n\nYearly routine checks and compliance\n\n\nOrganisation of workload to ensure an efficient and timely service\n\n\nAssisting other group members in professional work and providing administrative support\n\n\nWill acquire own clients from start of training programme  \n\nTo be successful in this role you will:\n\nBe committed and motivated to studying towards the ATT and CTA qualifications\n\n\nBe able to deliver first class client service and work effectively as part of a team\n\n\nDemonstrate an ability to communicate clearly both verbally and in writing\n\n\nBe well organised and have the ability to prioritise your own workload\n\n\nHave a high level of general commercial awareness \n\nAcademic requirements\n\nMust have or be on course for at least a strong second class honours degree in any discipline\n\n\n300 UCAS points (or equivalent) in your top three A-levels (excluding General Studies)\n\n\nGCSE English and maths (or equivalent) at a minimum of grade B \n\nApplication process \n\nStage 1 – complete our online application form\n\n\nStage 2 – online verbal reasoning test\n\n\nStage 3 – online numerical reasoning\n\n\nStage 4 – an assessment centre which includes a presentation from one of our heads of business, a verbal and numerical reasoning test and a written and group exercise\n\n\nStage 5 – competency based interview with a senior manager\n\n\nStage 6 – interview with a Partner from Private Client Tax Services \n\nApplications are currently open and we recruit on a rolling basis; APPLY NOW to avoid disappointment\n \n","url":"https://www.wikijob.co.uk/tracking_click/2021064/field_apply_now_button","salary":"","contract_type":"Permanent","vacancy_type":"Graduate Scheme","location":"United Kingdom","deadline":"01.12.2014"},{"id":"2021063","title":"Trainee Investment Manager","logo":"https://www.wikijob.co.uk/sites/default/files/styles/profile_job_post_logo/public/images/profiles/Smith_Williamson_Logo.jpg?itok=GwNikqgL","company":"","job_role":"Accounting, Auditing &amp; Finance, Banking &amp; Financial Services","summary":"","description":"At Smith &amp; Williamson we recruit high calibre people with the skills, knowledge and commitment to meet the demands of the business. The successful individual will join a structured training programme combining practical experience with technical studies for the Investment Advice Diploma (IAD) and CISI’s Masters in Wealth Management qualifications.  \nIf you are a graduate looking for first class training in Investment Management and meet our requirements, we would like to hear from you.\nDuties:\n\nFund management \n\nAssist Director with regular portfolio reviews \n\n\nUndertake basic analysis of companies\n\n\nAttend daily morning meetings and other meetings relevant to role\n\n\n\nDraft client correspondence, e.g. valuation letters for approval by Director \n\n\nWrite up client meeting notes\n\n\nResearch and draft responses to client queries \n\n\nAssist in setting up new clients \n\n\nCheck monthly/quarterly statements \n\n\nSet up client trades \n\n\nLiaise with Investment Settlement Operations and Banking departments on administrative matters, e.g. stock transfers, corporate actions \n\n\nAttend weekly investment meetings\n\n\nCompliance and Training \n\nEnsure familiarity and compliance with FSA requirements \n\n\nAttend annual compliance briefing\n\n\nAttend internal/external seminars as appropriate \n\n\n\nSupport the team by liaising with clients and their advisors \n\n\nCollate information/documentation for Director\n\n\nSecondments to other departments e.g. Investment Settlement Operations, Middle Office, Compliance, Private Banking and Fund Administration \n\nTo be successful in this role you will:\n\nBe committed and motivated to studying towards the IMC and masters qualifications\n\n\nBe able to deliver first class client service and work effectively as part of a team \n\n\nDemonstrate an ability to communicate clearly both verbally and in writing \n\n\nHave a high level of general commercial awareness \n\n\nBe well organised and have the ability to prioritise your own workload\n\nAcademic requirements\n\nMust have or be on course for at least an upper second class honours degree in any discipline \n\n\n320 UCAS points (or equivalent) in your top three A-levels (excluding General Studies) \n\n\nGCSE English and Maths (or equivalent) at a minimum of grade B \n\nApplication process\n\nStage 1 – submit online application form (please note the closing date is 31st October). \n\n\nStage 2 – complete online verbal and numerical reasoning tests.\n\n\nStage 3 – review of online application form and online tests.\n\n\nStage 4 – assessment centre which includes a verbal and numerical reasoning test and a written and group exercise.  These will take place in October and November. \n\n\nStage 5 – competency based telephone interview with a member of HR.  These will take place in the latter half of October and throughout November.\n\n\nStage 6 – presentation and final interview with two Directors from Investment Management London.  These will take place in the first 2 weeks of December\n\nThe closing date for this role is the 31st October 2014. Please note that you will need to be available on the dates above to be considered for the role. We review applications as we receive them therefore to avoid disappointment, we advise you apply as early as possible.\n \n","url":"https://www.wikijob.co.uk/tracking_click/2021063/field_apply_now_button","salary":"","contract_type":"Permanent","vacancy_type":"Graduate Scheme","location":"United Kingdom","deadline":"01.11.2014"},{"id":"2021062","title":"Corporate Tax Trainee","logo":"https://www.wikijob.co.uk/sites/default/files/styles/profile_job_post_logo/public/images/profiles/Smith_Williamson_Logo.jpg?itok=GwNikqgL","company":"","job_role":"Accounting, Auditing &amp; Finance","summary":"At ","description":"At Smith &amp; Williamson we recruit high calibre people with the skills, knowledge and commitment to meet the demands of the business. The successful individual will join a three year structured training programme combining practical experience with technical studies for the ACA qualification and possibly the Chartered Taxation Adviser (CTA) qualification.\nIf you are a graduate and looking for first class training in Corporate Tax and meet all the criteria listed below we would like to hear from you.\nDuties \n\nPreparation of corporation tax computations and returns (CT600s)\n\n\nGeneral compliance including keeping records of tax payments, advising clients of key filing and payment dates and communicating with the HM Revenue &amp; Customs where necessary\n\n\nPreparing billing analysis of work completed and draft fee notes to clients\n\n\nAssist with research assignments and drafting technical documentation\n\n\nAssisting other group members in professional work and providing support where required\n\n\nAcquire and build relationship with your own clients and begin to supervise new trainees after approximately one year\n\nTo be successful in this role you will:\n\nBe committed and motivated to studying towards the ACA and CTA qualifications\n\n\nBe able to deliver first class client service and work effectively as part of a team\n\n\nDemonstrate an ability to communicate clearly both verbally and in writing\n\n\nBe well organised and have the ability to prioritise your own workload\n\n\nHave a high level of general commercial awareness\n\n\nTake a diligent and efficient approach to work\n\n\nDemonstrate a professional and polite approach\n\nAcademic requirements\n\nMust have or be on course for at least a strong second class honours degree in any discipline\n\n\n300 UCAS points (or equivalent) in your top three A-levels (excluding General Studies)\n\n\nGCSE English and maths (or equivalent) at a minimum of grade B\n\nApplication process\n\nStage 1 – complete our online application form\n\n\nStage 2 – online verbal reasoning test\n\n\nStage 3 – online numerical reasoning\n\n\nStage 4 – an assessment centre which includes a presentation from one of our heads of business, a verbal and numerical reasoning test and a written and group exercise\n\n\nStage 5 – competency based interview with an assistant manager or manager from our London Corporate Tax department\n\n\nStage 6 – final interview with a director from our London Corporate Tax department\n\nApplications are currently open and we recruit on a rolling basis; APPLY NOW to avoid disappointment\n \n","url":"https://www.wikijob.co.uk/tracking_click/2021062/field_apply_now_button","salary":"","contract_type":"Permanent","vacancy_type":"Graduate Scheme","location":"United Kingdom","deadline":"01.12.2014"},{"id":"2021061","title":"Trainee Chartered Accountant","logo":"https://www.wikijob.co.uk/sites/default/files/styles/profile_job_post_logo/public/images/profiles/Smith_Williamson_Logo.jpg?itok=GwNikqgL","company":"","job_role":"Accounting, Auditing &amp; Finance","summary":"","description":"At Smith &amp; Williamson we recruit high calibre people with the skills, knowledge and commitment to meet the demands of the business. The successful individual will join a three year structured training programme combining practical experience with technical studies for the ACA qualification. \nIf you are a graduate looking for first class training in Assurance &amp; Business Services and meet our requirements, we would like to hear from you. \nJob description\nThe Trainee Chartered Accountant role equips you to provide a range of assurance and business services to a diverse client base ranging from small businesses and start-ups to substantial international groups.   \nThis means you will quickly gain broad experience in the following: \n\nTechnical – on-the-job training and studying towards your professional qualification will enable you to gain a full understanding of the technical aspects of audit and accountancy and additional financial advisory services. You will: \n\nDevelop an understanding of our client’s and their businesses\n\n\nComplete audit programmes and form conclusions on each individual test and section completed\n\n\nHighlight issues and problems for the attention of senior management\n\n\nBecome familiar with our audit software\n\n\n\nClient liaison – from day one you will engage with our clients at their offices and: \n\nDiscuss queries with client staff, obtaining relevant information and explanations as well as  \n\n\nResolve queries whether of an audit or accountancy nature\n\n\n\nProfessional qualification and internal training \n\nDuring your three year contract, you will study towards the ACA qualification with the ICAEW to become a chartered accountant\n\n\nYou will obtain an understanding of related services such as Corporate Tax and Private Client Tax Services through our structured trainee placement programme \n\n\nAttend a range of internal training sessions including industry experience and soft skills\n\n\n\nProfessional communication and (self) management – your ability to work as part of a team is essential to your role at every level \n\nWork as part of a team to undertake a variety of audit and accountancy tasks for our diverse client base\n\n\nUnderstand from your manager the scope of tasks allocated and objectives to be achieved\n\n\nKeep seniors and managers fully informed of any issues and problems, ensure work is completed to a level agreed with the manager and record clearly and concisely work done\n\n\nPrioritising tasks whilst monitoring time against budget\n\n\nSupport department events and procedures and build relationships within Smith &amp; Williamson \n\n\n \nTo be successful in this role you will:\n\nBe committed and motivated to studying towards the ACA qualification \n\n\nBe able to deliver first class client service and work effectively as part of a team\n\n\nDemonstrate an ability to communicate clearly both verbally and in writing \n\n\nHave a high level of general commercial awareness  \n\nAcademic requirements\n\nMust have or be on course for at least a strong second class honours degree in any discipline \n\n\n300 UCAS points (or equivalent) in your top three A-levels (excluding General Studies) \n\n\nGCSE English and maths (or equivalent) at a minimum of grade B  \n\nApplication process \n\nStage 1 – complete our online application form  \n\n\nStage 2 – online verbal reasoning test\n\n\nStage 3 – online numerical reasoning \n\n\nStage 4 – an assessment centre which includes a presentation from one of our heads of business, a verbal and numerical reasoning test and a written and group exercise \n\n\nStage 5 – competency based interview with a manager from our London Assurance &amp; Business Services department\n\n\nStage 6 – final interview with a partner from our London Assurance &amp; Business Services department \n\nApplications are currently open and we recruit on a rolling basis; APPLY NOW to avoid disappointment\n \n","url":"https://www.wikijob.co.uk/tracking_click/2021061/field_apply_now_button","salary":"","contract_type":"Permanent","vacancy_type":"Graduate Scheme","location":"United Kingdom","deadline":"01.12.2014"},{"id":"2021042","title":"Graduate opportunities within Actuarial Insurance Management Solutions with PwC – Autumn 2015","logo":"https://www.wikijob.co.uk/sites/default/files/styles/profile_job_post_logo/public/images/400x400%20pwc.gif?itok=FzQ6eiqQ","company":"","job_role":"Risk, Insurance &amp; Actuarial","summary":"Your career ","description":"Your career is just that, yours. You choose it. You live it. You make it happen. To get the best from it, you need the best opportunities. That&rsquo;s why opportunities are at the heart of a career with us.\n&nbsp;\nOur offer to you&hellip;\n\tBe part of the world&rsquo;s leading professional services network and enjoy the benefits that come with that. You&rsquo;ll work directly with big name clients where you&rsquo;ll get to grips with the value they&rsquo;re looking for by getting into the detail. We&rsquo;ll provide an environment where you&rsquo;ll be able to explore new opportunities, to help you grow and find your niche. And we&rsquo;ll give you access to be best learning and development around. &nbsp;\n&nbsp;\nActuarial\nAs an actuary, you&rsquo;ll work with uncertainty. Using complex financial and statistical theories to calculate the likelihood of events and you&rsquo;ll work out what that means financially for clients. It&#39;s highly technical work. And it&rsquo;s made all the more challenging by the fact that you&rsquo;ll have to present your complex findings in simple, easy to understand ways\n&nbsp;\nWhat you&rsquo;d do\nIn Actuarial &amp; Insurance Management Solutions you&rsquo;ll work with clients from the insurance industry (both life and general insurance), but also those in retail and investment banking, non-financial services corporates like energy and utilities, plus healthcare and the public sector. Your advice could cover solvency, reserving, economic capital, risk management, mergers &amp; acquisitions, company restructuring and de-risking, financial modelling, underwriting, new legislation, the viability of new products and the efficiency of claims or reporting processes.\n&nbsp;\nYour training and development:\nOur people make us stand out as a firm. So we choose the best and invest heavily in them. You&rsquo;ll benefit from the encouragement, opportunity and support which includes: \n&nbsp;\n\n\nOur graduate training programme helps you gain breadth as well as depth of knowledge and build a portfolio of valuable, transferable skills.\n\n\nMovement throughout the firm &ndash; you&rsquo;ll work in different teams and offices, experiencing different clients and projects.\n\n\nSupport to gain a professional qualification &ndash; study towards becoming an Actuary with the Fellow of the Institute and Faculty of Actuaries. You&rsquo;ll start working towards this during your structured induction training and it&#39;s a hefty commitment, calling for a great deal of self-discipline and motivation. But we&rsquo;ll provide you with study leave (about one day a week) and full financial support, internal tutorials, on-the-job coaching, formal learning courses and practical experience and a pay rise each time you pass an exam. \n\n\n&nbsp;\nWhat you need to bring us\n&nbsp;\n\n\nA 2:1 or above in any degree discipline\n\n\nA UCAS tariff of at least 320 (or equivalent) including a B in maths at A-level\n\n\n&nbsp;\nEqually important will be your intellect, willingness to learn, ability to build relationships, put yourself in others&rsquo; shoes, while always making a positive impact with our clients and each other. &nbsp;\n&nbsp;\nHow to apply\nWe&rsquo;re proud, based on the opportunity we offer, that students have voted us the number one Graduate Employer in The Times Top 100 Graduate Employers survey for the last nine years. &nbsp;\n&nbsp;\nAnd we know that the skills and experiences you develop with us, will stay with you throughout your career. &nbsp;So join us, and we&rsquo;ll help you reach your full potential.&nbsp;\n","url":"https://www.wikijob.co.uk/tracking_click/2021042/field_apply_now_button","salary":"","contract_type":"Permanent","vacancy_type":"Graduate Scheme","location":"United Kingdom","deadline":""},{"id":"2020201","title":"China Internship Program: Internships in Beijing and Shanghai","logo":"https://www.wikijob.co.uk/sites/default/files/styles/profile_job_post_logo/public/images/company-logos/2011454-1394238256.jpg?itok=ERpS4d_K","company":"","job_role":"Banking &amp; Financial Services","summary":"Gi2C Group","description":"Gi2C Group&nbsp;specializes in connecting China and the global community through&nbsp;professional internships in China&#39;s two major cities Beijing and Shanghai.\nWhy suffer in the West when you can prosper in the East as confirmed by the BBC and Forbes magazine.\u2028\u2028\nThrough partnerships with a variety of companies, Gi2C provide students, graduates and young professionals the opportunity to further their personal and professional development in a dynamic international setting. The wealth of skills and knowledge gained from our overseas work experience programs will&nbsp;enhance your CV&nbsp;and provide you the edge you need to land your dream job. \u2028\u2028\nChina&nbsp;is a fascinating place in which to work and live, culturally, linguistically, and socially. Gi2C international internship program runs for&nbsp;1, 2, and 3 months&nbsp;throughout the year across the most exciting industry sectors in China. This unique international experience allows participants to gain an insight into Chinese business culture, meet industry leaders, and build professional networks.\u2028\u2028\nDuring the China Internship Program you will be working in an International or Chinese company located in Beijing or Shanghai, where you will be required to work both independently and as part of a team.\u2028\u2028\nGi2C Internship Programs last from one to three months in a sector of your choice:\n\nFinance\nMarketing, PR &amp; Advertising\nInternational Business &amp; Consulting\nArchitecture and Interior design\nHotels and Tourism\nInternational Trade\nNGOs &amp; Charities\nLegal\nPharmaceuticals\nArts\nIT\nGraphic Design\nGreen-Technology and many more.\n\nTypical daily tasks include conducting research, writing reports, giving presentations, working in teams on strategy, accompanying colleagues on client meetings and business administration.\u2028\u2028\nThis is an incredible opportunity to gain excellent professional experience and key transferable skills in one of the world&rsquo;s most important and fastest-growing economies.\u2028\u2028\nApproximately 40% of interns will receive genuine job offers at the conclusion of their internship based on their work habits and job performance.\nPlease note: Chinese language skills are not necessary, fluent English is the only language requirement.\nTHE PROGRAM &amp; ASSOCIATED COSTS\nThis is a 30-90-days China internship program with Gi2C that will lead to full-time employment contingent upon your satisfactory performance.\nAll Internships are unpaid, the costs to enter each program are listed below.\nProgram Cost:&nbsp;Depending on the duration and the program type: 1 month - $2998, 2-3 months $3698.\nWHAT IS INCLUDED:\n\nAccommodation\nAirport pickup\nInternship placement\nWelcome package\nVisa assistance\nOrientation and city tour\nBusiness, Cultural Networking Events\nOn-site support\nKaraoke night (KTV)\nCharity Volunteering day\nCertificate upon completion\n\nGi2C international internship program requires travel to China for 1-3 months.&nbsp;You have to make sure you have enough funds to stay there for at least 3 months and pay for your food, apartment, transportation expenses and our program cost.\nAPPLY NOW\nYou can apply for this role at&nbsp;https://wikijobs.wufoo.com/forms/apply-to-gi2c/\n","url":"https://www.wikijob.co.uk/tracking_click/2020201/field_apply_now_button","salary":"","contract_type":"Temporary","vacancy_type":"Internship","location":"Asia Pacific, China","deadline":""},{"id":"2020200","title":"International Trade Internship In Shanghai, China","logo":"https://www.wikijob.co.uk/sites/default/files/styles/profile_job_post_logo/public/images/company-logos/2011454-1394238256.jpg?itok=ERpS4d_K","company":"","job_role":"Business &amp; Management","summary":"Gi2C Group","description":"Gi2C Group specializes in connecting China and the global community through professional internships in China's two major cities Beijing and Shanghai.\n \nWhy suffer in the West when you can prosper in the East as confirmed by the BBC and Forbes magazine.\u2028\u2028\nThrough partnerships with a variety of companies, Gi2C provide students, graduates and young professionals the opportunity to further their personal and professional development in a dynamic international setting. The wealth of skills and knowledge gained from our overseas work experience programs will enhance your CV and provide you the edge you need to land your dream job. \u2028\u2028\nChina is a fascinating place in which to work and live, culturally, linguistically, and socially. Gi2C international internship program runs for 1, 2, and 3 months throughout the year across the most exciting industry sectors in China. This unique international experience allows participants to gain an insight into Chinese business culture, meet industry leaders, and build professional networks.\u2028\u2028\nABOUT THE COMPANY\nThis international corporation was named to the top 10 list of innovative companies in China. The company is a world leader in the development of Green Tech products, manufacturing and distributing around the world cutting edge green energy technology. Currently sales exceed 50 million with exports to 28 countries (e.g. UK, Australia, Barbados, Belgium, USA, Brazil, Czech Republic, Denmark, France, Germany, Italy, Portugal, Spain...). Currently 70 employees are employed at the Shanghai location. Entry-level management positions are available to foreign interns who prove their value and are willing to learn Chinese.\nDAILY RESPONSIBILITIES\nWork with the team to develop and implement marketing strategies;\nIdentify target areas and initiate necessary resources to meet foreign target markets;\nDevelopment and implementation of new marketing materials;\nCommunication and negotiation with corporate clients;\nAnalyze the data and prepare regular reports;\nDevelop new markets abroad via creative channels;\nApproximately 40% of interns will receive genuine job offers at the conclusion of their internship based on their work habits and job performance.\nPlease note: Chinese language skills are not necessary, fluent English is the only language requirement.\nTHE PROGRAM &amp; ASSOCIATED COSTS\nThis is a 30-90-days China internship program with Gi2C that will lead to full-time employment contingent upon your satisfactory performance.\nAll Internships are unpaid, the costs to enter each program are listed below.\nProgram Cost: Depending on the duration and the program type: 1 month - $2998, 2-3 months $3698.\nWHAT IS INCLUDED:\nAccommodation\nAirport pickup\nInternship placement\nWelcome package\nVisa assistance\nOrientation and city tour\nBusiness, Cultural Networking Events\nOn-site support\nKaraoke night (KTV)\nCharity Volunteering day\nCertificate upon completion\nGi2C international internship program requires travel to China for 1-3 months. You have to make sure you have enough funds to stay there for at least 3 months and pay for your food, apartment, transportation expenses and our program cost.\nAPPLY NOW\nYou can apply for this role at https://wikijobs.wufoo.com/forms/apply-to-gi2c/\n","url":"https://www.wikijob.co.uk/tracking_click/2020200/field_apply_now_button","salary":"","contract_type":"Temporary","vacancy_type":"Internship","location":"Asia Pacific, China","deadline":""},{"id":"2020199","title":"Finance Internship In Beijing, China","logo":"https://www.wikijob.co.uk/sites/default/files/styles/profile_job_post_logo/public/images/company-logos/2011454-1394238256.jpg?itok=ERpS4d_K","company":"","job_role":"Accounting, Auditing &amp; Finance","summary":"Gi2C","description":"Gi2C Group specializes in connecting China and the global community through professional internships in China's two major cities Beijing and Shanghai.\nWhy suffer in the West when you can prosper in the East as confirmed by the BBC and Forbes magazine.\u2028\u2028\nThrough partnerships with a variety of companies, Gi2C provide students, graduates and young professionals the opportunity to further their personal and professional development in a dynamic international setting. The wealth of skills and knowledge gained from our overseas work experience programs will enhance your CV and provide you the edge you need to land your dream job. \u2028\u2028\nChina is a fascinating place in which to work and live, culturally, linguistically, and socially. Gi2C international internship program runs for 1, 2, and 3 months throughout the year across the most exciting industry sectors in China. This unique international experience allows participants to gain an insight into Chinese business culture, meet industry leaders, and build professional networks.\u2028\u2028\nABOUT THE COMPANY\nWe are a global investment banking company in both the US and China, and focus on M&amp;A and IPOs for NASDAQ and the Shanghai index. We began the company over 12 years ago and have strong network all around China as well as in-depth industry knowledge for sourcing deals and helping international business grow in China. With our database of thousands of key Chinese companies and mergers and acquisitions, we know who’s who in China.\nWe use our data and skill to find new opportunities and generate value for our clients in numerous industries such as:\nConstruction\nConsumer/retail\nEnergy\nNatural resources\nHigh-tech industries\nPrivately-held enterprises and high growth tech companies\nDAILY RESPONSIBILITIES\nHelp our key teams to research and assess acquisition targets and strategies.\nResearch markets outside of China and develop foreign investment projects;\nUndertake project tasks such as financial, market, sensitivity and risk analysis, etc.\nContact overseas companies (by emailing and calling) to understand their interests and learn what they look for in a potential Chinese investor;\nJoining forums, and investment conferences;\nOther ad hoc tasks\nApproximately 40% of interns will receive genuine job offers at the conclusion of their internship based on their work habits and job performance.\nPlease note: Chinese language skills are not necessary, fluent English is the only language requirement.\nTHE PROGRAM &amp; ASSOCIATED COSTS\nThis is a 30-90-days China internship program with Gi2C that will lead to full-time employment contingent upon your satisfactory performance.\nAll Internships are unpaid, the costs to enter each program are listed below.\nProgram Cost: Depending on the duration and the program type: 1 month - $2998, 2-3 months $3698.\nWHAT IS INCLUDED:\nAccommodation\nAirport pickup\nInternship placement\nWelcome package\nVisa assistance\nOrientation and city tour\nBusiness, Cultural Networking Events\nOn-site support\nKaraoke night (KTV)\nCharity Volunteering day\nCertificate upon completion\nGi2C international internship program requires travel to China for 1-3 months. You have to make sure you have enough funds to stay there for at least 3 months and pay for your food, apartment, transportation expenses and our program cost.\nAPPLY NOW\nYou can apply for this role at https://wikijobs.wufoo.com/forms/apply-to-gi2c/\n","url":"https://www.wikijob.co.uk/tracking_click/2020199/field_apply_now_button","salary":"","contract_type":"Temporary","vacancy_type":"Internship","location":"Asia Pacific, China","deadline":""},{"id":"2020197","title":"International Marketing Internship In Beijing, China","logo":"https://www.wikijob.co.uk/sites/default/files/styles/profile_job_post_logo/public/images/company-logos/2011454-1394238256.jpg?itok=ERpS4d_K","company":"","job_role":"Advertising, Marketing &amp; Public Relations","summary":"Gi2C Group","description":"Gi2C Group specializes in connecting China and the global community through professional internships in China's two major cities Beijing and Shanghai.\nWhy suffer in the West when you can prosper in the East as confirmed by the BBC and Forbes magazine.\u2028\u2028\nThrough partnerships with a variety of companies, Gi2C provide students, graduates and young professionals the opportunity to further their personal and professional development in a dynamic international setting. The wealth of skills and knowledge gained from our overseas work experience programs will enhance your CV and provide you the edge you need to land your dream job. \u2028\u2028\nChina is a fascinating place in which to work and live, culturally, linguistically, and socially. Gi2C international internship program runs for 1, 2, and 3 months throughout the year across the most exciting industry sectors in China. This unique international experience allows participants to gain an insight into Chinese business culture, meet industry leaders, and build professional networks.\u2028\u2028\nABOUT THE COMPANY\nWe are an international private investment banking company with offices in three countries with a focus on M&amp;A and EB5 projects. in both the US and China. We have been growing for the last decade and now require many foreign-speaking (English, German, French, Spanish, Russian) Graduates with marketing training and good people/communications skills to be assigned to our global expansion program. Prove yourself a valuable asset during your internship and you can become a full-time employee. We seek out and provide PE funding for:\nCommunications/IT\nB2B and B2C service providers\nGreen Energy\nFinancial Services\nInternational Trade\nInternational Resorts\nDAILY RESPONSIBILITIES\nConduct market research and surveys\nDevelop sales and marketing strategies;\nIdentify new potential markets\nProvide timely feedback to top management;\nAssist with designing promotional materials\nPursue business development and negotiate;\nAttend networking events on behalf of the company\nApproximately 40% of interns will receive genuine job offers at the conclusion of their internship based on their work habits and job performance.\nPlease note: Chinese language skills are not necessary, fluent English is the only language requirement.\nTHE PROGRAM &amp; ASSOCIATED COSTS\nThis is a 30-90-days China internship program with Gi2C that will lead to full-time employment contingent upon your satisfactory performance.\nAll Internships are unpaid, the costs to enter each program are listed below.\nProgram Cost: Depending on the duration and the program type: 1 month - $2998, 2-3 months $3698.\nWHAT IS INCLUDED:\nAccommodation\nAirport pickup\nInternship placement\nWelcome package\nVisa assistance\nOrientation and city tour\nBusiness, Cultural Networking Events\nOn-site support\nKaraoke night (KTV)\nCharity Volunteering day\nCertificate upon completion\nGi2C international internship program requires travel to China for 1-3 months. You have to make sure you have enough funds to stay there for at least 3 months and pay for your food, apartment, transportation expenses and our program cost.\nAPPLY NOW\nYou can apply for this role at https://wikijobs.wufoo.com/forms/apply-to-gi2c/\n","url":"https://www.wikijob.co.uk/tracking_click/2020197/field_apply_now_button","salary":"","contract_type":"Temporary","vacancy_type":"Internship","location":"Asia Pacific, China","deadline":""},{"id":"2020194","title":"Marketing Internship In Shanghai, China","logo":"https://www.wikijob.co.uk/sites/default/files/styles/profile_job_post_logo/public/images/company-logos/2011454-1394238256.jpg?itok=ERpS4d_K","company":"","job_role":"Advertising, Marketing &amp; Public Relations","summary":"Gi2C Group","description":"Gi2C Group specializes in connecting China and the global community through professional internships in China's two major cities Beijing and Shanghai.\nWhy suffer in the West when you can prosper in the East as confirmed by the BBC and Forbes magazine.\u2028\u2028\nThrough partnerships with a variety of companies, Gi2C provide students, graduates and young professionals the opportunity to further their personal and professional development in a dynamic international setting. The wealth of skills and knowledge gained from our overseas work experience programs will enhance your CV and provide you the edge you need to land your dream job. \u2028\u2028\nChina is a fascinating place in which to work and live, culturally, linguistically, and socially. Gi2C international internship program runs for 1, 2, and 3 months throughout the year across the most exciting industry sectors in China. This unique international experience allows participants to gain an insight into Chinese business culture, meet industry leaders, and build professional networks.\u2028\u2028\nABOUT THE COMPANY\nThis international corporation is a leading manufacturer and supplier of metals, building materials, and machinery for building projects. Company’s main business belongs to logistics, import and export. From the acquisition of raw materials, packaging and exportation, this company strives to supply only the best quality products by assigning professional experts at every stage of production. In addition to continuous support, the company professional team can plan, coordinate, and oversee the engineering of project regulations, site and terrain.\nSince the establishment of the company in 1980, this company’s professional team has been working diligently to satisfy the needs of an increasing global market demand. With 13 factories throughout China Mainland, Taiwan, and Hong Kong, our advanced production lines efficiently manufacture and supply our products. As the only company with a trading license, this company provides “one-stop shopping” and has been exporting globally since 2000.\nDAILY RESPONSIBILITIES\nPromote the marketing/sales of company products and services on an international basis;\nDevelop sales and marketing strategies;\nDevelop new markets and contribute to optimizing existing markets;\nProvide timely feedback to top management;\nCoordinate in all design work performed online for E-marketing projects;\nPursue business development and negotiate;\nHelp in the process of organizing and attending networking events and activities, presentations;\nApproximately 40% of interns will receive genuine job offers at the conclusion of their internship based on their work habits and job performance.\nPlease note: Chinese language skills are not necessary, fluent English is the only language requirement.\nTHE PROGRAM &amp; ASSOCIATED COSTS\nThis is a 30-90-days China internship program with Gi2C that will lead to full-time employment contingent upon your satisfactory performance.\nAll Internships are unpaid, the costs to enter each program are listed below.\nProgram Cost: Depending on the duration and the program type: 1 month - $2998, 2-3 months $3698.\nWHAT IS INCLUDED:\nAccommodation\nAirport pickup\nInternship placement\nWelcome package\nVisa assistance\nOrientation and city tour\nBusiness, Cultural Networking Events\nOn-site support\nKaraoke night (KTV)\nCharity Volunteering day\nCertificate upon completion\nGi2C international internship program requires travel to China for 1-3 months. You have to make sure you have enough funds to stay there for at least 3 months and pay for your food, apartment, transportation expenses and our program cost.\nAPPLY NOW\nYou can apply for this role at https://wikijobs.wufoo.com/forms/apply-to-gi2c/\n","url":"https://www.wikijob.co.uk/tracking_click/2020194/field_apply_now_button","salary":"","contract_type":"Temporary","vacancy_type":"Internship","location":"Asia Pacific, China","deadline":""},{"id":"2020012","title":"Account Manager (Sales)","logo":"https://www.wikijob.co.uk/sites/default/files/styles/profile_job_post_logo/public/images/company-logos/2011213-1400253438.png?itok=4ehX3ySk","company":"","job_role":"Sales &amp; Recruitment","summary":"WikiJob is an fast growing UK jobs website.","description":"WikiJob is an fast growing UK jobs website. We help great companies recruit great candidates and provide people looking for career information with a brilliant resource. \nRole\nRight now we need someone to help us sell our advertising solutions to a range of incredible clients. We are looking for a confident, articulate and highly motivated individual with previous sales experience, preferably selling recruitment advertising solutions. \nYour education is not important but your attitude, ethics and experience certainly are. \nTeam\nWe're an international team of technology savvy geeks. We work hard because we want to create a great global business and do a great job for our clients. We celebrate success with high fives and black coffee. \nOffice\nWe work from a modern shared open plan work space less than one minute from Farringdon station in London.\nSalary\nWe are offering a basic salary of £16,000 - £25,000 for this role plus a great commission structure that should deliver you an extra £20,000 to £30,000 in your first year alone.\nApply\nTo apply for this role call our current head of sales Ed (Monday to Friday between 11am and 6pm) on 0845 625 9454 to give an articulate and well constructed five minute pitch about why we should hire you. \nIf your pitch is good enough you'll be invited for interview. \n","url":"","salary":"","contract_type":"Permanent","vacancy_type":"Normal Vacancy","location":"United Kingdom","deadline":""},{"id":"2020010","title":"Finance Internship In Beijing, China.","logo":"https://www.wikijob.co.uk/sites/default/files/styles/profile_job_post_logo/public/images/company-logos/2011454-1394238256.jpg?itok=ERpS4d_K","company":"","job_role":"Accounting, Auditing &amp; Finance","summary":"Gi2C","description":"Gi2C Group specializes in connecting China and the global community through professional internships in China's two major cities Beijing and Shanghai.\nWhy suffer in the West when you can prosper in the East as confirmed by the BBC and Forbes magazine.\u2028\u2028\nThrough partnerships with a variety of companies, Gi2C provide students, graduates and young professionals the opportunity to further their personal and professional development in a dynamic international setting. The wealth of skills and knowledge gained from our overseas work experience programs will enhance your CV and provide you the edge you need to land your dream job. \u2028\u2028\nChina is a fascinating place in which to work and live, culturally, linguistically, and socially. Gi2C international internship program runs for 1, 2, and 3 months throughout the year across the most exciting industry sectors in China. This unique international experience allows participants to gain an insight into Chinese business culture, meet industry leaders, and build professional networks.\u2028\u2028\nABOUT THE COMPANY\nWe are a global investment banking company in both the US and China, and focus on M&amp;A and IPOs for NASDAQ and the Shanghai index. We began the company over 12 years ago and have strong network all around China as well as in-depth industry knowledge for sourcing deals and helping international business grow in China. With our database of thousands of key Chinese companies and mergers and acquisitions, we know who’s who in China.\nWe use our data and skill to find new opportunities and generate value for our clients in numerous industries such as:\nConstruction\nConsumer/retail\nEnergy\nNatural resources\nHigh-tech industries\nPrivately-held enterprises and high growth tech companies\nDAILY RESPONSIBILITIES\nHelp our key teams to research and assess acquisition targets and strategies.\nResearch markets outside of China and develop foreign investment projects;\nUndertake project tasks such as financial, market, sensitivity and risk analysis, etc.\nContact overseas companies (by emailing and calling) to understand their interests and learn what they look for in a potential Chinese investor;\nJoining forums, and investment conferences;\nOther ad hoc tasks\nApproximately 40% of interns will receive genuine job offers at the conclusion of their internship based on their work habits and job performance.\nPlease note: Chinese language skills are not necessary, fluent English is the only language requirement.\nTHE PROGRAM &amp; ASSOCIATED COSTS\nThis is a 30-90-days China internship program with Gi2C that will lead to full-time employment contingent upon your satisfactory performance.\nAll Internships are unpaid, the costs to enter each program are listed below.\nProgram Cost: Depending on the duration and the program type: 1 month - $2998, 2-3 months $3698.\nWHAT IS INCLUDED:\nAccommodation\nAirport pickup\nInternship placement\nWelcome package\nVisa assistance\nOrientation and city tour\nBusiness, Cultural Networking Events\nOn-site support\nKaraoke night (KTV)\nCharity Volunteering day\nCertificate upon completion\nGi2C international internship program requires travel to China for 1-3 months. You have to make sure you have enough funds to stay there for at least 3 months and pay for your food, apartment, transportation expenses and our program cost.\nAPPLY NOW\nYou can apply for this role at https://wikijobs.wufoo.com/forms/apply-to-gi2c/\n","url":"https://www.wikijob.co.uk/tracking_click/2020010/field_apply_now_button","salary":"","contract_type":"Temporary","vacancy_type":"Internship","location":"Asia Pacific, China","deadline":""},{"id":"2019522","title":"Higher Apprenticeship opportunities in Consulting - starting Autumn 2014","logo":"https://www.wikijob.co.uk/sites/default/files/styles/profile_job_post_logo/public/images/400x400%20pwc.gif?itok=FzQ6eiqQ","company":"","job_role":"Management Consulting","summary":"If you want to work in business, we’re the best place to start your career.","description":"If you want to work in business, we’re the best place to start your career. As we know that your career is just that; yours. You choose it. You live it. You make it happen. To get the best from it, you need the best opportunities. And opportunities are at the heart of what we do.   \n \nOur offer to you...\n\nTo be part of the world’s leading professional services network and enjoy the benefits that come with that.\n\n\nWork with our teams to support big name clients where you’ll get to grips with the value they’re looking for by getting into the detail.\n\n\nProvide an environment where you’ll be able to explore new opportunities, to help you grow and find your niche.\n\n\nGive you access to be best learning and development around.  Enjoy a structured career programme, involving study towards a professional qualification.\n\n \nEarn while you learn\nMake the most of your good A-Levels, or equivalent academic achievement, by starting work straight away. On one of our Higher Apprenticeships in Consulting you’ll earn a competitive salary while you study towards a professional qualification. You’ll be part of a team, supporting our client or internal projects, which means you’ll be learning on the job, building the in-depth business knowledge you’ll need to progress through our business.\n \nWhat you’d do in Consulting\nManagement Consulting helps some of the world’s most significant organisations become even more effective quickly. We support them to improve the way they operate; accelerate their growth; reduce their costs; manage their risks; develop their talent and change the way they do business. In doing so, we focus on their agendas and the big issues they need to deal with, both today and in the future.\n \nThe Consulting team delivers practical, insightful advice, helping our clients get straight to the heart of the big business issues. Like what can make a brand so successful that customers will pay a premium and keep coming back? We help clients look at things in new ways, identify where they need to focus and make changes where they should.\n \nThe internal teams who support our client work are vital. Among many other things, they make sure our consultants are up to speed with the latest business developments and that we have the systems to support the complex work we do. As part of an internal team you’d see that our clients get the very best from PwC and build your own understanding of how our Consulting business operates.\n \nWhat you’ll gain\nWe’ll support you as you study for a nationally recognised professional qualification – the Certificate in Management Consulting. At the same time, you’ll enjoy plenty of practical, on-the-job training, and your hard work will be rewarded by a Diploma in Consulting practice. You’ll work towards the certificate and diploma over a two year period and both of these things will help you to achieve a third qualification – the overall Higher Apprenticeship Award.\n \nOur events\nYou can find out more information about PwC and our apprenticeship opportunities for school and college leavers by attending one of our Career Information Days, Open Evenings or Virtual Events. We’ll be running events all year at our offices across the UK.\nTo find an event near you, visit our website at www.pwc.com/uk/schools/events\n \nWhat you need to bring to us\nYour intellect, willingness to learn, ability to build relationships, put yourself in others’ shoes, while always making a positive impact with our clients and each other.  \n \n\nA UCAS tariff of at least 280 (or equivalent) \n\n","url":"https://www.wikijob.co.uk/tracking_click/2019522/field_apply_now_button","salary":"","contract_type":"","vacancy_type":"Apprenticeship","location":"United Kingdom","deadline":""},{"id":"2019520","title":"Higher Apprenticeship opportunities in Tax - starting Autumn 2014","logo":"https://www.wikijob.co.uk/sites/default/files/styles/profile_job_post_logo/public/images/400x400%20pwc.gif?itok=FzQ6eiqQ","company":"","job_role":"Accounting, Auditing &amp; Finance","summary":"If you want to work in business, we’re the best place to start your career.","description":"If you want to work in business, we’re the best place to start your career. As we know that your career is just that; yours. You choose it. You live it. You make it happen. To get the best from it, you need the best opportunities. And opportunities are at the heart of what we do.   \n \nOur offer to you...\n\nTo be part of the world’s leading professional services network and enjoy the benefits that come with that.\n\n\nWork with big name clients where you’ll get to grips with the value they’re looking for by getting into the detail.\n\n\nProvide an environment where you’ll be able to explore new opportunities, to help you grow and find your niche.\n\n\nGive you access to be best learning and development around.  Enjoy a structured career programme, involving study towards a professional qualification.\n\n \nEarn while you learn\nMake the most of your good A-Levels, or equivalent academic achievement, by starting work straight away. On one of our Higher Apprenticeships in Tax, you’ll earn a competitive salary while you study towards a professional qualification. You’ll be part of a team, working on client projects, which means you’ll be learning on the job, building the in-depth business knowledge you’ll need to progress through our business.\n \nWhat you’d do in Tax\nTax is all about helping our clients to understand what tax they need to pay and how they can manage this in the most effective and ethical way.\n \nEvery time you buy a packet of crisps, go to the cinema, top up your phone credit or get paid for your part-time job, some of your money gets paid to the government. Well, imagine how many different kinds of tax you’d have to think about if you were employing staff, making millions of pounds in profits or relocating to another country.\n \nMany of these things are everyday business for our clients, so it’s essential that they understand what their tax obligations are and how to manage these effectively. These days tax is headline news, making it more important than ever that our clients can be confident that they’re working within the scope of legislation and show that they’re doing the right thing, while also managing tax effectively for their business and their staff.\nWorking in tax at PwC puts you at the forefront of new developments and legislation, helping our clients – from international businesses to wealthy individuals – plan for the future and manage their tax affairs in the right way.\n\n\t \nWhat you’ll gain\nWe’ll support you as you study for nationally recognised professional qualification with the Association of Taxation Technicians. At the same time, you’ll enjoy plenty of practical, on-the-job training, and your hard work will be rewarded by a Diploma in Tax practice. You’ll work towards the professional qualification and diploma over a two year period and both of these things will help you to achieve a third qualification – the overall Higher Apprenticeship Award.\n \nOur events\nYou can find out more information about PwC and our apprenticeship opportunities for school and college leavers by attending one of our Career Information Days, Open Evenings or Virtual Events. We’ll be running events all year at our offices across the UK.\n \nTo find an event near you, visit our website at www.pwc.com/uk/schools/events\n \nWhat you need to bring to us\nYour intellect, willingness to learn, ability to build relationships, put yourself in others’ shoes, while always making a positive impact with our clients and each other.  \n \n\nA UCAS tariff of at least 240 (or equivalent) \n\n","url":"https://www.wikijob.co.uk/tracking_click/2019520/field_apply_now_button","salary":"","contract_type":"","vacancy_type":"Apprenticeship","location":"United Kingdom","deadline":""},{"id":"2019519","title":"Higher Apprenticeship opportunities in Deals - starting Autumn 2014","logo":"https://www.wikijob.co.uk/sites/default/files/styles/profile_job_post_logo/public/images/400x400%20pwc.gif?itok=FzQ6eiqQ","company":"","job_role":"Accounting, Auditing &amp; Finance","summary":"If you want to work in business, we’re the best place to start your career. As we know that your career is just that; yours. You choose it. You live it. You make it happen.","description":"If you want to work in business, we’re the best place to start your career. As we know that your career is just that; yours. You choose it. You live it. You make it happen. To get the best from it, you need the best opportunities. And opportunities are at the heart of what we do.   \n \nOur offer to you...\n\nTo be part of the world’s leading professional services network and enjoy the benefits that come with that.\n\n\nWork with big name clients where you’ll get to grips with the value they’re looking for by getting into the detail.\n\n\nProvide an environment where you’ll be able to explore new opportunities, to help you grow and find your niche.\n\n\nGive you access to be best learning and development around.  Enjoy a structured career programme, involving study towards a professional qualification.\n\n \nEarn while you learn\nMake the most of your good A-Levels, or equivalent academic achievement, by starting work straight away. On one of our Higher Apprenticeships in Deals, you’ll earn a competitive salary while you study towards a professional qualification. You’ll be part of a team, working on client projects, which means you’ll be learning on the job, building the in-depth business knowledge you’ll need to progress through our business.\n \nWhat you’d do in Deals\nOur teams in Deals guide clients through major deals, organisational changes and strategic decisions. We help them to manage a wide range of particular financial situations, both good and bad. When an airline goes into administration, what happens to the people who’ve bought their flights? Who decides whether they’ll be compensated? Who pays them? How about the staff – who will employ them to deal with the customers ringing up to ask what’s happened?\n \nBusinesses in financial trouble are among some of the clients we help. Our Business Recovery Services teams will go into a failing business and work with the client to turn things around, restructure the business, find someone else to take it on or help to run the business down so it can be closed. You might be surprised to know it can take years to get a business to the point where it can shut its doors, and often there are other solutions which mean it doesn’t need to come to that.\n \nOn the other hand, when our clients are doing really well, they may want to expand by buying another organisation or refocus by selling off part of the business. Our Transactions Services teams help clients through the process of valuing and buying or selling, in much the same way you’d do with a house or car, to make sure the right price is being paid and everything runs smoothly.\nAs a Higher Apprentice in our Deals practice, you'll specialise in either Business Recovery Services or Transaction Services. \n \nWhat you’ll gain\nWe’ll support you as you study for a Certificate in Finance, Accounting and Business. This is a nationally recognised professional qualification with the Institute of Chartered Accountants in England and Wales. At the same time, you’ll enjoy plenty of practical, on-the-job training, and your hard work will be rewarded by a Diploma in Audit practice. You’ll work towards the certificate and diploma over a two year period and both of these things will help you to achieve a third qualification – the overall Higher Apprenticeship Award.\n \nOur events\nYou can find out more information about PwC and our apprenticeship opportunities for school and college leavers by attending one of our Career Information Days, Open Evenings or Virtual Events. We’ll be running events all year at our offices across the UK.\n \nTo find an event near you, visit our website at www.pwc.com/uk/schools/events\n \nWhat you need to bring to us\nYour intellect, willingness to learn, ability to build relationships, put yourself in others’ shoes, while always making a positive impact with our clients and each other.  \n \nA UCAS tariff of at least 280 (or equivalent) \n","url":"https://www.wikijob.co.uk/tracking_click/2019519/field_apply_now_button","salary":"","contract_type":"","vacancy_type":"Apprenticeship","location":"United Kingdom","deadline":""},{"id":"2019499","title":"Work Placement programme - 2014","logo":"https://www.wikijob.co.uk/sites/default/files/styles/profile_job_post_logo/public/images/400x400%20pwc.gif?itok=FzQ6eiqQ","company":"","job_role":"Accounting, Auditing &amp; Finance","summary":"Your career is just that, yours. You choose it. You live it. You make it happen.","description":"Your career is just that, yours. You choose it. You live it. You make it happen. To get the best from it, you need the best opportunities.  That’s why opportunities are at the heart of a career with us. And we’re proud, based on the opportunity we offer, that students have voted us the number one Graduate Employer in The Times Top 100 Graduate Employers survey for the last ten years.\n \nOur offer to you…\n\tExperience what it’s like to be part of the world’s leading professional services network and enjoy the benefits that come with that. You’ll work directly with big name clients where you’ll get to grips with the value they’re looking for by getting into the detail. We’ll provide an environment where you’ll be able to explore new opportunities, to help you grow and find your niche. And we’ll give you access to be best learning and development around. \n \nOur Work Placement Programme\nWork on real projects, learn about our business and get exposure to a prestigious client list. These eleven month placements in Assurance and Deals and six month placements in Strategy are for students who need to complete a placement as part of their degree. You could even sit a selection of professional accounting exams and leave with a graduate job offer. You’ll then come back into a second year role to us meaning your graduate offer will be a year ahead of your peers.\n \nYou'll work alongside graduate trainees and experienced professionals on everyday projects. So you’ll get a good insight into working life at PwC. Our 11-month work placements in Assurance and Deals start in September and are available at offices across the UK. Our 6 month work placements in Strategy start in Spring, Summer and Autumn.\n \nIt doesn't matter what degree course you're studying, but you must have a good academic record and be able to show how you've used your initiative and team-working skills. You should also have thoroughly researched the area of PwC you'd like to join and the qualification you’ll be taking\n \nWhat you’d do\nYou'll do the same work and benefit from the same training as our first-year graduate recruits, contributing to a range of client projects as part of a highly skilled team. The work can be intense at times – but you’ll have plenty of fun, not forgetting competitive rewards, along the way.\n \nYour training and development:\n\tHopefully your placement will be the first step towards a full-time career with us. In some areas, you may even be able to start working towards your professional qualifications during the programme, returning to complete your exams once you've graduated.\n \nWhat you need to bring us\n \n·       To be on course for a 2:1 or above in any degree subject\n·       A UCAS tariff of at least 300 (or equivalent)*\n \n*Or at least 280 for Forensic Technology Solutions\n \nEqually important will be your intellect, willingness to learn, ability to build relationships, put yourself in others’ shoes, while always making a positive impact with our clients and each other. \n \nHow to apply\n \nWe know that the skills and experiences you develop with us, will stay with you throughout your career.  So join us, and we’ll help you reach your full potential. \n","url":"https://www.wikijob.co.uk/tracking_click/2019499/field_apply_now_button","salary":"","contract_type":"","vacancy_type":"Internship","location":"United Kingdom","deadline":""},{"id":"2019498","title":"Talent Academy – 2014","logo":"https://www.wikijob.co.uk/sites/default/files/styles/profile_job_post_logo/public/images/400x400%20pwc.gif?itok=FzQ6eiqQ","company":"","job_role":"Accounting, Auditing &amp; Finance","summary":"Your career is just that; yours. You choose it. You live it. You make it happen.","description":"Your career is just that; yours. You choose it. You live it. You make it happen. To get the best from it, you need the best opportunities.  That’s why opportunities are at the heart of a career with us. And we’re proud, based on the opportunity we offer, that students have voted us the number one Graduate Employer in The Times Top 100 Graduate Employers survey for the last ten years.\n \nOur offer to you…\n\tExperience what it’s like to be part of the world’s leading professional services network and enjoy the benefits that come with that.\n \nWhat you’ll do\nLasting three days, this programme gives your career a jump start.  You’ll spend time in the company of like-minded peers, learn from top professional business advisers and recruiters, and get the kind of preparation for the world of work that’s available only to the most talented and ambitious. The course will be intensive – but you'll be under the watchful eye of experienced business professionals.\n \nWe have a Talent Academy taking place in Northern Ireland, Midlands and London. Please check our website for dates and specific details.\n \nWhat you’ll need\nYour intellect, willingness to learn, ability to build relationships, put yourself in others’ shoes, while always making a positive impact with our clients and each other. \n \nOpen to first year undergraduates (or second years on a four year degree course)\n \n·       At least a 300 UCAS tariff or equivalent\n·       Be on course for a 2:1 in any degree subject\n \nTake the opportunity of a lifetime.\n","url":"https://www.wikijob.co.uk/tracking_click/2019498/field_apply_now_button","salary":"","contract_type":"","vacancy_type":"","location":"United Kingdom","deadline":""},{"id":"2019364","title":"Graduate Store Manager","logo":"https://www.wikijob.co.uk/sites/default/files/styles/profile_job_post_logo/public/images/company-logos/2013908-1382371816.jpg?itok=tdnriRZO","company":"","job_role":"Retail, FMCG &amp; Manufacturing","summary":"Starting at £21k-£32k pa plus benefits \nContributory pension scheme + 30 days holiday pa (including bank holidays)","description":"Starting at £21k-£32k pa plus benefits \nContributory pension scheme + 30 days holiday pa (including bank holidays)\nLOCATIONS NATIONWIDE\nYou never settle for mediocre when there’s a chance to do great things. You want to take a team of like-minded professionals and lead them to impress themselves with their own achievements. We can offer a way to do just that.\nOur Graduate Store Manager programme is the perfect training platform to develop your management and leadership skills in retail, and to discover abilities you never knew you had. With hands-on training in all aspects of retail management alongside experienced Store Managers, the support you receive will be tremendous.\nHolding a minimum 2:1 degree, your talent, ambition, commercial awareness and communication skills should be combined with a passion for retail and customer focus that matches our own.\nJoining us, will see the start of excellent long term career prospects, a competitive starting salary of between £21,000 and £32,000 subject to experience, 30 days’ holiday per annum (including Bank Holidays) and real opportunity for progression.\nWant to know more?\nFor full details on our range of graduate opportunities and for tips and advice on application, please visit www.lidlgraduatecareers.co.uk\nTo apply direct for this role please click APPLY below.\n","url":"https://www.wikijob.co.uk/tracking_click/2019364/field_apply_now_button","salary":"Starting at £21k-£32k pa plus benefits","contract_type":"Permanent","vacancy_type":"Graduate Scheme","location":"United Kingdom","deadline":""},{"id":"2019363","title":"German speaking Graduate Buying Manager","logo":"https://www.wikijob.co.uk/sites/default/files/styles/profile_job_post_logo/public/images/company-logos/2013908-1382371816.jpg?itok=tdnriRZO","company":"","job_role":"Retail, FMCG &amp; Manufacturing, Business &amp; Management","summary":"\nBuying Manager (German Speaking)\n\n£38,000 - £57,500 pa + London weighting + car + benefits - Wimbledon, South London","description":"\nBuying Manager (German Speaking)\n\n£38,000 - £57,500 pa + London weighting + car + benefits - Wimbledon, South London\nAre you made of the right stuff to be a Lidl Buying Manager?\n\nIt's our distinctive range of great-value products that sets us apart, all down to our elite team of buyers. Our Buying department, based in our Head Office in Wimbledon, are responsible for ensuring the best possible range of products are sourced at the most competitive prices for our network of UK stores.\n\nDo you have the instincts and flair to take your place amongst them? You will need to be fluent in English and have conversational level German, hold a 2:1 degree and ideally already possess two to three years of commercial experience. Beyond that it's your inbuilt skills that will give you the edge. Entrepreneurial flair and keen judgement will be the tools of your trade. You simply know when something is right.\n\nWasting no time in making decisions every day… decisions that will impact on the success of each and every Lidl store in the UK, you relish the challenge of negotiation, especially at high level. Backed by superb training and support, your self-confidence will grow even further. Your powerful ambition could lead you to become one of the next generation of commercial decision-makers. Your development will begin with familiarisation with our full range of products in store, trained by some of the best store management in the country. This will be followed by a comprehensive induction to our Regional Distribution Centres to ensure you gain an understanding of the operational side of the business before embarking upon your commercial path into Buying.\n\nThen it's time to join our Buying Team in Head Office, where you will shadow a Senior Buying Manager to learn, implement and develop those special skills. This is the point where all your personal qualities come into play and the spirit of teamwork will kick in.\n\nYour training will cover all aspects of product category management… range reviews, retail price architecture, new and existing product development, packaging design and quality control. Day to day you will develop the essential skills to manage supplier relationships, source new suppliers and negotiate contracts.\n\nYour Buying experience will be supported by a fully expensed training secondment to our International Head Office in Germany for a true insight into the heart of buying. Working in harmony with your German colleagues, you will learn and develop an international perspective of the food supply chain and be even better prepared for your role back in the UK.\n\nYou will need to be fluent in English and have conversational level German and thrive in a fast paced office environment.  You should be dynamic and highly motivated with real entrepreneurial flair and keen to be involved in high level negotiations.  Ultimately, you will take decisions that impact directly on the success of each and every Lidl store in the UK.\n\nYou will be able to use your judgement to make quick decisions and as an effective communicator who leads from the front, you will be easily adaptable to the ever-changing environment.\n\nWith a minimum of a 2:1 degree and ideally with two to three years commercial experience, you should also have a full driving licence.\n\nStarting on £35,000 pa, with the potential to earn up to £57,500 pa, plus an additional London weighting allowance, you will be given early responsibility, real career development and potential progression into senior management.  You can also expect 35 days' holiday pa (including Bank Holidays) and a contributory pension scheme. Employee benefits also include access to corporate discounts on a range of products and services (including holidays, home and garden products, leisure activities and more).\n\n","url":"https://www.wikijob.co.uk/tracking_click/2019363/field_apply_now_button","salary":"Starting at £38k pa with potential to earn up to £57.5k pa","contract_type":"Permanent","vacancy_type":"Normal Vacancy","location":"United Kingdom","deadline":""},{"id":"2019362","title":"Graduate Area Manager","logo":"https://www.wikijob.co.uk/sites/default/files/styles/profile_job_post_logo/public/images/company-logos/2013908-1382371816.jpg?itok=tdnriRZO","company":"","job_role":"Retail, FMCG &amp; Manufacturing, Business &amp; Management","summary":"Starting on £35k with the potential to earn up to £55k pa \nFully expensed Company car, contributory pension scheme, Private Medical Cover","description":"Starting on £35k with the potential to earn up to £55k pa \nFully expensed Company car, contributory pension scheme, Private Medical Cover\nLOCATIONS NATIONWIDE\nFinal year already… time to look ahead. With your confidence, natural leadership and team spirit you won’t want to waste that hard-earned 2:1 degree on anywhere but the best. You want a career with people who are building on success, not just boasting about it, and like you, never settle for mediocre.\nAt Lidl we can set you on a steep learning curve in our fast-track programme into Area Management, so you can make an impact on our retail business from day one. It covers all aspects of retail management making full use of your decision making, communication and organisational skills. Structured hands-on training with carefully planned modules will stretch you and mould your talents.\nChannel your ambition and commercial awareness into a career with outstanding prospects. Joining us, will see you starting on an outstanding salary of £35,000, 35 days’ holiday per annum (including Bank Holidays) private medical care, not to mention your very own Audi company car.\nWant to know more?\nFor full details on our range of graduate opportunities and for tips and advice on application, please visit www.lidlgraduatecareers.co.uk\nTo apply direct for this role please click APPLY below.\n","url":"https://www.wikijob.co.uk/tracking_click/2019362/field_apply_now_button","salary":"Starting on £35k with the potential to earn up to £55k pa","contract_type":"","vacancy_type":"Graduate Scheme","location":"United Kingdom","deadline":""},{"id":"2019215","title":"Test &amp; Integration Engineer (IVVQ Engineer)","logo":"https://www.wikijob.co.uk/sites/default/files/styles/profile_job_post_logo/public/images/profiles/LARGE_Thaleslogo.jpg?itok=XgUiPiMO","company":"","job_role":"IT &amp; Technology, Engineering","summary":"Pondering the positively perplexing sets our pulses racing at Thales. ","description":"Pondering the positively perplexing sets our pulses racing at Thales. \nWhere others lose heart and hope, we take things to a whole new level and exceed expectations. If you’re exceptionally enthused about tackling the bafflingly bewildering, the impossibly intractable and the quirkiest quandaries, we’d like you to create superlative solutions to engineering enigmas.\nYou might not realise it but our work touches all our lives, every single day. From BACS, the secure network communications system that underpins 3.7 billion chip and PIN transactions ever year, to in-flight entertainment systems for passenger planes and state-of-the-art equipment for military aircraft, the scope and scale of our problem-solving abilities know no bounds.\nAs a Test &amp; Integration Engineer, you’ll play a big role in making sure our software modules work as they should. This could mean anything from preparing and executing test scripts, to recording and managing defects.\nYou’ll also estimate how long projects take, help out with feasibility and evaluation activities and stay on top of the latest technical and market trends. In short, you’ll ensure our software is as good as we say it is. We’re looking for people who understand programming, such as C, C++ or Java, and who know how to use scripting languages such as Python.\nIf you can analyse complex technical problems and come up with innovative, yet practical solutions, you’ll fit right in. And if you have a minimum 2.1 in a relevant subject, love being part of a team and can manage your workload when the pressure’s on, you’ll have everything you need to succeed here.\n","url":"https://www.wikijob.co.uk/tracking_click/2019215/field_apply_now_button","salary":"£27,000 + £2,000 welcome bonus","contract_type":"Permanent","vacancy_type":"Graduate Scheme","location":"United Kingdom","deadline":""},{"id":"2019214","title":"R &amp; D Engineer","logo":"https://www.wikijob.co.uk/sites/default/files/styles/profile_job_post_logo/public/images/profiles/LARGE_Thaleslogo.jpg?itok=XgUiPiMO","company":"","job_role":"Engineering, IT &amp; Technology","summary":"Pondering the positively perplexing sets our pulses racing at Thales. Where others lose heart and hope, we take things to a whole new level and exceed expectations.","description":"Pondering the positively perplexing sets our pulses racing at Thales. Where others lose heart and hope, we take things to a whole new level and exceed expectations. If you’re exceptionally enthused about tackling the bafflingly bewildering, the impossibly intractable and the quirkiest quandaries, we’d like you to create superlative solutions to engineering enigmas.\nYou might not realise it but our work touches all our lives, every single day. From BACS, the secure network communications system that underpins 3.7 billion chip and PIN transactions ever year, to in-flight entertainment systems for passenger planes and state-of-the-art equipment for military aircraft, the scope and scale of our problem-solving abilities know no bounds.\nThe R&amp;D team is our innovation pipeline. A diverse network of scientists and engineers, they provide us with the ideas we need to develop the next generation of cutting-edge products. Join this programme, and you’ll spend two years rotating between these various research teams.\nAs well as gaining a broad range of technical experience, you’ll get to discover where your talents and interests lie — offering the possibility of joining one of these specialist teams after your Graduate Development Programme role is complete.\nOur work here is incredibly varied. We have teams working on algorithms, mathematical problem solving, software development, digital electronics, radio frequency and mixed signal design to name just a few. So, if you have at least a 2.1 in electronic engineering, computer science, software, maths or physics, there could be a place for you here. Equally important, you’ll also need to be a strong team player and a creative problem solver.\n","url":"https://www.wikijob.co.uk/tracking_click/2019214/field_apply_now_button","salary":"£27,000 + £2,000 welcome bonus","contract_type":"Permanent","vacancy_type":"Graduate Scheme","location":"United Kingdom","deadline":""},{"id":"2019213","title":"Software Engineer","logo":"https://www.wikijob.co.uk/sites/default/files/styles/profile_job_post_logo/public/images/profiles/LARGE_Thaleslogo.jpg?itok=XgUiPiMO","company":"","job_role":"IT &amp; Technology, Engineering","summary":"Pondering the positively perplexing sets our pulses racing at Thales.","description":"Pondering the positively perplexing sets our pulses racing at Thales.\nWhere others lose heart and hope, we take things to a whole new level and exceed expectations. If you’re exceptionally enthused about tackling the bafflingly bewildering, the impossibly intractable and the quirkiest quandaries, we’d like you to create superlative solutions to engineering enigmas.\nYou might not realise it but our work touches all our lives, every single day. From BACS, the secure network communications system that underpins 3.7 billion chip and PIN transactions ever year, to in-flight entertainment systems for passenger planes and state-of-the-art equipment for military aircraft, the scope and scale of our problem-solving abilities know no bounds. In this key role, you’ll develop the software that underpins our cutting-edge solutions.\nIt’s a remit that could see you working on large-scale software systems, embedded applications or complex digital signal processing technologies. Working as part of a team, you’ll also gain exposure to the whole software lifecycle — from the scoping of initial requirements, to design and development all the way through to testing, integration and validation. That’s why we’re looking for people with strong team working skills as well as technical ability.\nIn terms of your degree, we’ll be looking for at least a 2.1 in a Software Engineering, Electronic Engineering, Computer Science or another relevant subject. You’ll certainly need to show that you know how to develop software applications using the latest tools – and that you possess sound knowledge of programming languages such as C/C++ and Java. We’ll also be looking for evidence of your self-motivation and creative problem-solving skills.\n","url":"https://www.wikijob.co.uk/tracking_click/2019213/field_apply_now_button","salary":"£27,000 + £2,000 welcome bonus","contract_type":"Permanent","vacancy_type":"Graduate Scheme","location":"United Kingdom","deadline":""},{"id":"2019212","title":"Systems Engineer","logo":"https://www.wikijob.co.uk/sites/default/files/styles/profile_job_post_logo/public/images/profiles/LARGE_Thaleslogo.jpg?itok=XgUiPiMO","company":"","job_role":"Engineering","summary":"Pondering the positively perplexing sets our pulses racing at Thales. Where others lose heart and hope, we take things to a whole new level and exceed expectations.","description":"Pondering the positively perplexing sets our pulses racing at Thales. Where others lose heart and hope, we take things to a whole new level and exceed expectations. If you’re exceptionally enthused about tackling the bafflingly bewildering, the impossibly intractable and the quirkiest quandaries, we’d like you to create superlative solutions to engineering enigmas.\nYou might not realise it but our work touches all our lives, every single day. From BACS, the secure network communications system that underpins 3.7 billion chip and PIN transactions ever year, to in-flight entertainment systems for passenger planes and state-of-the-art equipment for military aircraft, the scope and scale of our problem-solving abilities know no bounds.\nAs a Systems Engineer, you’ll help us create market leading solutions. It’s a challenge that could see you supporting the development of electronic hardware, firmware, mechanical assemblies, software or networked computing systems. Working as part of a multidisciplinary team, you’ll also gain exposure to the entire project lifecycle — from initial requirements to the creation of prototypes, to the integration and final testing of systems into platforms.\nThat’s why we’re looking for people with strong team working skills as well as technical ability. In terms of your academics, we’ll be seeking a 2.1 hons degree in a relevant engineering or numerate discipline, such as Systems Engineering, Computer Science, Software Engineering, Electrical Engineering, Maths or Physics. But more than this, we’ll want to see evidence of your self-motivation, your ability to see innovative solutions to problems, and your enthusiasm to drive them to a successful conclusion.\n","url":"https://www.wikijob.co.uk/tracking_click/2019212/field_apply_now_button","salary":"£27,000 + £2,000 welcome bonus","contract_type":"Permanent","vacancy_type":"Graduate Scheme","location":"United Kingdom","deadline":""},{"id":"2019211","title":"Hardware Engineer","logo":"https://www.wikijob.co.uk/sites/default/files/styles/profile_job_post_logo/public/images/profiles/LARGE_Thaleslogo.jpg?itok=XgUiPiMO","company":"","job_role":"Engineering","summary":"Pondering the positively perplexing sets our pulses racing at Thales. Where others lose heart and hope, we take things to a whole new level and exceed expectations.","description":"Pondering the positively perplexing sets our pulses racing at Thales. Where others lose heart and hope, we take things to a whole new level and exceed expectations. If you’re exceptionally enthused about tackling the bafflingly bewildering, the impossibly intractable and the quirkiest quandaries, we’d like you to create superlative solutions to engineering enigmas.\nYou might not realise it but our work touches all our lives, every single day. From BACS, the secure network communications system that underpins 3.7 billion chip and PIN transactions ever year, to in-flight entertainment systems for passenger planes and state-of-the-art equipment for military aircraft, the scope and scale of our problem-solving abilities know no bounds.\nAs a Hardware Engineer, you’ll have the opportunity to work on some of the most exciting technology projects around. You’ll design and develop hardware systems as part of a multidisciplinary team. From capturing initials requirements and presenting design concepts to simulation testing and the validation of final hardware components, you can expect to play a key role in the entire project lifecycle.\nThat’s why we’re looking for people with strong team working skills as well as technical ability. In terms of your academics, we’ll be seeking either a 2.1 in electronic engineering or a 2.2 in Mechanical engineering or a related discipline. But more than this, we’ll want to see evidence of your self-motivation, your ability to see innovative solutions to problems, and your enthusiasm to drive them to a successful conclusion.\n","url":"https://www.wikijob.co.uk/tracking_click/2019211/field_apply_now_button","salary":"£27,000 + £2,000 welcome bonus","contract_type":"Permanent","vacancy_type":"Graduate Scheme","location":"United Kingdom","deadline":""},{"id":"2019210","title":"Electronics Engineer","logo":"https://www.wikijob.co.uk/sites/default/files/styles/profile_job_post_logo/public/images/profiles/LARGE_Thaleslogo.jpg?itok=XgUiPiMO","company":"","job_role":"Engineering","summary":"Pondering the positively perplexing sets our pulses racing at Thales. Where others lose heart and hope, we take things to a whole new level and exceed expectations.","description":"Pondering the positively perplexing sets our pulses racing at Thales. Where others lose heart and hope, we take things to a whole new level and exceed expectations. If you’re exceptionally enthused about tackling the bafflingly bewildering, the impossibly intractable and the quirkiest quandaries, we’d like you to create superlative solutions to engineering enigmas.\nYou might not realise it but our work touches all our lives, every single day. From BACS, the secure network communications system that underpins 3.7 billion chip and PIN transactions ever year, to in-flight entertainment systems for passenger planes and state-of-the-art equipment for military aircraft, the scope and scale of our problem-solving abilities know no bounds.\nAs an Electronics Engineer, you’ll have the opportunity to work on some of the most exciting technology projects around. You’ll design, develop and test electronics circuits and systems as part of a multidisciplinary team. As well as creating designs, you’ll predict electronic circuit performance through modelling and calculation as well as build prototype hardware when required. More generally, you’ll collaborate with other engineers to ensure all electronic requirements are incorporated into product designs.\nIt’s a challenge for someone with a naturally inquisitive mind and strong problem-solving skills. In terms of your degree, we’ll be looking for at least a 2:1 in Electronic Engineering or a related discipline. We’ll also be looking for a range of personal qualities too. You’ll need to self-motivated, enthusiastic and have a can-do approach to your work. Given that you’ll be working predominantly within a multi-disciplinary environment, strong people skills are absolutely critical.\n","url":"https://www.wikijob.co.uk/tracking_click/2019210/field_apply_now_button","salary":" £27,000 + £2,000 welcome bonus","contract_type":"Permanent","vacancy_type":"Graduate Scheme","location":"United Kingdom","deadline":""},{"id":"2019209","title":"Cyber Security Practitioner ","logo":"https://www.wikijob.co.uk/sites/default/files/styles/profile_job_post_logo/public/images/profiles/LARGE_Thaleslogo.jpg?itok=XgUiPiMO","company":"","job_role":"IT &amp; Technology","summary":"Pondering the positively perplexing sets our pulses racing at Thales. Where others lose heart and hope, we take things to a whole new level and exceed expectations.","description":"Pondering the positively perplexing sets our pulses racing at Thales. Where others lose heart and hope, we take things to a whole new level and exceed expectations. If you’re exceptionally enthused about tackling the bafflingly bewildering, the impossibly intractable and the quirkiest quandaries, we’d like you to create superlative solutions to engineering enigmas.\nYou might not realise it but our work touches all our lives, every single day. From BACS, the secure network communications system that underpins 3.7 billion chip and PIN transactions ever year, to in-flight entertainment systems for passenger planes and state-of-the-art equipment for military aircraft, the scope and scale of our problem-solving abilities know no bounds.\nAs a Cyber Security Practitioner, you’ll help protect our clients’ IT systems from a whole range of threats. From performing security risk assessments to designing new solutions, you’ll ensure their systems are robust enough to withstand any cyber attack. It’s a role that will see you analysing, designing, testing and producing documentation — but the challenges won’t just be technical.\nYou’ll need to successfully engage with our clients too. As well as listening to and understanding their needs, you’ll also need to explain complex concepts with real clarity. That’s why we’re looking for people with great communication skills as well as analytical ability. In terms of your degree, you’ll need at least a 2.1 in IT or Computer Security. However, if you can demonstrate an interest and aptitude in this area, we’ll also consider Systems or Software Engineering. A keen problem solver, you should also have some knowledge already of areas such as IT security fundamentals (VLAN, IPSec, HTTP and SSP).\n","url":"https://www.wikijob.co.uk/tracking_click/2019209/field_apply_now_button","salary":"£27,000 + £2,000 welcome bonus","contract_type":"Permanent","vacancy_type":"Graduate Scheme","location":"United Kingdom","deadline":""},{"id":"2019205","title":"Engineering Internship Programme","logo":"https://www.wikijob.co.uk/sites/default/files/styles/profile_job_post_logo/public/images/profiles/LARGE_Thaleslogo.jpg?itok=XgUiPiMO","company":"","job_role":"Engineering","summary":"Deciphering the dazzlingly difficult is our holy grail at Thales. Where others lose heart and hope, we take things to a whole new level and exceed expectations.","description":"Deciphering the dazzlingly difficult is our holy grail at Thales. Where others lose heart and hope, we take things to a whole new level and exceed expectations. If you’re exceptionally enthused about tackling the bafflingly bewildering, the impossibly intractable and the quirkiest quandaries, you could find out more about the engineering enigmas we tackle on a daily basis.\nYou might not realise it but our work touches all our lives, every single day. From BACS, the secure network communications system that underpins 3.7 billion chip and PIN transactions ever year, to in-flight entertainment systems for passenger planes and state-of-the-art equipment for military aircraft, the scope and scale of our problem-solving abilities know no bounds.\nOur internship will give you an insight into what life as a Thales engineer is really like. You’ll spend between three and twelve months at one of our UK locations, working alongside expert engineers and gaining hands-on experience on live projects. Perform well and impress us, and you won’t just acquire a great salary and valuable work experience. You’ll also get fast-tracked through the initial stages of our graduate selection process if you decide you’d like to join us on a more permanent basis.\nThis programme is open to students expecting a 2:1 or above in their degree – you don’t need to have your grades yet in order to apply though.\n","url":"https://www.wikijob.co.uk/tracking_click/2019205/field_apply_now_button","salary":"£17,000","contract_type":"Temporary","vacancy_type":"Internship","location":"United Kingdom","deadline":""},{"id":"2019016","title":"Summer Internship","logo":"https://www.wikijob.co.uk/sites/default/files/styles/profile_job_post_logo/public/images/profiles/bdo-logo.jpg?itok=p8gQ4SAg","company":"","job_role":"Accounting, Auditing &amp; Finance","summary":"Our Summer Internship programme is recognised as the 3rd best placement progr","description":"Our Summer Internship programme is recognised as the 3rd best placement programme in the country and provides high-calibre undergraduates in their penultimate year with an opportunity to experience life and work at BDO in a stream and location of their choice. The internship also provides you with the opportunity to secure a place on our graduate programme.\n \nYou will be given a useful insight into our business and will be given a real taste of life at the heart of the firm, working on interesting projects alongside graduate trainees and experienced professionals.\nOur internship programme lasts six weeks – running from mid-July to late August each year – and provides you with an opportunity to experience real client work while developing employability skills including team work, communication and commercial awareness.\n \nWork experience locations: Nationwide \n \nClosing date details: Open/ongoing \n \nWork experience start date: 07/07/2014\n \nLength/duration of opportunity: 6 Weeks \n \nSalary information: Fully paid, Competitive \n \nNumber of vacancies: 50\n \n","url":"https://www.wikijob.co.uk/tracking_click/2019016/field_apply_now_button","salary":"","contract_type":"","vacancy_type":"","location":"United Kingdom","deadline":""},{"id":"2019015","title":"School Leavers","logo":"https://www.wikijob.co.uk/sites/default/files/styles/profile_job_post_logo/public/images/profiles/bdo-logo.jpg?itok=p8gQ4SAg","company":"","job_role":"Accounting, Auditing &amp; Finance","summary":"In the current climate and with the recent increase in university tuition fees BDO is acknowledging that there are an increasing number of talented, ambitious A-Level students who are unsure whet","description":"In the current climate and with the recent increase in university tuition fees BDO is acknowledging that there are an increasing number of talented, ambitious A-Level students who are unsure whether a typical university education is the right path for them.\n \nInstead, why not consider an opportunity with BDO on our School Leaver Programme. Not only will you be able to gain a prestigious professional qualification and have a permanent salaried job without the expense of funding a university degree, you’ll be gaining commercial work experience alongside leading professionals, working on real business projects.\n \nWe are looking for people with a minimum of 280 UCAS points (or equivalent) in any subjects, along with a minimum of grade B in GCSE Maths and English. On top of this we want individuals who can think for themselves, appreciate and respect people whoever they are, build relationships and take personal responsibility for results.\n \nFor a full list of current vacancies please check our website by clicking below.\n \nWork locations: \nBirmingham, Bristol, Cambridge, Cardiff, Chelmsford, Edinburgh, Gatwick, Glasgow, Great Yarmouth, Guernsey, Guildford, Ipswich, Leeds, Leicester, Lincoln, Liverpool, London, Manchester, Norwich, Nottingham, Reading, Sheffield and Southampton.\n \nJoin us and you will receive: \nCompetitive salary which varies regionally\nGym Membership/Subsidy\nLife Assurance\nPension Scheme (with company contribution)\nSeason Ticket Loan\n25 Days’ Holiday\nFull support for the CFAB qualification and then the ACA.\n \nApplication dates: Ongoing application \n \n \n","url":"https://www.wikijob.co.uk/tracking_click/2019015/field_apply_now_button","salary":"","contract_type":"","vacancy_type":"","location":"United Kingdom","deadline":""},{"id":"2019014","title":"Graduate opportunities","logo":"https://www.wikijob.co.uk/sites/default/files/styles/profile_job_post_logo/public/images/profiles/bdo-logo.jpg?itok=p8gQ4SAg","company":"","job_role":"Accounting, Auditing &amp; Finance","summary":"Graduate careers in accountancy","description":"Graduate careers in accountancy\nWe’re looking for graduates who don’t fit the conventional accountancy mould. Talented people with the imagination and initiative to make a real difference  –  to be the difference that matters so much to our clients. We don’t want clones. Our people are as diverse as our clients. We want individuals who can think for themselves, appreciate and respect people whoever they are, build relationships and take personal responsibility for results.\n \nOur training is as exceptional – and individual – as the people we recruit. Most study for the ACA, but we also offer routes to other professional qualifications. Training is tailored to their needs and centred on first-hand experience. That’s why they get such excellent results. We offer opportunities in a range of exciting areas from tax to forensic services, with the chance to take real responsibility on client projects alongside partners and colleagues.\n \nJobs available: \nAudit, Tax, Business Restructuring, Forensic Accounting, Tax Investigations, Corporate Finance, Risk Advisory Services &amp; Technology Risk Advisory Services.\n \nDegree disciplines/degree class required: \nAny degree discipline Minimum 2.1\n \nNumber of graduate vacancies per year:  \n280\n \nPlacements/internships available:  \n6 week structured summer internship program\n2 week A Level summer school\nInsight days across the country\n \nWork locations: \nBirmingham, Bristol, Cambridge, Cardiff, Chelmsford, Edinburgh, Gatwick, Glasgow, Great Yarmouth, Guernsey, Guildford, Ipswich, Leeds, Leicester, Lincoln, Liverpool, London, Manchester, Norwich, Nottingham, Reading, Sheffield and Southampton.\n \nSalary and benefits: \nCompetitive salary which varies regionally. Full support for your professional qualifications, graduate loans, discounted gym membership and a flexible benefits package including options for discounted bikes, private healthcare and additional holiday\n \nDeadline: \nNo official national deadlines, however early applications are encouraged.\n \nApply online by clicking below.\n \n \n","url":"https://www.wikijob.co.uk/tracking_click/2019014/field_apply_now_button","salary":"","contract_type":"","vacancy_type":"Graduate Scheme","location":"United Kingdom","deadline":""},{"id":"2018974","title":"BrightStart school leaver programme","logo":"https://www.wikijob.co.uk/sites/default/files/styles/profile_job_post_logo/public/images/profiles/deloitte-logo-2011.jpg?itok=VsKkC_cV","company":"","job_role":"","summary":"About BrightStart","description":"About BrightStart\nOur Bright Start scheme for school leavers is a structured five-year programme that will give you all the exposure, experience, training and support you need to forge ahead in the world of business. After only a few years, you’ll be in a position to explore all the fantastic opportunities within the world’s leading professional services firm.\n \nCareer options\nYou can join Audit, Risk Consulting, Tax, Consulting or Corporate Finance. \n \nIn Audit or Corporate Finance, you’ll take on increasing responsibility, start to build key relationships with clients and make progress with your studies as well as your work. By the end of your fifth year, you could be playing a lead role on client work, and will have taken your final exams.\n \nIn Tax, you’ll develop the perfect mix of business, consulting, finance and legal skills, working with a variety of clients and gaining broad and in-depth knowledge along the way – not to mention valuable professional qualifications.\n \nIn Risk Consulting, you could be using cutting-edge technology to help clients manage risks, helping them better analyse and control their data or working with them to improve the security of their business and information.\n \nIn Consulting you will be helping organisations and their people to change and adapt in order to be successful. You will draw on skills for organisation design, Leadership development, Talent strategies, HR effectiveness, Programme leadership and Strategic change.\n \n \nWhat we’re looking for\nAs well as strong academics and an interest in business and finance, we’re looking for people who will work well in teams and can thrive in our fast-paced environment. \n \nQualifications needed\nGCSE (or equivalent) Maths at grade B or above and English Language at grade C or above\nPredicted 300 UCAS points from A-levels (or equivalent) excluding General Studies for Audit, Risk Consulting and Tax\nPredicted 320 UCAS points from three A-levels (or equivalent) excluding General Studies for Corporate Finance and Consulting\nApplication process\nOur application process has been carefully designed to be as thorough and fair as possible. It’s your chance to tell us all about yourself, and our chance to see if you’ve got the potential to succeed here. It covers five stages:\n \nAn online application form, which includes a number of different sections, such as education and career motivation. \nAn online numerical reasoning test.\nAn email-based assessment exercise online.\nFirst interview at the office you’re applying to.\nFinal interview, which consists of a commercial awareness presentation and an interview with a senior person from the area you’re applying to join.\nFind out more by clicking below. \n \n","url":"https://www.wikijob.co.uk/tracking_click/2018974/field_apply_now_button","salary":"","contract_type":"","vacancy_type":"","location":"United Kingdom","deadline":""},{"id":"2018973","title":"Industrial Placement opportunities in consulting","logo":"https://www.wikijob.co.uk/sites/default/files/styles/profile_job_post_logo/public/images/profiles/deloitte-logo-2011.jpg?itok=VsKkC_cV","company":"","job_role":"Accounting, Auditing &amp; Finance","summary":"The latest Times Top 100 Graduate Careers survey – an annual piece of research involving some 18,000 final year students at institutions across the UK – has named Deloitte as the number one desti","description":"The latest Times Top 100 Graduate Careers survey – an annual piece of research involving some 18,000 final year students at institutions across the UK – has named Deloitte as the number one destination of choice for graduates looking for a career in consulting. Consulting is not just one of our service lines, but a way of working with clients. It’s an exercise in challenging ourselves and our clients to be better. By working hard to truly understand their businesses, and by harnessing that intelligence to provide proactive and bespoke advice and support, we can deepen relationships, demonstrate the power of our innovative thinking and deliver real and lasting value. That’s a Deloitte difference.\nExposure to complex businesses. Insights into major sectors. Experience of whole industries. This is what you can expect when you join the Industrial Placement programme at Deloitte, the world’s largest professional services firm.\n \nWhat a placement at Deloitte offers\nOur Industrial Placements give you the option of working in many of our recruiting offices across the UK and in a range of different service lines: \nAudit\nTax\nCorporate Finance - Forensic Technology\nRisk Consulting\n \nChoose any of these placements and you’ll enjoy the scope to tackle a wide range of assignments with high-profile clients across different sectors. You’ll benefit from world-class training alongside our graduate intake, before gaining invaluable experience in the role of a 1st year graduate working in the area you choose to apply to. \n \nIf you decide to apply for a graduate role at the end of your placement, you could go back to university with a job already guaranteed – and you will have a head start when you return to Deloitte. \n \nYou can expect a competitive salary and benefits package, together with a laptop, smart phone and charge card where appropriate.\n \nWho we’re looking for\nWe accept undergraduates from any degree discipline. However, for the majority of our vacancies you will need the following (or equivalent if not taken in the UK): \na 2:1 gained in the first year of your degree; \n24/300 to 26/320 UCAS tariff points;\nGCSE Maths grade B; \nGCSE English grade C;\na real interest in business and excellent interpersonal skills.\nTo find out more information and to apply online, visit our website. We operate on a first come, first served basis, and places are limited so we’d encourage you to apply as early as possible.\n \nIt’s your future. How far will you take it?\n \n","url":"https://www.wikijob.co.uk/tracking_click/2018973/field_apply_now_button","salary":"","contract_type":"","vacancy_type":"","location":"United Kingdom","deadline":""},{"id":"2018972","title":"Graduate opportunities in consulting","logo":"https://www.wikijob.co.uk/sites/default/files/styles/profile_job_post_logo/public/images/profiles/deloitte-logo-2011.jpg?itok=VsKkC_cV","company":"","job_role":"Accounting, Auditing &amp; Finance, IT &amp; Technology","summary":"The latest Times Top 100 Graduate Careers survey – an annual piece of research involving some 18,000 final year students at institutions across the UK – has named Deloitte as the number one desti","description":"The latest Times Top 100 Graduate Careers survey – an annual piece of research involving some 18,000 final year students at institutions across the UK – has named Deloitte as the number one destination of choice for graduates looking for a career in consulting. Consulting is not just one of our service lines, but a way of working with clients. It’s an exercise in challenging ourselves and our clients to be better. By working hard to truly understand their businesses, and by harnessing that intelligence to provide proactive and bespoke advice and support, we can deepen relationships, demonstrate the power of our innovative thinking and deliver real and lasting value. That’s a Deloitte difference.\nHelping the biggest businesses make some of their biggest decisions. Tackling the most complex operations. Leading the leading-edge. Developing expertise not just in one company, but in entire industries. This is what it means to be a professional at Deloitte, the world’s largest professional services firm. We offer five distinct entry routes:\n \nAudit\nTax\nCorporate Finance\nTechnology\n \nChoose any of these programmes and you’ll enjoy an unparalleled start to your career in business, tackling a wide range of assignments with high-profile clients across different sectors; receiving coaching from senior colleagues; benefiting from world-class training and development; and working towards professional qualifications. What’s more, you can expect excellent rewards and plenty of recognition for your hard work too.\n \nWho we’re looking for\nWe accept graduates from any degree discipline. However, for the majority of our vacancies you will need the following (or equivalent if not taken in the UK): \na 2:1 in your first degree; \n300 UCAS points (320 for Consulting and Corporate Finance); \nGCSE Maths grade B or above; \nEnglish grade C or above;\na real interest in business and excellent interpersonal skills.\n \nTo find out more information and to apply online, visit our website. We operate on a first come, first served basis, and places are limited so we’d encourage you to apply as early as possible.\n \nIt’s your future. How far will you take it?\n \n","url":"https://www.wikijob.co.uk/tracking_click/2018972/field_apply_now_button","salary":"","contract_type":"","vacancy_type":"","location":"United Kingdom","deadline":""},{"id":"2018839","title":"Consulting Internship","logo":"https://www.wikijob.co.uk/sites/default/files/styles/profile_job_post_logo/public/images/profiles/Logo_Oliver-Wyman_dian-hasan-branding_US-5_0.png?itok=id5VUk7x","company":"","job_role":"Management Consulting","summary":"About Us","description":"About Us\nOliver Wyman is a global leader in management consulting. With offices in 50+ cities across 25 countries, Oliver Wyman combines deep industry knowledge with specialised expertise in strategy, operations, risk management, and organisation transformation. Our 3,000 professionals help clients optimise their business, improve their operations and risk profile, and accelerate their organisational performance to seize the most attractive opportunities.\n \nOliver Wyman’s thought leadership is evident in our agenda-setting books, white papers, research reports, and articles in the business press. To that end, the Oliver Wyman Institute connects the firm with prominent leaders of the academic community for joint research on frontier issues. The firm's Global Risk Centre analyses the increasingly complex risks that are reshaping industries, governments, and societies. \n \nThe firm’s capabilities and intellectual capital are enhanced by our deep industry expertise, geographic range, analytical rigour, and hands-on, collaborative approach. Our professionals see what others don't, challenge conventional thinking, and consistently deliver innovative, customised solutions.  We also work side by side with senior executives to accelerate execution through a blend of behavioural and management approaches. As a result, we have a tangible impact on clients’ top and bottom lines.  Oliver Wyman is a wholly owned subsidiary of Marsh &amp; McLennan Companies (NYSE: MMC). For more information, visit our website and follow Oliver Wyman on Twitter @OliverWyman.\n \nWhy Join Us? \nOur work is marked by exceptional impact for our clients. By consistently producing results, we have earned a reputation for quality work and attractive career opportunities.\nA growing, entrepreneurial firm with exceptional economics; global reach with revenues exceeding $1.5 billion in 2012\n \nMore client exposure on Day One and significant international opportunities\nA meritocratic ecosystem that provides for rapid advancement to Partner without an MBA\nSpecialisation at your own pace, with an opportunity for breadth and depth\nAttractive compensation for performance  \nA company that is committed to work-life balance and having fun\nExtensive opportunities to allow career flexibility including: corporate externships, 10/11-month work years or sabbaticals, non-profit fellowships, and international staffing opportunities \n \nThe Role\nJoin our internship program where you will work alongside some of the industry’s leading experts as a full team member with real responsibility.\n \n10-week summer internships\nHigh-impact client engagements\nTraining, coaching and mentoring\nInternational project opportunities\n \nQualifications\nWe look for initiative, intuition and creativity with a strong background in problem solving and analytics.   We do not require a specific academic major or industry experience. One of the best things we can do for our clients and ourselves is to recruit a diverse group of people who bring a broad range of strengths and backgrounds to their roles. \n \n","url":"https://www.wikijob.co.uk/tracking_click/2018839/field_apply_now_button","salary":"","contract_type":"","vacancy_type":"Internship","location":"United Kingdom","deadline":""},{"id":"2018838","title":"Consulting","logo":"https://www.wikijob.co.uk/sites/default/files/styles/profile_job_post_logo/public/images/profiles/Logo_Oliver-Wyman_dian-hasan-branding_US-5_0.png?itok=id5VUk7x","company":"","job_role":"Management Consulting","summary":"About Us ","description":"About Us \nOliver Wyman is a global leader in management consulting. With offices in 50+ cities across 25 countries, Oliver Wyman combines deep industry knowledge with specialised expertise in strategy, operations, risk management, and organisation transformation. Our 3,000 professionals help clients optimise their business, improve their operations and risk profile, and accelerate their organisational performance to seize the most attractive opportunities.\n \nOliver Wyman’s thought leadership is evident in our agenda-setting books, white papers, research reports, and articles in the business press. To that end, the Oliver Wyman Institute connects the firm with prominent leaders of the academic community for joint research on frontier issues. The firm's Global Risk Centre analyses the increasingly complex risks that are reshaping industries, governments, and societies. The firm’s capabilities and intellectual capital are enhanced by our deep industry expertise, geographic range, analytical rigour, and hands-on, collaborative approach.\n \nOur professionals see what others don't, challenge conventional thinking, and consistently deliver innovative, customised solutions. We also work side by side with senior executives to accelerate execution through a blend of behavioural and management approaches. As a result, we have a tangible impact on clients’ top and bottom lines. Oliver Wyman is a wholly owned subsidiary of Marsh &amp; McLennan Companies (NYSE: MMC). Why Join Us? Our work is marked by exceptional impact for our clients. By consistently producing results, we have earned a reputation for quality work and attractive career opportunities.\n \nA growing, entrepreneurial firm with exceptional economics; global reach with revenues exceeding $1.5 billion in 2012 More client exposure on Day One and significant international opportunities A meritocratic ecosystem that provides for rapid advancement to Partner without an MBA Specialisation at your own pace, with an opportunity for breadth and depth Attractive compensation for performance A company that is committed to work-life balance and having fun Extensive opportunities to allow career flexibility including: corporate externships, 10/11-month work years or sabbaticals, non-profit fellowships, and international staffing opportunities The Role Our challenging Consultant position offers exceptional career growth and opportunity to motivated and hardworking graduates.\n \nAs a Consultant you will: Work in teams to solve high level business problems facing Global 1000 clients Structure and carry out essential research and analysis Lead complex quantitative, strategic and financial analyses of corporations and businesses Receive support to rapidly develop leadership and client management skills Receive broad exposure to a variety of industries including: Automotive, Aviation, Communications, Financial Services, Energy, Health &amp; Life Sciences, Media, Retail, Surface Transportation and Technology. Qualifications We look for initiative, intuition and creativity with a strong background in problem solving and analytics. We do not require a specific academic major or industry experience. One of the best things we can do for our clients and ourselves is to recruit a diverse group of people who bring a broad range of strengths and backgrounds to their roles.\n","url":"https://www.wikijob.co.uk/tracking_click/2018838/field_apply_now_button","salary":"","contract_type":"","vacancy_type":"","location":"United Kingdom","deadline":""},{"id":"2018326","title":"Graduate opportunities within Actuarial Insurance Management Solutions –Autumn 2014","logo":"https://www.wikijob.co.uk/sites/default/files/styles/profile_job_post_logo/public/images/400x400%20pwc.gif?itok=FzQ6eiqQ","company":"","job_role":"Risk, Insurance &amp; Actuarial","summary":"Your career is just that, yours. You choose it. You live it. You make it happen. To get the best from it, you need the best opportunities.","description":"Your career is just that, yours. You choose it. You live it. You make it happen. To get the best from it, you need the best opportunities.  That’s why opportunities are at the heart of a career with us.\n \nOur offer to you…\nBe part of the world’s leading professional services network and enjoy the benefits that come with that. You’ll work directly with big name clients where you’ll get to grips with the value they’re looking for by getting into the detail. We’ll provide an environment where you’ll be able to explore new opportunities, to help you grow and find your niche. And we’ll give you access to be best learning and development around.  \n \nActuarial\nAs an actuary, you’ll work with uncertainty. Using complex financial and statistical theories to calculate the likelihood of events and you’ll work out what that means financially for clients. It's highly technical work. And it’s made all the more challenging by the fact that you’ll have to present your complex findings in simple, easy to understand ways\n \nWhat you’d do\nIn Actuarial &amp; Insurance Management Solutions you’ll work with clients from the insurance industry (both life and general insurance), but also those in retail and investment banking, non-financial services corporates like energy and utilities, plus healthcare and the public sector. Your advice could cover solvency, reserving, economic capital, risk management, mergers &amp; acquisitions, company restructuring and de-risking, financial modelling, underwriting, new legislation, the viability of new products and the efficiency of claims or reporting processes.\n \nYour training and development:\nOur people make us stand out as a firm. So we choose the best and invest heavily in them. You’ll benefit from the encouragement, opportunity and support which includes: \n \nOur graduate training programme helps you gain breadth as well as depth of knowledge and build a portfolio of valuable, transferable skills.\nMovement throughout the firm – you’ll work in different teams and offices, experiencing different clients and projects.\nSupport to gain a professional qualification – study towards becoming an Actuary with the Fellow of the Institute and Faculty of Actuaries. You’ll start working towards this during your structured induction training and it's a hefty commitment, calling for a great deal of self-discipline and motivation. But we’ll provide you with study leave (about one day a week) and full financial support, internal tutorials, on-the-job coaching, formal learning courses and practical experience and a pay rise each time you pass an exam. \n \nWhat you need to bring us\nA 2:1 or above in any degree discipline\nA UCAS tariff of at least 320 (or equivalent) including a B in maths at A-level\nEqually important will be your intellect, willingness to learn, ability to build relationships, put yourself in others’ shoes, while always making a positive impact with our clients and each other.  \n \nHow to apply\nWe’re proud, based on the opportunity we offer, that students have voted us the number one Graduate Employer in The Times Top 100 Graduate Employers survey for the last nine years.  \n \nAnd we know that the skills and experiences you develop with us, will stay with you throughout your career.  So join us, and we’ll help you reach your full potential. \n \nIt’s the opportunity of a lifetime.\n \n \n","url":"https://www.wikijob.co.uk/tracking_click/2018326/field_apply_now_button","salary":"","contract_type":"Permanent","vacancy_type":"Graduate Scheme","location":"United Kingdom","deadline":""},{"id":"2014167","title":"ESL Teacher","logo":"https://www.wikijob.co.uk/sites/default/files/styles/profile_job_post_logo/public/images/profiles/logo.jpg?itok=Jn0CAt3R","company":"","job_role":"Education","summary":"Our Company\nGlobal IELTS International was established in 2001 and has expanded to a nationwide company with over 50 branches. \n ","description":"Our Company\nGlobal IELTS International was established in 2001 and has expanded to a nationwide company with over 50 branches.&nbsp;\n&nbsp;\nGlobal IELTS International specializes in preparing students for the IELTS (The International English Language Testing System) which is required for students intending to study overseas. Talking to native English speakers is an important part of the test preparation service offered by our schools.\n&nbsp;\nOther services offered by Global IELTS English School include:\n\nBEC\nTOFEL\nSAT / GCSE\nEarly years English\nVocational Learning&nbsp;\nSupplementary Educational Services\n\n\n&nbsp;\n\f\n\nOur Branch\nYangzhou Global IELTS International English School is one of the leading English schools in Jiangsu province. The staff and students are very friendly and always excited to meet the new teachers.\n&nbsp;\nThe local amenities at the Yangzhou branch are excellent with convenient stores or restaurants and the city centre is only a short bus ride away.&nbsp;\n&nbsp;\nESL teachers at the Yangzhou branch will teach for 25 one hour lessons per week with an additional 15 office hours each week.&nbsp;\n&nbsp;\nESL teachers will be expected to create a fun, dynamic and exciting learning environment for the students.&nbsp;\n&nbsp;\n&nbsp;\n\f\n\nOur City\nYangzhou is a picturesque historic Chinese city in one of the most economically developed parts of China.&nbsp;\n&nbsp;\nThe food in Yangzhou (called Huaiyang Cuisine) is one of the most famous in China and many foreigners will recognize the delicious flavors, even if they can&rsquo;t understand the names.\n&nbsp;\nYangzhou is an ancient city and was the economic capital of China in the ancient past and today seeks to reclaim its former glory. While not as busy as Nanjing or Shanghai, Yangzhou does have excellent shopping and dining facilities as well as good coach and train links to the rest of the country.\n&nbsp;\nTravel to and from Yangzhou is very convenient with good rail, coach and air connections. Taking a day trip to the nearby cities of Nanjing, Suzhou and Shanghai is very easy.\n&nbsp;\nJob Description\nESL teachers teach for 25 one hour lessons per week with an additional 15 office hours every week.&nbsp;\nTeachers have two days off per week.\nTeachers engage students in a range of spoken English exercises.\nDuration of the placement is flexible from 3 months, 6 months, to one year.\n&nbsp;\nRequirements\nApplicants must be university graduates\nDue to visa restrictions we can only accept candidates from a native English speaking country (UK, Ireland, USA, Canada, Australia or New Zealand)\n&nbsp;\nBenefits\n\n10,000 RMB salary (after tax)\n100 RMB per hour overtime rate\nCompletion bonus after 1 year&rsquo;s employment\nA working visa (Z-visa)\nInsurance\nAirport pick-up\nAssistance in locating suitable accommodation\nClass sizes limited to 20 students\nTraining and Induction period\nFree TESOL training\nFree Chinese classes\nFree staff trips&nbsp;\nFree staff nights out\n\n&nbsp;\nTo apply of if you have any enquiries , please send you CV to: hr@yzielts.com\n&nbsp;\n&nbsp;\n&nbsp;\n","url":"https://www.wikijob.co.uk/tracking_click/2014167/field_apply_now_button","salary":"","contract_type":"","vacancy_type":"","location":"China","deadline":""},{"id":"2014116","title":"Consumer Bank Fast Track Programme","logo":"https://www.wikijob.co.uk/sites/default/files/styles/profile_job_post_logo/public/images/SCB_Logo.JPG?itok=MHMTRaRa","company":"","job_role":"Banking &amp; Financial Services","summary":"Are you great at nurturing relationships? \nDo you want to be at the centre of your customers' world, helping them with some of life's most important moments?   ","description":"Are you great at nurturing relationships? \nDo you want to be at the centre of your customers' world, helping them with some of life's most important moments?   \nIs your career about more than just the money? \nConsumer Bank Fast Track Programme applicants must also possess an undergraduate degree, in any discipline. \n \nOur Consumer Bank is the pulse of the economy.  Working at the frontline, we help our customers through some of life’s most important phases, while continually shaping the future of banking.\n \nEvery day, we ensure that the borrowing, wealth management and daily banking needs of 13 million customers worldwide are met through a full suite of innovative products and services.\n \nThe 12-month Consumer Bank Fast Track Programme (18 months in certain markets) is an accelerated programme that aims to nurture your capabilities towards a career as a world-class banker.\n \nFrom the front lines of sales and service, you’ll develop the skills and knowledge required to be the face of Standard Chartered, enabling you to build strong relationships with our customers to grow their wealth and meet their banking needs.\n \nPerform and shine in a key revenue generating role with one of our most valued business lines targeted at the high value client segments. \n \nExplore your future by clicking below. \n \n","url":"https://www.wikijob.co.uk/tracking_click/2014116/field_apply_now_button","salary":"","contract_type":"","vacancy_type":"Graduate Scheme","location":"International","deadline":""},{"id":"2014115","title":"Specialist Functions International Graduate Programme","logo":"https://www.wikijob.co.uk/sites/default/files/styles/profile_job_post_logo/public/images/SCB_Logo.JPG?itok=MHMTRaRa","company":"","job_role":"Banking &amp; Financial Services, Accounting, Auditing &amp; Finance","summary":"Do you want to work behind the scenes, in a specialist function? \nDoes complexity stimulate and excite you? \nAre you a specialist with a passion for people or numbers? ","description":"Do you want to work behind the scenes, in a specialist function? \nDoes complexity stimulate and excite you? \nAre you a specialist with a passion for people or numbers? \nSpecialist Functions International Graduate Programme applicants must also possess an undergraduate degree.\n \nThere's a whole lot more to banking than finance. Are you a passionate people person interested in Human Resources? Or an accounting or audit professional? If so, an exciting challenge awaits. \n \nThe successful running of the Bank lies within the Specialist Functions, the backbone of the organisation, expertly managing internal processes to ensure we operate like a well-oiled machine. The team provides the infrastructure critical to our day-to-day business, and the expertise needed to shape the future of the Bank.  Together, Human Resources and Group Internal Audit manage 2,500 buildings in 68 markets and all the systems, processes and structures to ensure an efficient operation.\n \nThe 18 month Specialist Functions International Graduate Programme is an intensive development programme that aims to build your capabilities towards a specialist career in a niche area of the Bank.\n \nExplore your future by clicking below. \n \n","url":"https://www.wikijob.co.uk/tracking_click/2014115/field_apply_now_button","salary":"","contract_type":"","vacancy_type":"Graduate Scheme","location":"International","deadline":""},{"id":"2014114","title":"Wholesale Bank International Graduate Programme","logo":"https://www.wikijob.co.uk/sites/default/files/styles/profile_job_post_logo/public/images/SCB_Logo.JPG?itok=MHMTRaRa","company":"","job_role":"Banking &amp; Financial Services, Retail, FMCG &amp; Manufacturing","summary":"Do you want to learn and develop deep technical expertise? \nAre you brilliant at analysing millions of data points, and connecting the dots to find the story? ","description":"Do you want to learn and develop deep technical expertise? \nAre you brilliant at analysing millions of data points, and connecting the dots to find the story? \nDo you thrive under pressure and find opportunities in demanding circumstances?\nWholesale Bank International Graduate Programme applicants must also possess an undergraduate degree, in any discipline.\n \nDoes solving complex problems inspire you?  Are you interested in a global career working with international clients across borders or moving internationally yourself?  Do you like the fast pace of the trading floor? Do you want the opportunity to inject your ideas and energy into the work you do every day?\n \nThe 12 month Wholesale Bank International Graduate Programme is the platform for you to hone your technical knowledge, become an expert in your chosen area and accelerate your growth towards a specialist role in a key area of our business.  Whether it’s supporting trade between China and Africa, advising on a potential merger or working on the biggest trading floor in Asia, you’ll be given the opportunity every day to play a role in reshaping the future of the industry.  \n \nIn today’s global economy, Wholesale Banking plays a crucial role in helping clients facilitate commerce across some of the world’s fastest growing and most dynamic markets.\n \nExplore your future by clicking below.\n \n \n","url":"https://www.wikijob.co.uk/tracking_click/2014114/field_apply_now_button","salary":"","contract_type":"","vacancy_type":"Graduate Scheme","location":"International","deadline":""},{"id":"2014113","title":"Consumer Bank International Graduate Programme","logo":"https://www.wikijob.co.uk/sites/default/files/styles/profile_job_post_logo/public/images/SCB_Logo.JPG?itok=MHMTRaRa","company":"","job_role":"Banking &amp; Financial Services, Accounting, Auditing &amp; Finance, Risk, Insurance &amp; Actuarial","summary":"Are you a natural leader? \nCan you instantly build rapport and develop strong relationships with people? ","description":"Are you a natural leader? \nCan you instantly build rapport and develop strong relationships with people? \nDo you have an intense curiosity for a range of broad topics from marketing, to product development, technology and customer service? \nCan you motivate others to succeed? Do you want to be a successful leader in banking by the time you are 30? Are you comfortable being a little out of your depth? \nTo become a great leader in an emerging market, you must grow and develop yourself faster than your country is growing.   The Consumer Bank International Graduate Programme provides the platform to create change, to challenge the way things are done, and to define the future of the Bank. Whether it’s developing new products, working at the intersection between technology and psychology or leading a branch network, you’ll be expected to lead, to inspire and to connect with our customers.\n \nThis is a generalist programme where you can develop experience and exposure across the bank. From Lending, to Credit, to High Net Worth or SME banking, we encourage you to challenge and stretch yourself. \n \nThe programme is designed to prepare you for a challenging role as a future leader, while enabling you to take sensible risks, and explore the different paths that will enable you to shine.  Over the course of 24 months, you can take part in comprehensive induction, academic and learning programmes, which together lay the foundation for your future success.\n \nExplore your future by clicking below. \n \n \n","url":"https://www.wikijob.co.uk/tracking_click/2014113/field_apply_now_button","salary":"","contract_type":"","vacancy_type":"Graduate Scheme","location":"International","deadline":""},{"id":"2010930","title":"Future Talent Opportunities","logo":"https://www.wikijob.co.uk/sites/default/files/styles/profile_job_post_logo/public/images/profiles/finallogoblue.jpg?itok=mgNtK1i8","company":"","job_role":"Banking &amp; Financial Services, Business &amp; Management","summary":"COMMODITY TRADING ∙ RISK MANAGEMENT ∙ FINANCE ∙ ASSET MANAGEMENT\n ","description":"COMMODITY TRADING ∙ RISK MANAGEMENT ∙ FINANCE ∙ ASSET MANAGEMENT\n \nTrafigura trades commodities, such as crude oil, refined products, concentrates, refined metals and bulk and provides the ships and facilities to store and transport them. Physical trading is a long-term business. Investment in and access to key physical assets around the world is central to our business model. Management of ships, storage tanks, mines and other logistical assets gives us a business advantage while demonstrating our commitment to the territories in which we operate. With a turnover of US$ 79 billion in 2010 we operate in offices in 44 countries across the globe trading over 2 million barrels a day of crude and oil products and over 9 million tons of concentrates and refined metals per annum.\n \nOur ‘Future Talent’ development programmes have been designed to identify and develop the strongest candidates with the highest potential, providing immediate and thorough exposure to some of the most exciting, interesting and successful trading and financing strategies on the global market coupled with the support and training that is required to flourish. The environment is highly demanding and candidates who approach the learning process with real passion and commitment will quickly see the benefits of gaining an established foundation from which to catapult their career.\n \nGENEVA, HOUSTON, SINGAPORE\n \nOur two year graduate development programme is designed to provide you with a structured series of rotations across business areas such as Credit, Corporate Affairs, Corporate Finance, Deals Desk, Trade Finance and Operations ensuring that you have a comprehensive understanding of all areas of the business, opening up a future of unlimited opportunities within Trafigura.\n \nAs part of the 2 year program you will have the opportunity to carry out one of three 8 month rotations in a different country to that of your initial application. 8 month rotations may include the following locations: Buenos Aires, Dubai, Geneva, Houston, Johannesburg and Singapore. A minimum requirement of a 2:1(or equivalent) in any discipline and fluent English is essential.\n \nSHANGHAI\n \nSituated in Lu Jia Zui, the only finance and trade zone among the 185 state-level development zones in mainland China. The activities in the Shanghai office focus on commodity trading in non-ferrous metals i.e. concentrates and refined metals, iron ore, scrap, coal and derivatives, a particularly exciting area due to significant domestic trading business. The graduate programme for China will be based in the Mirae Asset Tower, Shanghai.\n \nAs a successful candidate you will be given the opportunity to complete 3 x 8 month rotations across: Traffic Operations, Deals Desk and Finance, ensuring a comprehensive understanding of all areas of the business and equipping you with the tools and support to develop a hugely successful career with Trafigura. Proficient in Mandarin and English both written and oral, successful candidates will be passionate and ambitious, with real integrity. A natural ability to multi task, great under pressure and able to work within an ambiguous, fast-moving environment.\n \nBUENOS AIRES\n \nSituated in the Puerto Madero area of the city, the activities in the Buenos Aires office cover commercial, trading, shipping operations and chartering. This is a particularly exiting area as it actively manages all imports and exports in the Latin American region, working closely with the national oil companies and our Puma logistics and distribution division.\n \nThe Buenos Aires graduate programme offers 2 years structured exposure within the Operations department. Within a fast paced, exciting and hugely rewarding environment, successful candidates will be exposed to the various aspects of the import, export and handling of petroleum products, creating the perfect platform to launch a long term career within Trafigura. Academic knowledge and a personal interest of petroleum products and industry is a real plus. Successful candidates, as well as being highly numerate and having excellent personal skills will also be bi-lingual with English and Spanish.\n \nLONDON, SHANGHAI\n \nTech Opportunities - Oracle, SQL Server, Scala, Java, Erlang, C# and F#\n \nTrafigura is on a multi-year redevelopment of its technology environment which provides sophisticated trading and risk management systems across our oil, refined metals, concentrates and hedge fund businesses. The technology set currently includes Oracle, SQL Server, Scala, Java, Erlang, C# and F# running on a mixture of Windows and Linux.\n \nWe practice agile methodologies and particularly value a very close relationship between technologists and business users in order to meet the needs of this fast moving, international commodities trading business.\n \nWe are looking for people who like responsibility and want a challenge every day. We want to see those who are opinionated and passionate about technology. In return we offer a whirlwind tour of the business, rotating around the different groups within Trafigura; trading, finance, support and operations before starting your initial 3 month project in technology. After successfully completing two IT projects you will then take up a full-time position in the area most suited to your skills and desires.\n \nAcademic Requirements: Minimum 2:1 in Computer Science (or related degree) and fluent English.\n","url":"https://www.wikijob.co.uk/tracking_click/2010930/field_apply_now_button","salary":"Competitive","contract_type":"","vacancy_type":"Graduate Scheme","location":"United Kingdom","deadline":""}]